autosportlabs/RaceCapture-Pro_firmware/stm32_base/libs/FreeRTOSV7.6.0/FreeRTOS/Source/portable/GCC/ARM7_AT91SAM7S/ioat91sam7x256.h
// *****************************************************************************
//              SOFTWARE API DEFINITION  FOR Control Area Network Interface
// *****************************************************************************
typedef struct _AT91S_CAN {
    AT91_REG	 CAN_MR; 	// Mode Register
    AT91_REG	 CAN_IER; 	// Interrupt Enable Register
    AT91_REG	 CAN_IDR; 	// Interrupt Disable Register
    AT91_REG	 CAN_IMR; 	// Interrupt Mask Register
    AT91_REG	 CAN_SR; 	// Status Register
    AT91_REG	 CAN_BR; 	// Baudrate Register
    AT91_REG	 CAN_TIM; 	// Timer Register
    AT91_REG	 CAN_TIMESTP; 	// Time Stamp Register
    AT91_REG	 CAN_ECR; 	// Error Counter Register
    AT91_REG	 CAN_TCR; 	// Transfer Command Register
    AT91_REG	 CAN_ACR; 	// Abort Command Register
    AT91_REG	 Reserved0[52]; 	//
    AT91_REG	 CAN_VR; 	// Version Register
    AT91_REG	 Reserved1[64]; 	//
    AT91S_CAN_MB	 CAN_MB0; 	// CAN Mailbox 0
    AT91S_CAN_MB	 CAN_MB1; 	// CAN Mailbox 1
    AT91S_CAN_MB	 CAN_MB2; 	// CAN Mailbox 2
    AT91S_CAN_MB	 CAN_MB3; 	// CAN Mailbox 3
    AT91S_CAN_MB	 CAN_MB4; 	// CAN Mailbox 4
    AT91S_CAN_MB	 CAN_MB5; 	// CAN Mailbox 5
    AT91S_CAN_MB	 CAN_MB6; 	// CAN Mailbox 6
    AT91S_CAN_MB	 CAN_MB7; 	// CAN Mailbox 7
    AT91S_CAN_MB	 CAN_MB8; 	// CAN Mailbox 8
    AT91S_CAN_MB	 CAN_MB9; 	// CAN Mailbox 9
    AT91S_CAN_MB	 CAN_MB10; 	// CAN Mailbox 10
    AT91S_CAN_MB	 CAN_MB11; 	// CAN Mailbox 11
    AT91S_CAN_MB	 CAN_MB12; 	// CAN Mailbox 12
    AT91S_CAN_MB	 CAN_MB13; 	// CAN Mailbox 13
    AT91S_CAN_MB	 CAN_MB14; 	// CAN Mailbox 14
    AT91S_CAN_MB	 CAN_MB15; 	// CAN Mailbox 15
} AT91S_CAN, *AT91PS_CAN;

// -------- CAN_MR : (CAN Offset: 0x0) CAN Mode Register --------
#define AT91C_CAN_CANEN       ((unsigned int) 0x1 <<  0) // (CAN) CAN Controller Enable
#define AT91C_CAN_LPM         ((unsigned int) 0x1 <<  1) // (CAN) Disable/Enable Low Power Mode
#define AT91C_CAN_ABM         ((unsigned int) 0x1 <<  2) // (CAN) Disable/Enable Autobaud/Listen Mode
#define AT91C_CAN_OVL         ((unsigned int) 0x1 <<  3) // (CAN) Disable/Enable Overload Frame
#define AT91C_CAN_TEOF        ((unsigned int) 0x1 <<  4) // (CAN) Time Stamp messages at each end of Frame
#define AT91C_CAN_TTM         ((unsigned int) 0x1 <<  5) // (CAN) Disable/Enable Time Trigger Mode
#define AT91C_CAN_TIMFRZ      ((unsigned int) 0x1 <<  6) // (CAN) Enable Timer Freeze
#define AT91C_CAN_DRPT        ((unsigned int) 0x1 <<  7) // (CAN) Disable Repeat
// -------- CAN_IER : (CAN Offset: 0x4) CAN Interrupt Enable Register --------
#define AT91C_CAN_MB0         ((unsigned int) 0x1 <<  0) // (CAN) Mailbox 0 Flag
#define AT91C_CAN_MB1         ((unsigned int) 0x1 <<  1) // (CAN) Mailbox 1 Flag
#define AT91C_CAN_MB2         ((unsigned int) 0x1 <<  2) // (CAN) Mailbox 2 Flag
#define AT91C_CAN_MB3         ((unsigned int) 0x1 <<  3) // (CAN) Mailbox 3 Flag
#define AT91C_CAN_MB4         ((unsigned int) 0x1 <<  4) // (CAN) Mailbox 4 Flag
#define AT91C_CAN_MB5         ((unsigned int) 0x1 <<  5) // (CAN) Mailbox 5 Flag
#define AT91C_CAN_MB6         ((unsigned int) 0x1 <<  6) // (CAN) Mailbox 6 Flag
#define AT91C_CAN_MB7         ((unsigned int) 0x1 <<  7) // (CAN) Mailbox 7 Flag
#define AT91C_CAN_MB8         ((unsigned int) 0x1 <<  8) // (CAN) Mailbox 8 Flag
#define AT91C_CAN_MB9         ((unsigned int) 0x1 <<  9) // (CAN) Mailbox 9 Flag
#define AT91C_CAN_MB10        ((unsigned int) 0x1 << 10) // (CAN) Mailbox 10 Flag
#define AT91C_CAN_MB11        ((unsigned int) 0x1 << 11) // (CAN) Mailbox 11 Flag
#define AT91C_CAN_MB12        ((unsigned int) 0x1 << 12) // (CAN) Mailbox 12 Flag
#define AT91C_CAN_MB13        ((unsigned int) 0x1 << 13) // (CAN) Mailbox 13 Flag
#define AT91C_CAN_MB14        ((unsigned int) 0x1 << 14) // (CAN) Mailbox 14 Flag
#define AT91C_CAN_MB15        ((unsigned int) 0x1 << 15) // (CAN) Mailbox 15 Flag
#define AT91C_CAN_ERRA        ((unsigned int) 0x1 << 16) // (CAN) Error Active Mode Flag
#define AT91C_CAN_WARN        ((unsigned int) 0x1 << 17) // (CAN) Warning Limit Flag
#define AT91C_CAN_ERRP        ((unsigned int) 0x1 << 18) // (CAN) Error Passive Mode Flag
#define AT91C_CAN_BOFF        ((unsigned int) 0x1 << 19) // (CAN) Bus Off Mode Flag
#define AT91C_CAN_SLEEP       ((unsigned int) 0x1 << 20) // (CAN) Sleep Flag
#define AT91C_CAN_WAKEUP      ((unsigned int) 0x1 << 21) // (CAN) Wakeup Flag
#define AT91C_CAN_TOVF        ((unsigned int) 0x1 << 22) // (CAN) Timer Overflow Flag
#define AT91C_CAN_TSTP        ((unsigned int) 0x1 << 23) // (CAN) Timestamp Flag
#define AT91C_CAN_CERR        ((unsigned int) 0x1 << 24) // (CAN) CRC Error
#define AT91C_CAN_SERR        ((unsigned int) 0x1 << 25) // (CAN) Stuffing Error
#define AT91C_CAN_AERR        ((unsigned int) 0x1 << 26) // (CAN) Acknowledgment Error
#define AT91C_CAN_FERR        ((unsigned int) 0x1 << 27) // (CAN) Form Error
#define AT91C_CAN_BERR        ((unsigned int) 0x1 << 28) // (CAN) Bit Error
// -------- CAN_IDR : (CAN Offset: 0x8) CAN Interrupt Disable Register --------
// -------- CAN_IMR : (CAN Offset: 0xc) CAN Interrupt Mask Register --------
// -------- CAN_SR : (CAN Offset: 0x10) CAN Status Register --------
#define AT91C_CAN_RBSY        ((unsigned int) 0x1 << 29) // (CAN) Receiver Busy
#define AT91C_CAN_TBSY        ((unsigned int) 0x1 << 30) // (CAN) Transmitter Busy
#define AT91C_CAN_OVLY        ((unsigned int) 0x1 << 31) // (CAN) Overload Busy
// -------- CAN_BR : (CAN Offset: 0x14) CAN Baudrate Register --------
#define AT91C_CAN_PHASE2      ((unsigned int) 0x7 <<  0) // (CAN) Phase 2 segment
#define AT91C_CAN_PHASE1      ((unsigned int) 0x7 <<  4) // (CAN) Phase 1 segment
#define AT91C_CAN_PROPAG      ((unsigned int) 0x7 <<  8) // (CAN) Programmation time segment
#define AT91C_CAN_SYNC        ((unsigned int) 0x3 << 12) // (CAN) Re-synchronization jump width segment
#define AT91C_CAN_BRP         ((unsigned int) 0x7F << 16) // (CAN) Baudrate Prescaler
#define AT91C_CAN_SMP         ((unsigned int) 0x1 << 24) // (CAN) Sampling mode
// -------- CAN_TIM : (CAN Offset: 0x18) CAN Timer Register --------
#define AT91C_CAN_TIMER       ((unsigned int) 0xFFFF <<  0) // (CAN) Timer field
// -------- CAN_TIMESTP : (CAN Offset: 0x1c) CAN Timestamp Register --------
// -------- CAN_ECR : (CAN Offset: 0x20) CAN Error Counter Register --------
#define AT91C_CAN_REC         ((unsigned int) 0xFF <<  0) // (CAN) Receive Error Counter
#define AT91C_CAN_TEC         ((unsigned int) 0xFF << 16) // (CAN) Transmit Error Counter
// -------- CAN_TCR : (CAN Offset: 0x24) CAN Transfer Command Register --------
#define AT91C_CAN_TIMRST      ((unsigned int) 0x1 << 31) // (CAN) Timer Reset Field
// -------- CAN_ACR : (CAN Offset: 0x28) CAN Abort Command Register --------

// *****************************************************************************
//              SOFTWARE API DEFINITION  FOR Ethernet MAC 10/100
// *****************************************************************************
typedef struct _AT91S_EMAC {
    AT91_REG	 EMAC_NCR; 	// Network Control Register
    AT91_REG	 EMAC_NCFGR; 	// Network Configuration Register
    AT91_REG	 EMAC_NSR; 	// Network Status Register
    AT91_REG	 Reserved0[2]; 	//
    AT91_REG	 EMAC_TSR; 	// Transmit Status Register
    AT91_REG	 EMAC_RBQP; 	// Receive Buffer Queue Pointer
    AT91_REG	 EMAC_TBQP; 	// Transmit Buffer Queue Pointer
    AT91_REG	 EMAC_RSR; 	// Receive Status Register
    AT91_REG	 EMAC_ISR; 	// Interrupt Status Register
    AT91_REG	 EMAC_IER; 	// Interrupt Enable Register
    AT91_REG	 EMAC_IDR; 	// Interrupt Disable Register
    AT91_REG	 EMAC_IMR; 	// Interrupt Mask Register
    AT91_REG	 EMAC_MAN; 	// PHY Maintenance Register
    AT91_REG	 EMAC_PTR; 	// Pause Time Register
    AT91_REG	 EMAC_PFR; 	// Pause Frames received Register
    AT91_REG	 EMAC_FTO; 	// Frames Transmitted OK Register
    AT91_REG	 EMAC_SCF; 	// Single Collision Frame Register
    AT91_REG	 EMAC_MCF; 	// Multiple Collision Frame Register
    AT91_REG	 EMAC_FRO; 	// Frames Received OK Register
    AT91_REG	 EMAC_FCSE; 	// Frame Check Sequence Error Register
    AT91_REG	 EMAC_ALE; 	// Alignment Error Register
    AT91_REG	 EMAC_DTF; 	// Deferred Transmission Frame Register
    AT91_REG	 EMAC_LCOL; 	// Late Collision Register
    AT91_REG	 EMAC_ECOL; 	// Excessive Collision Register
    AT91_REG	 EMAC_TUND; 	// Transmit Underrun Error Register
    AT91_REG	 EMAC_CSE; 	// Carrier Sense Error Register
    AT91_REG	 EMAC_RRE; 	// Receive Ressource Error Register
    AT91_REG	 EMAC_ROV; 	// Receive Overrun Errors Register
    AT91_REG	 EMAC_RSE; 	// Receive Symbol Errors Register
    AT91_REG	 EMAC_ELE; 	// Excessive Length Errors Register
    AT91_REG	 EMAC_RJA; 	// Receive Jabbers Register
    AT91_REG	 EMAC_USF; 	// Undersize Frames Register
    AT91_REG	 EMAC_STE; 	// SQE Test Error Register
    AT91_REG	 EMAC_RLE; 	// Receive Length Field Mismatch Register
    AT91_REG	 EMAC_TPF; 	// Transmitted Pause Frames Register
    AT91_REG	 EMAC_HRB; 	// Hash Address Bottom[31:0]
    AT91_REG	 EMAC_HRT; 	// Hash Address Top[63:32]
    AT91_REG	 EMAC_SA1L; 	// Specific Address 1 Bottom, First 4 bytes
    AT91_REG	 EMAC_SA1H; 	// Specific Address 1 Top, Last 2 bytes
    AT91_REG	 EMAC_SA2L; 	// Specific Address 2 Bottom, First 4 bytes
    AT91_REG	 EMAC_SA2H; 	// Specific Address 2 Top, Last 2 bytes
    AT91_REG	 EMAC_SA3L; 	// Specific Address 3 Bottom, First 4 bytes
    AT91_REG	 EMAC_SA3H; 	// Specific Address 3 Top, Last 2 bytes
    AT91_REG	 EMAC_SA4L; 	// Specific Address 4 Bottom, First 4 bytes
    AT91_REG	 EMAC_SA4H; 	// Specific Address 4 Top, Last 2 bytes
    AT91_REG	 EMAC_TID; 	// Type ID Checking Register
    AT91_REG	 EMAC_TPQ; 	// Transmit Pause Quantum Register
    AT91_REG	 EMAC_USRIO; 	// USER Input/Output Register
    AT91_REG	 EMAC_WOL; 	// Wake On LAN Register
    AT91_REG	 Reserved1[13]; 	//
    AT91_REG	 EMAC_REV; 	// Revision Register
} AT91S_EMAC, *AT91PS_EMAC;

