autosportlabs/RaceCapture-Pro_firmware/stm32_base/libs/FreeRTOSV7.6.0/FreeRTOS/Source/portable/GCC/ARM7_AT91SAM7S/ioat91sam7x256.h
// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR Memory Controller Interface
// - *****************************************************************************
// - -------- MC_RCR : (MC Offset: 0x0) MC Remap Control Register --------
AT91C_MC_RCB              EQU (0x1 <<  0) ;
- (MC) Remap Command Bit
// - -------- MC_ASR : (MC Offset: 0x4) MC Abort Status Register --------
AT91C_MC_UNDADD           EQU (0x1 <<  0) ;
- (MC) Undefined Addess Abort Status
AT91C_MC_MISADD           EQU (0x1 <<  1) ;
- (MC) Misaligned Addess Abort Status
AT91C_MC_ABTSZ            EQU (0x3 <<  8) ;
- (MC) Abort Size Status
AT91C_MC_ABTSZ_BYTE       EQU (0x0 <<  8) ;
- (MC) Byte
AT91C_MC_ABTSZ_HWORD      EQU (0x1 <<  8) ;
- (MC) Half-word
AT91C_MC_ABTSZ_WORD       EQU (0x2 <<  8) ;
- (MC) Word
AT91C_MC_ABTTYP           EQU (0x3 << 10) ;
- (MC) Abort Type Status
AT91C_MC_ABTTYP_DATAR     EQU (0x0 << 10) ;
- (MC) Data Read
AT91C_MC_ABTTYP_DATAW     EQU (0x1 << 10) ;
- (MC) Data Write
AT91C_MC_ABTTYP_FETCH     EQU (0x2 << 10) ;
- (MC) Code Fetch
AT91C_MC_MST0             EQU (0x1 << 16) ;
- (MC) Master 0 Abort Source
AT91C_MC_MST1             EQU (0x1 << 17) ;
- (MC) Master 1 Abort Source
AT91C_MC_SVMST0           EQU (0x1 << 24) ;
- (MC) Saved Master 0 Abort Source
AT91C_MC_SVMST1           EQU (0x1 << 25) ;
- (MC) Saved Master 1 Abort Source
// - -------- MC_FMR : (MC Offset: 0x60) MC Flash Mode Register --------
AT91C_MC_FRDY             EQU (0x1 <<  0) ;
- (MC) Flash Ready
AT91C_MC_LOCKE            EQU (0x1 <<  2) ;
- (MC) Lock Error
AT91C_MC_PROGE            EQU (0x1 <<  3) ;
- (MC) Programming Error
AT91C_MC_NEBP             EQU (0x1 <<  7) ;
- (MC) No Erase Before Programming
AT91C_MC_FWS              EQU (0x3 <<  8) ;
- (MC) Flash Wait State
AT91C_MC_FWS_0FWS         EQU (0x0 <<  8) ;
- (MC) 1 cycle for Read, 2 for Write operations
    AT91C_MC_FWS_1FWS         EQU (0x1 <<  8) ;
- (MC) 2 cycles for Read, 3 for Write operations
    AT91C_MC_FWS_2FWS         EQU (0x2 <<  8) ;
- (MC) 3 cycles for Read, 4 for Write operations
    AT91C_MC_FWS_3FWS         EQU (0x3 <<  8) ;
- (MC) 4 cycles for Read, 4 for Write operations
    AT91C_MC_FMCN             EQU (0xFF << 16) ;
- (MC) Flash Microsecond Cycle Number
// - -------- MC_FCR : (MC Offset: 0x64) MC Flash Command Register --------
AT91C_MC_FCMD             EQU (0xF <<  0) ;
- (MC) Flash Command
AT91C_MC_FCMD_START_PROG  EQU (0x1) ;
- (MC) Starts the programming of th epage specified by PAGEN.
AT91C_MC_FCMD_LOCK        EQU (0x2) ;
- (MC) Starts a lock sequence of the sector defined by the bits 4 to 7 of the field PAGEN.
AT91C_MC_FCMD_PROG_AND_LOCK EQU (0x3) ;
- (MC) The lock sequence automatically happens after the programming sequence is completed.
AT91C_MC_FCMD_UNLOCK      EQU (0x4) ;
- (MC) Starts an unlock sequence of the sector defined by the bits 4 to 7 of the field PAGEN.
AT91C_MC_FCMD_ERASE_ALL   EQU (0x8) ;
- (MC) Starts the erase of the entire flash.If at least a page is locked, the command is cancelled.
AT91C_MC_FCMD_SET_GP_NVM  EQU (0xB) ;
- (MC) Set General Purpose NVM bits.
AT91C_MC_FCMD_CLR_GP_NVM  EQU (0xD) ;
- (MC) Clear General Purpose NVM bits.
AT91C_MC_FCMD_SET_SECURITY EQU (0xF) ;
- (MC) Set Security Bit.
AT91C_MC_PAGEN            EQU (0x3FF <<  8) ;
- (MC) Page Number
AT91C_MC_KEY              EQU (0xFF << 24) ;
- (MC) Writing Protect Key
// - -------- MC_FSR : (MC Offset: 0x68) MC Flash Command Register --------
AT91C_MC_SECURITY         EQU (0x1 <<  4) ;
- (MC) Security Bit Status
AT91C_MC_GPNVM0           EQU (0x1 <<  8) ;
- (MC) Sector 0 Lock Status
AT91C_MC_GPNVM1           EQU (0x1 <<  9) ;
- (MC) Sector 1 Lock Status
AT91C_MC_GPNVM2           EQU (0x1 << 10) ;
- (MC) Sector 2 Lock Status
AT91C_MC_GPNVM3           EQU (0x1 << 11) ;
- (MC) Sector 3 Lock Status
AT91C_MC_GPNVM4           EQU (0x1 << 12) ;
- (MC) Sector 4 Lock Status
AT91C_MC_GPNVM5           EQU (0x1 << 13) ;
- (MC) Sector 5 Lock Status
AT91C_MC_GPNVM6           EQU (0x1 << 14) ;
- (MC) Sector 6 Lock Status
AT91C_MC_GPNVM7           EQU (0x1 << 15) ;
- (MC) Sector 7 Lock Status
AT91C_MC_LOCKS0           EQU (0x1 << 16) ;
- (MC) Sector 0 Lock Status
AT91C_MC_LOCKS1           EQU (0x1 << 17) ;
- (MC) Sector 1 Lock Status
AT91C_MC_LOCKS2           EQU (0x1 << 18) ;
- (MC) Sector 2 Lock Status
AT91C_MC_LOCKS3           EQU (0x1 << 19) ;
- (MC) Sector 3 Lock Status
AT91C_MC_LOCKS4           EQU (0x1 << 20) ;
- (MC) Sector 4 Lock Status
AT91C_MC_LOCKS5           EQU (0x1 << 21) ;
- (MC) Sector 5 Lock Status
AT91C_MC_LOCKS6           EQU (0x1 << 22) ;
- (MC) Sector 6 Lock Status
AT91C_MC_LOCKS7           EQU (0x1 << 23) ;
- (MC) Sector 7 Lock Status
AT91C_MC_LOCKS8           EQU (0x1 << 24) ;
- (MC) Sector 8 Lock Status
AT91C_MC_LOCKS9           EQU (0x1 << 25) ;
- (MC) Sector 9 Lock Status
AT91C_MC_LOCKS10          EQU (0x1 << 26) ;
- (MC) Sector 10 Lock Status
AT91C_MC_LOCKS11          EQU (0x1 << 27) ;
- (MC) Sector 11 Lock Status
AT91C_MC_LOCKS12          EQU (0x1 << 28) ;
- (MC) Sector 12 Lock Status
AT91C_MC_LOCKS13          EQU (0x1 << 29) ;
- (MC) Sector 13 Lock Status
AT91C_MC_LOCKS14          EQU (0x1 << 30) ;
- (MC) Sector 14 Lock Status
AT91C_MC_LOCKS15          EQU (0x1 << 31) ;
- (MC) Sector 15 Lock Status

// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR Serial Parallel Interface
// - *****************************************************************************
// - -------- SPI_CR : (SPI Offset: 0x0) SPI Control Register --------
AT91C_SPI_SPIEN           EQU (0x1 <<  0) ;
- (SPI) SPI Enable
AT91C_SPI_SPIDIS          EQU (0x1 <<  1) ;
- (SPI) SPI Disable
AT91C_SPI_SWRST           EQU (0x1 <<  7) ;
- (SPI) SPI Software reset
AT91C_SPI_LASTXFER        EQU (0x1 << 24) ;
- (SPI) SPI Last Transfer
// - -------- SPI_MR : (SPI Offset: 0x4) SPI Mode Register --------
AT91C_SPI_MSTR            EQU (0x1 <<  0) ;
- (SPI) Master/Slave Mode
AT91C_SPI_PS              EQU (0x1 <<  1) ;
- (SPI) Peripheral Select
AT91C_SPI_PS_FIXED        EQU (0x0 <<  1) ;
- (SPI) Fixed Peripheral Select
AT91C_SPI_PS_VARIABLE     EQU (0x1 <<  1) ;
- (SPI) Variable Peripheral Select
AT91C_SPI_PCSDEC          EQU (0x1 <<  2) ;
- (SPI) Chip Select Decode
AT91C_SPI_FDIV            EQU (0x1 <<  3) ;
- (SPI) Clock Selection
AT91C_SPI_MODFDIS         EQU (0x1 <<  4) ;
- (SPI) Mode Fault Detection
AT91C_SPI_LLB             EQU (0x1 <<  7) ;
- (SPI) Clock Selection
AT91C_SPI_PCS             EQU (0xF << 16) ;
- (SPI) Peripheral Chip Select
AT91C_SPI_DLYBCS          EQU (0xFF << 24) ;
- (SPI) Delay Between Chip Selects
// - -------- SPI_RDR : (SPI Offset: 0x8) Receive Data Register --------
AT91C_SPI_RD              EQU (0xFFFF <<  0) ;
- (SPI) Receive Data
AT91C_SPI_RPCS            EQU (0xF << 16) ;
- (SPI) Peripheral Chip Select Status
// - -------- SPI_TDR : (SPI Offset: 0xc) Transmit Data Register --------
AT91C_SPI_TD              EQU (0xFFFF <<  0) ;
- (SPI) Transmit Data
AT91C_SPI_TPCS            EQU (0xF << 16) ;
- (SPI) Peripheral Chip Select Status
// - -------- SPI_SR : (SPI Offset: 0x10) Status Register --------
AT91C_SPI_RDRF            EQU (0x1 <<  0) ;
- (SPI) Receive Data Register Full
AT91C_SPI_TDRE            EQU (0x1 <<  1) ;
- (SPI) Transmit Data Register Empty
AT91C_SPI_MODF            EQU (0x1 <<  2) ;
- (SPI) Mode Fault Error
AT91C_SPI_OVRES           EQU (0x1 <<  3) ;
- (SPI) Overrun Error Status
AT91C_SPI_ENDRX           EQU (0x1 <<  4) ;
- (SPI) End of Receiver Transfer
AT91C_SPI_ENDTX           EQU (0x1 <<  5) ;
- (SPI) End of Receiver Transfer
AT91C_SPI_RXBUFF          EQU (0x1 <<  6) ;
- (SPI) RXBUFF Interrupt
AT91C_SPI_TXBUFE          EQU (0x1 <<  7) ;
- (SPI) TXBUFE Interrupt
AT91C_SPI_NSSR            EQU (0x1 <<  8) ;
- (SPI) NSSR Interrupt
AT91C_SPI_TXEMPTY         EQU (0x1 <<  9) ;
- (SPI) TXEMPTY Interrupt
AT91C_SPI_SPIENS          EQU (0x1 << 16) ;
- (SPI) Enable Status
// - -------- SPI_IER : (SPI Offset: 0x14) Interrupt Enable Register --------
// - -------- SPI_IDR : (SPI Offset: 0x18) Interrupt Disable Register --------
// - -------- SPI_IMR : (SPI Offset: 0x1c) Interrupt Mask Register --------
// - -------- SPI_CSR : (SPI Offset: 0x30) Chip Select Register --------
AT91C_SPI_CPOL            EQU (0x1 <<  0) ;
- (SPI) Clock Polarity
AT91C_SPI_NCPHA           EQU (0x1 <<  1) ;
- (SPI) Clock Phase
AT91C_SPI_CSAAT           EQU (0x1 <<  3) ;
- (SPI) Chip Select Active After Transfer
AT91C_SPI_BITS            EQU (0xF <<  4) ;
- (SPI) Bits Per Transfer
AT91C_SPI_BITS_8          EQU (0x0 <<  4) ;
- (SPI) 8 Bits Per transfer
AT91C_SPI_BITS_9          EQU (0x1 <<  4) ;
- (SPI) 9 Bits Per transfer
AT91C_SPI_BITS_10         EQU (0x2 <<  4) ;
- (SPI) 10 Bits Per transfer
AT91C_SPI_BITS_11         EQU (0x3 <<  4) ;
- (SPI) 11 Bits Per transfer
AT91C_SPI_BITS_12         EQU (0x4 <<  4) ;
- (SPI) 12 Bits Per transfer
AT91C_SPI_BITS_13         EQU (0x5 <<  4) ;
- (SPI) 13 Bits Per transfer
AT91C_SPI_BITS_14         EQU (0x6 <<  4) ;
- (SPI) 14 Bits Per transfer
AT91C_SPI_BITS_15         EQU (0x7 <<  4) ;
- (SPI) 15 Bits Per transfer
AT91C_SPI_BITS_16         EQU (0x8 <<  4) ;
- (SPI) 16 Bits Per transfer
AT91C_SPI_SCBR            EQU (0xFF <<  8) ;
- (SPI) Serial Clock Baud Rate
AT91C_SPI_DLYBS           EQU (0xFF << 16) ;
- (SPI) Delay Before SPCK
AT91C_SPI_DLYBCT          EQU (0xFF << 24) ;
- (SPI) Delay Between Consecutive Transfers

// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR Usart
// - *****************************************************************************
// - -------- US_CR : (USART Offset: 0x0) Debug Unit Control Register --------
AT91C_US_STTBRK           EQU (0x1 <<  9) ;
- (USART) Start Break
AT91C_US_STPBRK           EQU (0x1 << 10) ;
- (USART) Stop Break
AT91C_US_STTTO            EQU (0x1 << 11) ;
- (USART) Start Time-out
AT91C_US_SENDA            EQU (0x1 << 12) ;
- (USART) Send Address
AT91C_US_RSTIT            EQU (0x1 << 13) ;
- (USART) Reset Iterations
AT91C_US_RSTNACK          EQU (0x1 << 14) ;
- (USART) Reset Non Acknowledge
AT91C_US_RETTO            EQU (0x1 << 15) ;
- (USART) Rearm Time-out
AT91C_US_DTREN            EQU (0x1 << 16) ;
- (USART) Data Terminal ready Enable
AT91C_US_DTRDIS           EQU (0x1 << 17) ;
- (USART) Data Terminal ready Disable
AT91C_US_RTSEN            EQU (0x1 << 18) ;
- (USART) Request to Send enable
AT91C_US_RTSDIS           EQU (0x1 << 19) ;
- (USART) Request to Send Disable
// - -------- US_MR : (USART Offset: 0x4) Debug Unit Mode Register --------
AT91C_US_USMODE           EQU (0xF <<  0) ;
- (USART) Usart mode
AT91C_US_USMODE_NORMAL    EQU (0x0) ;
- (USART) Normal
AT91C_US_USMODE_RS485     EQU (0x1) ;
- (USART) RS485
AT91C_US_USMODE_HWHSH     EQU (0x2) ;
- (USART) Hardware Handshaking
AT91C_US_USMODE_MODEM     EQU (0x3) ;
- (USART) Modem
AT91C_US_USMODE_ISO7816_0 EQU (0x4) ;
- (USART) ISO7816 protocol:
T = 0
    AT91C_US_USMODE_ISO7816_1 EQU (0x6) ;
- (USART) ISO7816 protocol:
T = 1
    AT91C_US_USMODE_IRDA      EQU (0x8) ;
- (USART) IrDA
AT91C_US_USMODE_SWHSH     EQU (0xC) ;
- (USART) Software Handshaking
AT91C_US_CLKS             EQU (0x3 <<  4) ;
- (USART) Clock Selection (Baud Rate generator Input Clock
                           AT91C_US_CLKS_CLOCK       EQU (0x0 <<  4) ; - (USART) Clock
                           AT91C_US_CLKS_FDIV1       EQU (0x1 <<  4) ; - (USART) fdiv1
                           AT91C_US_CLKS_SLOW        EQU (0x2 <<  4) ; - (USART) slow_clock (ARM)
                           AT91C_US_CLKS_EXT         EQU (0x3 <<  4) ; - (USART) External (SCK)
                           AT91C_US_CHRL             EQU (0x3 <<  6) ; - (USART) Clock Selection (Baud Rate generator Input Clock
                                   AT91C_US_CHRL_5_BITS      EQU (0x0 <<  6) ; - (USART) Character Length: 5 bits
                                   AT91C_US_CHRL_6_BITS      EQU (0x1 <<  6) ; - (USART) Character Length: 6 bits
                                   AT91C_US_CHRL_7_BITS      EQU (0x2 <<  6) ; - (USART) Character Length: 7 bits
                                   AT91C_US_CHRL_8_BITS      EQU (0x3 <<  6) ; - (USART) Character Length: 8 bits
                                   AT91C_US_SYNC             EQU (0x1 <<  8) ; - (USART) Synchronous Mode Select
                                   AT91C_US_NBSTOP           EQU (0x3 << 12) ; - (USART) Number of Stop bits
                                   AT91C_US_NBSTOP_1_BIT     EQU (0x0 << 12) ; - (USART) 1 stop bit
                                   AT91C_US_NBSTOP_15_BIT    EQU (0x1 << 12) ; - (USART) Asynchronous (SYNC=0) 2 stop bits Synchronous (SYNC=1) 2 stop bits
                                   AT91C_US_NBSTOP_2_BIT     EQU (0x2 << 12) ; - (USART) 2 stop bits
                                   AT91C_US_MSBF             EQU (0x1 << 16) ; - (USART) Bit Order
                                   AT91C_US_MODE9            EQU (0x1 << 17) ; - (USART) 9-bit Character length
                                   AT91C_US_CKLO             EQU (0x1 << 18) ; - (USART) Clock Output Select
                                   AT91C_US_OVER             EQU (0x1 << 19) ; - (USART) Over Sampling Mode
                                   AT91C_US_INACK            EQU (0x1 << 20) ; - (USART) Inhibit Non Acknowledge
                                   AT91C_US_DSNACK           EQU (0x1 << 21) ; - (USART) Disable Successive NACK
                                   AT91C_US_MAX_ITER         EQU (0x1 << 24) ; - (USART) Number of Repetitions
                                   AT91C_US_FILTER           EQU (0x1 << 28) ; - (USART) Receive Line Filter
// - -------- US_IER : (USART Offset: 0x8) Debug Unit Interrupt Enable Register --------
                                   AT91C_US_RXBRK            EQU (0x1 <<  2) ; - (USART) Break Received/End of Break
                                   AT91C_US_TIMEOUT          EQU (0x1 <<  8) ; - (USART) Receiver Time-out
                                   AT91C_US_ITERATION        EQU (0x1 << 10) ; - (USART) Max number of Repetitions Reached
                                   AT91C_US_NACK             EQU (0x1 << 13) ; - (USART) Non Acknowledge
                                   AT91C_US_RIIC             EQU (0x1 << 16) ; - (USART) Ring INdicator Input Change Flag
                                   AT91C_US_DSRIC            EQU (0x1 << 17) ; - (USART) Data Set Ready Input Change Flag
                                   AT91C_US_DCDIC            EQU (0x1 << 18) ; - (USART) Data Carrier Flag
                                   AT91C_US_CTSIC            EQU (0x1 << 19) ; - (USART) Clear To Send Input Change Flag
// - -------- US_IDR : (USART Offset: 0xc) Debug Unit Interrupt Disable Register --------
// - -------- US_IMR : (USART Offset: 0x10) Debug Unit Interrupt Mask Register --------
// - -------- US_CSR : (USART Offset: 0x14) Debug Unit Channel Status Register --------
                                   AT91C_US_RI               EQU (0x1 << 20) ; - (USART) Image of RI Input
                                   AT91C_US_DSR              EQU (0x1 << 21) ; - (USART) Image of DSR Input
                                   AT91C_US_DCD              EQU (0x1 << 22) ; - (USART) Image of DCD Input
                                   AT91C_US_CTS              EQU (0x1 << 23) ; - (USART) Image of CTS Input

// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR Synchronous Serial Controller Interface
// - *****************************************************************************
// - -------- SSC_CR : (SSC Offset: 0x0) SSC Control Register --------
                                   AT91C_SSC_RXEN            EQU (0x1 <<  0) ; - (SSC) Receive Enable
                                   AT91C_SSC_RXDIS           EQU (0x1 <<  1) ; - (SSC) Receive Disable
                                   AT91C_SSC_TXEN            EQU (0x1 <<  8) ; - (SSC) Transmit Enable
                                   AT91C_SSC_TXDIS           EQU (0x1 <<  9) ; - (SSC) Transmit Disable
                                   AT91C_SSC_SWRST           EQU (0x1 << 15) ; - (SSC) Software Reset
// - -------- SSC_RCMR : (SSC Offset: 0x10) SSC Receive Clock Mode Register --------
                                   AT91C_SSC_CKS             EQU (0x3 <<  0) ; - (SSC) Receive/Transmit Clock Selection
                                   AT91C_SSC_CKS_DIV         EQU (0x0) ; - (SSC) Divided Clock
                                   AT91C_SSC_CKS_TK          EQU (0x1) ; - (SSC) TK Clock signal
                                   AT91C_SSC_CKS_RK          EQU (0x2) ; - (SSC) RK pin
                                   AT91C_SSC_CKO             EQU (0x7 <<  2) ; - (SSC) Receive/Transmit Clock Output Mode Selection
                                   AT91C_SSC_CKO_NONE        EQU (0x0 <<  2) ; - (SSC) Receive/Transmit Clock Output Mode: None RK pin: Input-only
                                   AT91C_SSC_CKO_CONTINOUS   EQU (0x1 <<  2) ; - (SSC) Continuous Receive/Transmit Clock RK pin: Output
                                   AT91C_SSC_CKO_DATA_TX     EQU (0x2 <<  2) ; - (SSC) Receive/Transmit Clock only during data transfers RK pin: Output
                                   AT91C_SSC_CKI             EQU (0x1 <<  5) ; - (SSC) Receive/Transmit Clock Inversion
                                   AT91C_SSC_START           EQU (0xF <<  8) ; - (SSC) Receive/Transmit Start Selection
                                   AT91C_SSC_START_CONTINOUS EQU (0x0 <<  8) ; - (SSC) Continuous, as soon as the receiver is enabled, and immediately after the end of transfer of the previous data.
                                   AT91C_SSC_START_TX        EQU (0x1 <<  8) ; - (SSC) Transmit/Receive start
                                   AT91C_SSC_START_LOW_RF    EQU (0x2 <<  8) ; - (SSC) Detection of a low level on RF input
                                   AT91C_SSC_START_HIGH_RF   EQU (0x3 <<  8) ; - (SSC) Detection of a high level on RF input
                                   AT91C_SSC_START_FALL_RF   EQU (0x4 <<  8) ; - (SSC) Detection of a falling edge on RF input
                                   AT91C_SSC_START_RISE_RF   EQU (0x5 <<  8) ; - (SSC) Detection of a rising edge on RF input
                                   AT91C_SSC_START_LEVEL_RF  EQU (0x6 <<  8) ; - (SSC) Detection of any level change on RF input
                                   AT91C_SSC_START_EDGE_RF   EQU (0x7 <<  8) ; - (SSC) Detection of any edge on RF input
                                   AT91C_SSC_START_0         EQU (0x8 <<  8) ; - (SSC) Compare 0
                                   AT91C_SSC_STTDLY          EQU (0xFF << 16) ; - (SSC) Receive/Transmit Start Delay
                                   AT91C_SSC_PERIOD          EQU (0xFF << 24) ; - (SSC) Receive/Transmit Period Divider Selection
// - -------- SSC_RFMR : (SSC Offset: 0x14) SSC Receive Frame Mode Register --------
                                   AT91C_SSC_DATLEN          EQU (0x1F <<  0) ; - (SSC) Data Length
                                   AT91C_SSC_LOOP            EQU (0x1 <<  5) ; - (SSC) Loop Mode
                                   AT91C_SSC_MSBF            EQU (0x1 <<  7) ; - (SSC) Most Significant Bit First
                                   AT91C_SSC_DATNB           EQU (0xF <<  8) ; - (SSC) Data Number per Frame
                                   AT91C_SSC_FSLEN           EQU (0xF << 16) ; - (SSC) Receive/Transmit Frame Sync length
                                   AT91C_SSC_FSOS            EQU (0x7 << 20) ; - (SSC) Receive/Transmit Frame Sync Output Selection
                                   AT91C_SSC_FSOS_NONE       EQU (0x0 << 20) ; - (SSC) Selected Receive/Transmit Frame Sync Signal: None RK pin Input-only
                                   AT91C_SSC_FSOS_NEGATIVE   EQU (0x1 << 20) ; - (SSC) Selected Receive/Transmit Frame Sync Signal: Negative Pulse
                                   AT91C_SSC_FSOS_POSITIVE   EQU (0x2 << 20) ; - (SSC) Selected Receive/Transmit Frame Sync Signal: Positive Pulse
                                   AT91C_SSC_FSOS_LOW        EQU (0x3 << 20) ; - (SSC) Selected Receive/Transmit Frame Sync Signal: Driver Low during data transfer
                                   AT91C_SSC_FSOS_HIGH       EQU (0x4 << 20) ; - (SSC) Selected Receive/Transmit Frame Sync Signal: Driver High during data transfer
                                   AT91C_SSC_FSOS_TOGGLE     EQU (0x5 << 20) ; - (SSC) Selected Receive/Transmit Frame Sync Signal: Toggling at each start of data transfer
                                   AT91C_SSC_FSEDGE          EQU (0x1 << 24) ; - (SSC) Frame Sync Edge Detection
// - -------- SSC_TCMR : (SSC Offset: 0x18) SSC Transmit Clock Mode Register --------
// - -------- SSC_TFMR : (SSC Offset: 0x1c) SSC Transmit Frame Mode Register --------
                                   AT91C_SSC_DATDEF          EQU (0x1 <<  5) ; - (SSC) Data Default Value
                                   AT91C_SSC_FSDEN           EQU (0x1 << 23) ; - (SSC) Frame Sync Data Enable
// - -------- SSC_SR : (SSC Offset: 0x40) SSC Status Register --------
                                   AT91C_SSC_TXRDY           EQU (0x1 <<  0) ; - (SSC) Transmit Ready
                                   AT91C_SSC_TXEMPTY         EQU (0x1 <<  1) ; - (SSC) Transmit Empty
                                   AT91C_SSC_ENDTX           EQU (0x1 <<  2) ; - (SSC) End Of Transmission
                                   AT91C_SSC_TXBUFE          EQU (0x1 <<  3) ; - (SSC) Transmit Buffer Empty
                                   AT91C_SSC_RXRDY           EQU (0x1 <<  4) ; - (SSC) Receive Ready
                                   AT91C_SSC_OVRUN           EQU (0x1 <<  5) ; - (SSC) Receive Overrun
                                   AT91C_SSC_ENDRX           EQU (0x1 <<  6) ; - (SSC) End of Reception
                                   AT91C_SSC_RXBUFF          EQU (0x1 <<  7) ; - (SSC) Receive Buffer Full
                                   AT91C_SSC_TXSYN           EQU (0x1 << 10) ; - (SSC) Transmit Sync
                                   AT91C_SSC_RXSYN           EQU (0x1 << 11) ; - (SSC) Receive Sync
                                   AT91C_SSC_TXENA           EQU (0x1 << 16) ; - (SSC) Transmit Enable
                                   AT91C_SSC_RXENA           EQU (0x1 << 17) ; - (SSC) Receive Enable
// - -------- SSC_IER : (SSC Offset: 0x44) SSC Interrupt Enable Register --------
// - -------- SSC_IDR : (SSC Offset: 0x48) SSC Interrupt Disable Register --------
// - -------- SSC_IMR : (SSC Offset: 0x4c) SSC Interrupt Mask Register --------

