autosportlabs/RaceCapture-Pro_firmware/stm32_base/libs/FreeRTOSV7.6.0/FreeRTOS/Source/portable/GCC/ARM7_AT91SAM7S/ioat91sam7x256.h
// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR Two-wire Interface
// - *****************************************************************************
// - -------- TWI_CR : (TWI Offset: 0x0) TWI Control Register --------
                                   AT91C_TWI_START           EQU (0x1 <<  0) ; - (TWI) Send a START Condition
                                   AT91C_TWI_STOP            EQU (0x1 <<  1) ; - (TWI) Send a STOP Condition
                                   AT91C_TWI_MSEN            EQU (0x1 <<  2) ; - (TWI) TWI Master Transfer Enabled
                                   AT91C_TWI_MSDIS           EQU (0x1 <<  3) ; - (TWI) TWI Master Transfer Disabled
                                   AT91C_TWI_SWRST           EQU (0x1 <<  7) ; - (TWI) Software Reset
// - -------- TWI_MMR : (TWI Offset: 0x4) TWI Master Mode Register --------
                                   AT91C_TWI_IADRSZ          EQU (0x3 <<  8) ; - (TWI) Internal Device Address Size
                                   AT91C_TWI_IADRSZ_NO       EQU (0x0 <<  8) ; - (TWI) No internal device address
                                   AT91C_TWI_IADRSZ_1_BYTE   EQU (0x1 <<  8) ; - (TWI) One-byte internal device address
                                   AT91C_TWI_IADRSZ_2_BYTE   EQU (0x2 <<  8) ; - (TWI) Two-byte internal device address
                                   AT91C_TWI_IADRSZ_3_BYTE   EQU (0x3 <<  8) ; - (TWI) Three-byte internal device address
                                   AT91C_TWI_MREAD           EQU (0x1 << 12) ; - (TWI) Master Read Direction
                                   AT91C_TWI_DADR            EQU (0x7F << 16) ; - (TWI) Device Address
// - -------- TWI_CWGR : (TWI Offset: 0x10) TWI Clock Waveform Generator Register --------
                                   AT91C_TWI_CLDIV           EQU (0xFF <<  0) ; - (TWI) Clock Low Divider
                                   AT91C_TWI_CHDIV           EQU (0xFF <<  8) ; - (TWI) Clock High Divider
                                   AT91C_TWI_CKDIV           EQU (0x7 << 16) ; - (TWI) Clock Divider
// - -------- TWI_SR : (TWI Offset: 0x20) TWI Status Register --------
                                   AT91C_TWI_TXCOMP          EQU (0x1 <<  0) ; - (TWI) Transmission Completed
                                   AT91C_TWI_RXRDY           EQU (0x1 <<  1) ; - (TWI) Receive holding register ReaDY
                                   AT91C_TWI_TXRDY           EQU (0x1 <<  2) ; - (TWI) Transmit holding register ReaDY
                                   AT91C_TWI_OVRE            EQU (0x1 <<  6) ; - (TWI) Overrun Error
                                   AT91C_TWI_UNRE            EQU (0x1 <<  7) ; - (TWI) Underrun Error
                                   AT91C_TWI_NACK            EQU (0x1 <<  8) ; - (TWI) Not Acknowledged
// - -------- TWI_IER : (TWI Offset: 0x24) TWI Interrupt Enable Register --------
// - -------- TWI_IDR : (TWI Offset: 0x28) TWI Interrupt Disable Register --------
// - -------- TWI_IMR : (TWI Offset: 0x2c) TWI Interrupt Mask Register --------

// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR PWMC Channel Interface
// - *****************************************************************************
// - -------- PWMC_CMR : (PWMC_CH Offset: 0x0) PWMC Channel Mode Register --------
                                   AT91C_PWMC_CPRE           EQU (0xF <<  0) ; - (PWMC_CH) Channel Pre-scaler : PWMC_CLKx
                                   AT91C_PWMC_CPRE_MCK       EQU (0x0) ; - (PWMC_CH)
                                   AT91C_PWMC_CPRE_MCKA      EQU (0xB) ; - (PWMC_CH)
                                   AT91C_PWMC_CPRE_MCKB      EQU (0xC) ; - (PWMC_CH)
                                   AT91C_PWMC_CALG           EQU (0x1 <<  8) ; - (PWMC_CH) Channel Alignment
                                   AT91C_PWMC_CPOL           EQU (0x1 <<  9) ; - (PWMC_CH) Channel Polarity
                                   AT91C_PWMC_CPD            EQU (0x1 << 10) ; - (PWMC_CH) Channel Update Period
// - -------- PWMC_CDTYR : (PWMC_CH Offset: 0x4) PWMC Channel Duty Cycle Register --------
                                   AT91C_PWMC_CDTY           EQU (0x0 <<  0) ; - (PWMC_CH) Channel Duty Cycle
// - -------- PWMC_CPRDR : (PWMC_CH Offset: 0x8) PWMC Channel Period Register --------
                                   AT91C_PWMC_CPRD           EQU (0x0 <<  0) ; - (PWMC_CH) Channel Period
// - -------- PWMC_CCNTR : (PWMC_CH Offset: 0xc) PWMC Channel Counter Register --------
                                   AT91C_PWMC_CCNT           EQU (0x0 <<  0) ; - (PWMC_CH) Channel Counter
// - -------- PWMC_CUPDR : (PWMC_CH Offset: 0x10) PWMC Channel Update Register --------
                                   AT91C_PWMC_CUPD           EQU (0x0 <<  0) ; - (PWMC_CH) Channel Update

// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR Pulse Width Modulation Controller Interface
// - *****************************************************************************
// - -------- PWMC_MR : (PWMC Offset: 0x0) PWMC Mode Register --------
                                   AT91C_PWMC_DIVA           EQU (0xFF <<  0) ; - (PWMC) CLKA divide factor.
                                   AT91C_PWMC_PREA           EQU (0xF <<  8) ; - (PWMC) Divider Input Clock Prescaler A
                                   AT91C_PWMC_PREA_MCK       EQU (0x0 <<  8) ; - (PWMC)
                                   AT91C_PWMC_DIVB           EQU (0xFF << 16) ; - (PWMC) CLKB divide factor.
                                   AT91C_PWMC_PREB           EQU (0xF << 24) ; - (PWMC) Divider Input Clock Prescaler B
                                   AT91C_PWMC_PREB_MCK       EQU (0x0 << 24) ; - (PWMC)
// - -------- PWMC_ENA : (PWMC Offset: 0x4) PWMC Enable Register --------
                                   AT91C_PWMC_CHID0          EQU (0x1 <<  0) ; - (PWMC) Channel ID 0
                                   AT91C_PWMC_CHID1          EQU (0x1 <<  1) ; - (PWMC) Channel ID 1
                                   AT91C_PWMC_CHID2          EQU (0x1 <<  2) ; - (PWMC) Channel ID 2
                                   AT91C_PWMC_CHID3          EQU (0x1 <<  3) ; - (PWMC) Channel ID 3
// - -------- PWMC_DIS : (PWMC Offset: 0x8) PWMC Disable Register --------
// - -------- PWMC_SR : (PWMC Offset: 0xc) PWMC Status Register --------
// - -------- PWMC_IER : (PWMC Offset: 0x10) PWMC Interrupt Enable Register --------
// - -------- PWMC_IDR : (PWMC Offset: 0x14) PWMC Interrupt Disable Register --------
// - -------- PWMC_IMR : (PWMC Offset: 0x18) PWMC Interrupt Mask Register --------
// - -------- PWMC_ISR : (PWMC Offset: 0x1c) PWMC Interrupt Status Register --------

// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR USB Device Interface
// - *****************************************************************************
// - -------- UDP_FRM_NUM : (UDP Offset: 0x0) USB Frame Number Register --------
                                   AT91C_UDP_FRM_NUM         EQU (0x7FF <<  0) ; - (UDP) Frame Number as Defined in the Packet Field Formats
                                   AT91C_UDP_FRM_ERR         EQU (0x1 << 16) ; - (UDP) Frame Error
                                   AT91C_UDP_FRM_OK          EQU (0x1 << 17) ; - (UDP) Frame OK
// - -------- UDP_GLB_STATE : (UDP Offset: 0x4) USB Global State Register --------
                                   AT91C_UDP_FADDEN          EQU (0x1 <<  0) ; - (UDP) Function Address Enable
                                   AT91C_UDP_CONFG           EQU (0x1 <<  1) ; - (UDP) Configured
                                   AT91C_UDP_ESR             EQU (0x1 <<  2) ; - (UDP) Enable Send Resume
                                   AT91C_UDP_RSMINPR         EQU (0x1 <<  3) ; - (UDP) A Resume Has Been Sent to the Host
                                   AT91C_UDP_RMWUPE          EQU (0x1 <<  4) ; - (UDP) Remote Wake Up Enable
// - -------- UDP_FADDR : (UDP Offset: 0x8) USB Function Address Register --------
                                   AT91C_UDP_FADD            EQU (0xFF <<  0) ; - (UDP) Function Address Value
                                   AT91C_UDP_FEN             EQU (0x1 <<  8) ; - (UDP) Function Enable
// - -------- UDP_IER : (UDP Offset: 0x10) USB Interrupt Enable Register --------
                                   AT91C_UDP_EPINT0          EQU (0x1 <<  0) ; - (UDP) Endpoint 0 Interrupt
                                   AT91C_UDP_EPINT1          EQU (0x1 <<  1) ; - (UDP) Endpoint 0 Interrupt
                                   AT91C_UDP_EPINT2          EQU (0x1 <<  2) ; - (UDP) Endpoint 2 Interrupt
                                   AT91C_UDP_EPINT3          EQU (0x1 <<  3) ; - (UDP) Endpoint 3 Interrupt
                                   AT91C_UDP_EPINT4          EQU (0x1 <<  4) ; - (UDP) Endpoint 4 Interrupt
                                   AT91C_UDP_EPINT5          EQU (0x1 <<  5) ; - (UDP) Endpoint 5 Interrupt
                                   AT91C_UDP_RXSUSP          EQU (0x1 <<  8) ; - (UDP) USB Suspend Interrupt
                                   AT91C_UDP_RXRSM           EQU (0x1 <<  9) ; - (UDP) USB Resume Interrupt
                                   AT91C_UDP_EXTRSM          EQU (0x1 << 10) ; - (UDP) USB External Resume Interrupt
                                   AT91C_UDP_SOFINT          EQU (0x1 << 11) ; - (UDP) USB Start Of frame Interrupt
                                   AT91C_UDP_WAKEUP          EQU (0x1 << 13) ; - (UDP) USB Resume Interrupt
// - -------- UDP_IDR : (UDP Offset: 0x14) USB Interrupt Disable Register --------
// - -------- UDP_IMR : (UDP Offset: 0x18) USB Interrupt Mask Register --------
// - -------- UDP_ISR : (UDP Offset: 0x1c) USB Interrupt Status Register --------
                                   AT91C_UDP_ENDBUSRES       EQU (0x1 << 12) ; - (UDP) USB End Of Bus Reset Interrupt
// - -------- UDP_ICR : (UDP Offset: 0x20) USB Interrupt Clear Register --------
// - -------- UDP_RST_EP : (UDP Offset: 0x28) USB Reset Endpoint Register --------
                                   AT91C_UDP_EP0             EQU (0x1 <<  0) ; - (UDP) Reset Endpoint 0
                                   AT91C_UDP_EP1             EQU (0x1 <<  1) ; - (UDP) Reset Endpoint 1
                                   AT91C_UDP_EP2             EQU (0x1 <<  2) ; - (UDP) Reset Endpoint 2
                                   AT91C_UDP_EP3             EQU (0x1 <<  3) ; - (UDP) Reset Endpoint 3
                                   AT91C_UDP_EP4             EQU (0x1 <<  4) ; - (UDP) Reset Endpoint 4
                                   AT91C_UDP_EP5             EQU (0x1 <<  5) ; - (UDP) Reset Endpoint 5
// - -------- UDP_CSR : (UDP Offset: 0x30) USB Endpoint Control and Status Register --------
                                   AT91C_UDP_TXCOMP          EQU (0x1 <<  0) ; - (UDP) Generates an IN packet with data previously written in the DPR
                                   AT91C_UDP_RX_DATA_BK0     EQU (0x1 <<  1) ; - (UDP) Receive Data Bank 0
                                   AT91C_UDP_RXSETUP         EQU (0x1 <<  2) ; - (UDP) Sends STALL to the Host (Control endpoints)
                                   AT91C_UDP_ISOERROR        EQU (0x1 <<  3) ; - (UDP) Isochronous error (Isochronous endpoints)
                                   AT91C_UDP_TXPKTRDY        EQU (0x1 <<  4) ; - (UDP) Transmit Packet Ready
                                   AT91C_UDP_FORCESTALL      EQU (0x1 <<  5) ; - (UDP) Force Stall (used by Control, Bulk and Isochronous endpoints).
                                   AT91C_UDP_RX_DATA_BK1     EQU (0x1 <<  6) ; - (UDP) Receive Data Bank 1 (only used by endpoints with ping-pong attributes).
                                   AT91C_UDP_DIR             EQU (0x1 <<  7) ; - (UDP) Transfer Direction
                                   AT91C_UDP_EPTYPE          EQU (0x7 <<  8) ; - (UDP) Endpoint type
                                   AT91C_UDP_EPTYPE_CTRL     EQU (0x0 <<  8) ; - (UDP) Control
                                   AT91C_UDP_EPTYPE_ISO_OUT  EQU (0x1 <<  8) ; - (UDP) Isochronous OUT
                                   AT91C_UDP_EPTYPE_BULK_OUT EQU (0x2 <<  8) ; - (UDP) Bulk OUT
                                   AT91C_UDP_EPTYPE_INT_OUT  EQU (0x3 <<  8) ; - (UDP) Interrupt OUT
                                   AT91C_UDP_EPTYPE_ISO_IN   EQU (0x5 <<  8) ; - (UDP) Isochronous IN
                                   AT91C_UDP_EPTYPE_BULK_IN  EQU (0x6 <<  8) ; - (UDP) Bulk IN
                                   AT91C_UDP_EPTYPE_INT_IN   EQU (0x7 <<  8) ; - (UDP) Interrupt IN
                                   AT91C_UDP_DTGLE           EQU (0x1 << 11) ; - (UDP) Data Toggle
                                   AT91C_UDP_EPEDS           EQU (0x1 << 15) ; - (UDP) Endpoint Enable Disable
                                   AT91C_UDP_RXBYTECNT       EQU (0x7FF << 16) ; - (UDP) Number Of Bytes Available in the FIFO
// - -------- UDP_TXVC : (UDP Offset: 0x74) Transceiver Control Register --------
                                   AT91C_UDP_TXVDIS          EQU (0x1 <<  8) ; - (UDP)
                                   AT91C_UDP_PUON            EQU (0x1 <<  9) ; - (UDP) Pull-up ON

