autosportlabs/RaceCapture-Pro_firmware/stm32_base/libs/FreeRTOSV7.6.0/FreeRTOS/Source/portable/GCC/ARM7_AT91SAM7S/ioat91sam7x256.h
// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR Timer Counter Channel Interface
// - *****************************************************************************
// - -------- TC_CCR : (TC Offset: 0x0) TC Channel Control Register --------
                                   AT91C_TC_CLKEN            EQU (0x1 <<  0) ; - (TC) Counter Clock Enable Command
                                   AT91C_TC_CLKDIS           EQU (0x1 <<  1) ; - (TC) Counter Clock Disable Command
                                   AT91C_TC_SWTRG            EQU (0x1 <<  2) ; - (TC) Software Trigger Command
// - -------- TC_CMR : (TC Offset: 0x4) TC Channel Mode Register: Capture Mode / Waveform Mode --------
                                   AT91C_TC_CLKS             EQU (0x7 <<  0) ; - (TC) Clock Selection
                                   AT91C_TC_CLKS_TIMER_DIV1_CLOCK EQU (0x0) ; - (TC) Clock selected: TIMER_DIV1_CLOCK
                                   AT91C_TC_CLKS_TIMER_DIV2_CLOCK EQU (0x1) ; - (TC) Clock selected: TIMER_DIV2_CLOCK
                                   AT91C_TC_CLKS_TIMER_DIV3_CLOCK EQU (0x2) ; - (TC) Clock selected: TIMER_DIV3_CLOCK
                                   AT91C_TC_CLKS_TIMER_DIV4_CLOCK EQU (0x3) ; - (TC) Clock selected: TIMER_DIV4_CLOCK
                                   AT91C_TC_CLKS_TIMER_DIV5_CLOCK EQU (0x4) ; - (TC) Clock selected: TIMER_DIV5_CLOCK
                                   AT91C_TC_CLKS_XC0         EQU (0x5) ; - (TC) Clock selected: XC0
                                   AT91C_TC_CLKS_XC1         EQU (0x6) ; - (TC) Clock selected: XC1
                                   AT91C_TC_CLKS_XC2         EQU (0x7) ; - (TC) Clock selected: XC2
                                   AT91C_TC_CLKI             EQU (0x1 <<  3) ; - (TC) Clock Invert
                                   AT91C_TC_BURST            EQU (0x3 <<  4) ; - (TC) Burst Signal Selection
                                   AT91C_TC_BURST_NONE       EQU (0x0 <<  4) ; - (TC) The clock is not gated by an external signal
                                   AT91C_TC_BURST_XC0        EQU (0x1 <<  4) ; - (TC) XC0 is ANDed with the selected clock
                                   AT91C_TC_BURST_XC1        EQU (0x2 <<  4) ; - (TC) XC1 is ANDed with the selected clock
                                   AT91C_TC_BURST_XC2        EQU (0x3 <<  4) ; - (TC) XC2 is ANDed with the selected clock
                                   AT91C_TC_CPCSTOP          EQU (0x1 <<  6) ; - (TC) Counter Clock Stopped with RC Compare
                                   AT91C_TC_LDBSTOP          EQU (0x1 <<  6) ; - (TC) Counter Clock Stopped with RB Loading
                                   AT91C_TC_CPCDIS           EQU (0x1 <<  7) ; - (TC) Counter Clock Disable with RC Compare
                                   AT91C_TC_LDBDIS           EQU (0x1 <<  7) ; - (TC) Counter Clock Disabled with RB Loading
                                   AT91C_TC_ETRGEDG          EQU (0x3 <<  8) ; - (TC) External Trigger Edge Selection
                                   AT91C_TC_ETRGEDG_NONE     EQU (0x0 <<  8) ; - (TC) Edge: None
                                   AT91C_TC_ETRGEDG_RISING   EQU (0x1 <<  8) ; - (TC) Edge: rising edge
                                   AT91C_TC_ETRGEDG_FALLING  EQU (0x2 <<  8) ; - (TC) Edge: falling edge
                                   AT91C_TC_ETRGEDG_BOTH     EQU (0x3 <<  8) ; - (TC) Edge: each edge
                                   AT91C_TC_EEVTEDG          EQU (0x3 <<  8) ; - (TC) External Event Edge Selection
                                   AT91C_TC_EEVTEDG_NONE     EQU (0x0 <<  8) ; - (TC) Edge: None
                                   AT91C_TC_EEVTEDG_RISING   EQU (0x1 <<  8) ; - (TC) Edge: rising edge
                                   AT91C_TC_EEVTEDG_FALLING  EQU (0x2 <<  8) ; - (TC) Edge: falling edge
                                   AT91C_TC_EEVTEDG_BOTH     EQU (0x3 <<  8) ; - (TC) Edge: each edge
                                   AT91C_TC_EEVT             EQU (0x3 << 10) ; - (TC) External Event  Selection
                                   AT91C_TC_EEVT_TIOB        EQU (0x0 << 10) ; - (TC) Signal selected as external event: TIOB TIOB direction: input
                                   AT91C_TC_EEVT_XC0         EQU (0x1 << 10) ; - (TC) Signal selected as external event: XC0 TIOB direction: output
                                   AT91C_TC_EEVT_XC1         EQU (0x2 << 10) ; - (TC) Signal selected as external event: XC1 TIOB direction: output
                                   AT91C_TC_EEVT_XC2         EQU (0x3 << 10) ; - (TC) Signal selected as external event: XC2 TIOB direction: output
                                   AT91C_TC_ABETRG           EQU (0x1 << 10) ; - (TC) TIOA or TIOB External Trigger Selection
                                   AT91C_TC_ENETRG           EQU (0x1 << 12) ; - (TC) External Event Trigger enable
                                   AT91C_TC_WAVESEL          EQU (0x3 << 13) ; - (TC) Waveform  Selection
                                   AT91C_TC_WAVESEL_UP       EQU (0x0 << 13) ; - (TC) UP mode without atomatic trigger on RC Compare
                                   AT91C_TC_WAVESEL_UPDOWN   EQU (0x1 << 13) ; - (TC) UPDOWN mode without automatic trigger on RC Compare
                                   AT91C_TC_WAVESEL_UP_AUTO  EQU (0x2 << 13) ; - (TC) UP mode with automatic trigger on RC Compare
                                   AT91C_TC_WAVESEL_UPDOWN_AUTO EQU (0x3 << 13) ; - (TC) UPDOWN mode with automatic trigger on RC Compare
                                   AT91C_TC_CPCTRG           EQU (0x1 << 14) ; - (TC) RC Compare Trigger Enable
                                   AT91C_TC_WAVE             EQU (0x1 << 15) ; - (TC)
                                   AT91C_TC_ACPA             EQU (0x3 << 16) ; - (TC) RA Compare Effect on TIOA
                                   AT91C_TC_ACPA_NONE        EQU (0x0 << 16) ; - (TC) Effect: none
                                   AT91C_TC_ACPA_SET         EQU (0x1 << 16) ; - (TC) Effect: set
                                   AT91C_TC_ACPA_CLEAR       EQU (0x2 << 16) ; - (TC) Effect: clear
                                   AT91C_TC_ACPA_TOGGLE      EQU (0x3 << 16) ; - (TC) Effect: toggle
                                   AT91C_TC_LDRA             EQU (0x3 << 16) ; - (TC) RA Loading Selection
                                   AT91C_TC_LDRA_NONE        EQU (0x0 << 16) ; - (TC) Edge: None
                                   AT91C_TC_LDRA_RISING      EQU (0x1 << 16) ; - (TC) Edge: rising edge of TIOA
                                   AT91C_TC_LDRA_FALLING     EQU (0x2 << 16) ; - (TC) Edge: falling edge of TIOA
                                   AT91C_TC_LDRA_BOTH        EQU (0x3 << 16) ; - (TC) Edge: each edge of TIOA
                                   AT91C_TC_ACPC             EQU (0x3 << 18) ; - (TC) RC Compare Effect on TIOA
                                   AT91C_TC_ACPC_NONE        EQU (0x0 << 18) ; - (TC) Effect: none
                                   AT91C_TC_ACPC_SET         EQU (0x1 << 18) ; - (TC) Effect: set
                                   AT91C_TC_ACPC_CLEAR       EQU (0x2 << 18) ; - (TC) Effect: clear
                                   AT91C_TC_ACPC_TOGGLE      EQU (0x3 << 18) ; - (TC) Effect: toggle
                                   AT91C_TC_LDRB             EQU (0x3 << 18) ; - (TC) RB Loading Selection
                                   AT91C_TC_LDRB_NONE        EQU (0x0 << 18) ; - (TC) Edge: None
                                   AT91C_TC_LDRB_RISING      EQU (0x1 << 18) ; - (TC) Edge: rising edge of TIOA
                                   AT91C_TC_LDRB_FALLING     EQU (0x2 << 18) ; - (TC) Edge: falling edge of TIOA
                                   AT91C_TC_LDRB_BOTH        EQU (0x3 << 18) ; - (TC) Edge: each edge of TIOA
                                   AT91C_TC_AEEVT            EQU (0x3 << 20) ; - (TC) External Event Effect on TIOA
                                   AT91C_TC_AEEVT_NONE       EQU (0x0 << 20) ; - (TC) Effect: none
                                   AT91C_TC_AEEVT_SET        EQU (0x1 << 20) ; - (TC) Effect: set
                                   AT91C_TC_AEEVT_CLEAR      EQU (0x2 << 20) ; - (TC) Effect: clear
                                   AT91C_TC_AEEVT_TOGGLE     EQU (0x3 << 20) ; - (TC) Effect: toggle
                                   AT91C_TC_ASWTRG           EQU (0x3 << 22) ; - (TC) Software Trigger Effect on TIOA
                                   AT91C_TC_ASWTRG_NONE      EQU (0x0 << 22) ; - (TC) Effect: none
                                   AT91C_TC_ASWTRG_SET       EQU (0x1 << 22) ; - (TC) Effect: set
                                   AT91C_TC_ASWTRG_CLEAR     EQU (0x2 << 22) ; - (TC) Effect: clear
                                   AT91C_TC_ASWTRG_TOGGLE    EQU (0x3 << 22) ; - (TC) Effect: toggle
                                   AT91C_TC_BCPB             EQU (0x3 << 24) ; - (TC) RB Compare Effect on TIOB
                                   AT91C_TC_BCPB_NONE        EQU (0x0 << 24) ; - (TC) Effect: none
                                   AT91C_TC_BCPB_SET         EQU (0x1 << 24) ; - (TC) Effect: set
                                   AT91C_TC_BCPB_CLEAR       EQU (0x2 << 24) ; - (TC) Effect: clear
                                   AT91C_TC_BCPB_TOGGLE      EQU (0x3 << 24) ; - (TC) Effect: toggle
                                   AT91C_TC_BCPC             EQU (0x3 << 26) ; - (TC) RC Compare Effect on TIOB
                                   AT91C_TC_BCPC_NONE        EQU (0x0 << 26) ; - (TC) Effect: none
                                   AT91C_TC_BCPC_SET         EQU (0x1 << 26) ; - (TC) Effect: set
                                   AT91C_TC_BCPC_CLEAR       EQU (0x2 << 26) ; - (TC) Effect: clear
                                   AT91C_TC_BCPC_TOGGLE      EQU (0x3 << 26) ; - (TC) Effect: toggle
                                   AT91C_TC_BEEVT            EQU (0x3 << 28) ; - (TC) External Event Effect on TIOB
                                   AT91C_TC_BEEVT_NONE       EQU (0x0 << 28) ; - (TC) Effect: none
                                   AT91C_TC_BEEVT_SET        EQU (0x1 << 28) ; - (TC) Effect: set
                                   AT91C_TC_BEEVT_CLEAR      EQU (0x2 << 28) ; - (TC) Effect: clear
                                   AT91C_TC_BEEVT_TOGGLE     EQU (0x3 << 28) ; - (TC) Effect: toggle
                                   AT91C_TC_BSWTRG           EQU (0x3 << 30) ; - (TC) Software Trigger Effect on TIOB
                                   AT91C_TC_BSWTRG_NONE      EQU (0x0 << 30) ; - (TC) Effect: none
                                   AT91C_TC_BSWTRG_SET       EQU (0x1 << 30) ; - (TC) Effect: set
                                   AT91C_TC_BSWTRG_CLEAR     EQU (0x2 << 30) ; - (TC) Effect: clear
                                   AT91C_TC_BSWTRG_TOGGLE    EQU (0x3 << 30) ; - (TC) Effect: toggle
// - -------- TC_SR : (TC Offset: 0x20) TC Channel Status Register --------
                                   AT91C_TC_COVFS            EQU (0x1 <<  0) ; - (TC) Counter Overflow
                                   AT91C_TC_LOVRS            EQU (0x1 <<  1) ; - (TC) Load Overrun
                                   AT91C_TC_CPAS             EQU (0x1 <<  2) ; - (TC) RA Compare
                                   AT91C_TC_CPBS             EQU (0x1 <<  3) ; - (TC) RB Compare
                                   AT91C_TC_CPCS             EQU (0x1 <<  4) ; - (TC) RC Compare
                                   AT91C_TC_LDRAS            EQU (0x1 <<  5) ; - (TC) RA Loading
                                   AT91C_TC_LDRBS            EQU (0x1 <<  6) ; - (TC) RB Loading
                                   AT91C_TC_ETRGS            EQU (0x1 <<  7) ; - (TC) External Trigger
                                   AT91C_TC_CLKSTA           EQU (0x1 << 16) ; - (TC) Clock Enabling
                                   AT91C_TC_MTIOA            EQU (0x1 << 17) ; - (TC) TIOA Mirror
                                   AT91C_TC_MTIOB            EQU (0x1 << 18) ; - (TC) TIOA Mirror
// - -------- TC_IER : (TC Offset: 0x24) TC Channel Interrupt Enable Register --------
// - -------- TC_IDR : (TC Offset: 0x28) TC Channel Interrupt Disable Register --------
// - -------- TC_IMR : (TC Offset: 0x2c) TC Channel Interrupt Mask Register --------

// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR Timer Counter Interface
// - *****************************************************************************
// - -------- TCB_BCR : (TCB Offset: 0xc0) TC Block Control Register --------
                                   AT91C_TCB_SYNC            EQU (0x1 <<  0) ; - (TCB) Synchro Command
// - -------- TCB_BMR : (TCB Offset: 0xc4) TC Block Mode Register --------
                                   AT91C_TCB_TC0XC0S         EQU (0x3 <<  0) ; - (TCB) External Clock Signal 0 Selection
                                   AT91C_TCB_TC0XC0S_TCLK0   EQU (0x0) ; - (TCB) TCLK0 connected to XC0
                                   AT91C_TCB_TC0XC0S_NONE    EQU (0x1) ; - (TCB) None signal connected to XC0
                                   AT91C_TCB_TC0XC0S_TIOA1   EQU (0x2) ; - (TCB) TIOA1 connected to XC0
                                   AT91C_TCB_TC0XC0S_TIOA2   EQU (0x3) ; - (TCB) TIOA2 connected to XC0
                                   AT91C_TCB_TC1XC1S         EQU (0x3 <<  2) ; - (TCB) External Clock Signal 1 Selection
                                   AT91C_TCB_TC1XC1S_TCLK1   EQU (0x0 <<  2) ; - (TCB) TCLK1 connected to XC1
                                   AT91C_TCB_TC1XC1S_NONE    EQU (0x1 <<  2) ; - (TCB) None signal connected to XC1
                                   AT91C_TCB_TC1XC1S_TIOA0   EQU (0x2 <<  2) ; - (TCB) TIOA0 connected to XC1
                                   AT91C_TCB_TC1XC1S_TIOA2   EQU (0x3 <<  2) ; - (TCB) TIOA2 connected to XC1
                                   AT91C_TCB_TC2XC2S         EQU (0x3 <<  4) ; - (TCB) External Clock Signal 2 Selection
                                   AT91C_TCB_TC2XC2S_TCLK2   EQU (0x0 <<  4) ; - (TCB) TCLK2 connected to XC2
                                   AT91C_TCB_TC2XC2S_NONE    EQU (0x1 <<  4) ; - (TCB) None signal connected to XC2
                                   AT91C_TCB_TC2XC2S_TIOA0   EQU (0x2 <<  4) ; - (TCB) TIOA0 connected to XC2
                                   AT91C_TCB_TC2XC2S_TIOA1   EQU (0x3 <<  4) ; - (TCB) TIOA2 connected to XC2

// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR Control Area Network MailBox Interface
// - *****************************************************************************
// - -------- CAN_MMR : (CAN_MB Offset: 0x0) CAN Message Mode Register --------
                                   AT91C_CAN_MTIMEMARK       EQU (0xFFFF <<  0) ; - (CAN_MB) Mailbox Timemark
                                   AT91C_CAN_PRIOR           EQU (0xF << 16) ; - (CAN_MB) Mailbox Priority
                                   AT91C_CAN_MOT             EQU (0x7 << 24) ; - (CAN_MB) Mailbox Object Type
                                   AT91C_CAN_MOT_DIS         EQU (0x0 << 24) ; - (CAN_MB)
                                   AT91C_CAN_MOT_RX          EQU (0x1 << 24) ; - (CAN_MB)
                                   AT91C_CAN_MOT_RXOVERWRITE EQU (0x2 << 24) ; - (CAN_MB)
                                   AT91C_CAN_MOT_TX          EQU (0x3 << 24) ; - (CAN_MB)
                                   AT91C_CAN_MOT_CONSUMER    EQU (0x4 << 24) ; - (CAN_MB)
                                   AT91C_CAN_MOT_PRODUCER    EQU (0x5 << 24) ; - (CAN_MB)
// - -------- CAN_MAM : (CAN_MB Offset: 0x4) CAN Message Acceptance Mask Register --------
                                   AT91C_CAN_MIDvB           EQU (0x3FFFF <<  0) ; - (CAN_MB) Complementary bits for identifier in extended mode
                                   AT91C_CAN_MIDvA           EQU (0x7FF << 18) ; - (CAN_MB) Identifier for standard frame mode
                                       AT91C_CAN_MIDE            EQU (0x1 << 29) ; - (CAN_MB) Identifier Version
// - -------- CAN_MID : (CAN_MB Offset: 0x8) CAN Message ID Register --------
// - -------- CAN_MFID : (CAN_MB Offset: 0xc) CAN Message Family ID Register --------
// - -------- CAN_MSR : (CAN_MB Offset: 0x10) CAN Message Status Register --------
                                       AT91C_CAN_MTIMESTAMP      EQU (0xFFFF <<  0) ; - (CAN_MB) Timer Value
                                       AT91C_CAN_MDLC            EQU (0xF << 16) ; - (CAN_MB) Mailbox Data Length Code
                                       AT91C_CAN_MRTR            EQU (0x1 << 20) ; - (CAN_MB) Mailbox Remote Transmission Request
                                       AT91C_CAN_MABT            EQU (0x1 << 22) ; - (CAN_MB) Mailbox Message Abort
                                       AT91C_CAN_MRDY            EQU (0x1 << 23) ; - (CAN_MB) Mailbox Ready
                                       AT91C_CAN_MMI             EQU (0x1 << 24) ; - (CAN_MB) Mailbox Message Ignored
// - -------- CAN_MDL : (CAN_MB Offset: 0x14) CAN Message Data Low Register --------
// - -------- CAN_MDH : (CAN_MB Offset: 0x18) CAN Message Data High Register --------
// - -------- CAN_MCR : (CAN_MB Offset: 0x1c) CAN Message Control Register --------
                                       AT91C_CAN_MACR            EQU (0x1 << 22) ; - (CAN_MB) Abort Request for Mailbox
                                           AT91C_CAN_MTCR            EQU (0x1 << 23) ; - (CAN_MB) Mailbox Transfer Command

