autosportlabs/RaceCapture-Pro_firmware/stm32_base/libs/FreeRTOSV7.6.0/FreeRTOS/Source/portable/GCC/ARM7_AT91SAM7S/ioat91sam7x256.h
// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR Control Area Network Interface
// - *****************************************************************************
// - -------- CAN_MR : (CAN Offset: 0x0) CAN Mode Register --------
                                           AT91C_CAN_CANEN           EQU (0x1 <<  0) ; - (CAN) CAN Controller Enable
                                           AT91C_CAN_LPM             EQU (0x1 <<  1) ; - (CAN) Disable/Enable Low Power Mode
                                           AT91C_CAN_ABM             EQU (0x1 <<  2) ; - (CAN) Disable/Enable Autobaud/Listen Mode
                                           AT91C_CAN_OVL             EQU (0x1 <<  3) ; - (CAN) Disable/Enable Overload Frame
                                           AT91C_CAN_TEOF            EQU (0x1 <<  4) ; - (CAN) Time Stamp messages at each end of Frame
                                           AT91C_CAN_TTM             EQU (0x1 <<  5) ; - (CAN) Disable/Enable Time Trigger Mode
                                           AT91C_CAN_TIMFRZ          EQU (0x1 <<  6) ; - (CAN) Enable Timer Freeze
                                           AT91C_CAN_DRPT            EQU (0x1 <<  7) ; - (CAN) Disable Repeat
// - -------- CAN_IER : (CAN Offset: 0x4) CAN Interrupt Enable Register --------
                                           AT91C_CAN_MB0             EQU (0x1 <<  0) ; - (CAN) Mailbox 0 Flag
                                           AT91C_CAN_MB1             EQU (0x1 <<  1) ; - (CAN) Mailbox 1 Flag
                                           AT91C_CAN_MB2             EQU (0x1 <<  2) ; - (CAN) Mailbox 2 Flag
                                           AT91C_CAN_MB3             EQU (0x1 <<  3) ; - (CAN) Mailbox 3 Flag
                                           AT91C_CAN_MB4             EQU (0x1 <<  4) ; - (CAN) Mailbox 4 Flag
                                           AT91C_CAN_MB5             EQU (0x1 <<  5) ; - (CAN) Mailbox 5 Flag
                                           AT91C_CAN_MB6             EQU (0x1 <<  6) ; - (CAN) Mailbox 6 Flag
                                           AT91C_CAN_MB7             EQU (0x1 <<  7) ; - (CAN) Mailbox 7 Flag
                                           AT91C_CAN_MB8             EQU (0x1 <<  8) ; - (CAN) Mailbox 8 Flag
                                           AT91C_CAN_MB9             EQU (0x1 <<  9) ; - (CAN) Mailbox 9 Flag
                                           AT91C_CAN_MB10            EQU (0x1 << 10) ; - (CAN) Mailbox 10 Flag
                                           AT91C_CAN_MB11            EQU (0x1 << 11) ; - (CAN) Mailbox 11 Flag
                                           AT91C_CAN_MB12            EQU (0x1 << 12) ; - (CAN) Mailbox 12 Flag
                                           AT91C_CAN_MB13            EQU (0x1 << 13) ; - (CAN) Mailbox 13 Flag
                                           AT91C_CAN_MB14            EQU (0x1 << 14) ; - (CAN) Mailbox 14 Flag
                                           AT91C_CAN_MB15            EQU (0x1 << 15) ; - (CAN) Mailbox 15 Flag
                                           AT91C_CAN_ERRA            EQU (0x1 << 16) ; - (CAN) Error Active Mode Flag
                                           AT91C_CAN_WARN            EQU (0x1 << 17) ; - (CAN) Warning Limit Flag
                                           AT91C_CAN_ERRP            EQU (0x1 << 18) ; - (CAN) Error Passive Mode Flag
                                           AT91C_CAN_BOFF            EQU (0x1 << 19) ; - (CAN) Bus Off Mode Flag
                                           AT91C_CAN_SLEEP           EQU (0x1 << 20) ; - (CAN) Sleep Flag
                                           AT91C_CAN_WAKEUP          EQU (0x1 << 21) ; - (CAN) Wakeup Flag
                                           AT91C_CAN_TOVF            EQU (0x1 << 22) ; - (CAN) Timer Overflow Flag
                                           AT91C_CAN_TSTP            EQU (0x1 << 23) ; - (CAN) Timestamp Flag
                                           AT91C_CAN_CERR            EQU (0x1 << 24) ; - (CAN) CRC Error
                                           AT91C_CAN_SERR            EQU (0x1 << 25) ; - (CAN) Stuffing Error
                                           AT91C_CAN_AERR            EQU (0x1 << 26) ; - (CAN) Acknowledgment Error
                                           AT91C_CAN_FERR            EQU (0x1 << 27) ; - (CAN) Form Error
                                           AT91C_CAN_BERR            EQU (0x1 << 28) ; - (CAN) Bit Error
// - -------- CAN_IDR : (CAN Offset: 0x8) CAN Interrupt Disable Register --------
// - -------- CAN_IMR : (CAN Offset: 0xc) CAN Interrupt Mask Register --------
// - -------- CAN_SR : (CAN Offset: 0x10) CAN Status Register --------
                                           AT91C_CAN_RBSY            EQU (0x1 << 29) ; - (CAN) Receiver Busy
                                           AT91C_CAN_TBSY            EQU (0x1 << 30) ; - (CAN) Transmitter Busy
                                           AT91C_CAN_OVLY            EQU (0x1 << 31) ; - (CAN) Overload Busy
// - -------- CAN_BR : (CAN Offset: 0x14) CAN Baudrate Register --------
                                           AT91C_CAN_PHASE2          EQU (0x7 <<  0) ; - (CAN) Phase 2 segment
                                           AT91C_CAN_PHASE1          EQU (0x7 <<  4) ; - (CAN) Phase 1 segment
                                           AT91C_CAN_PROPAG          EQU (0x7 <<  8) ; - (CAN) Programmation time segment
                                           AT91C_CAN_SYNC            EQU (0x3 << 12) ; - (CAN) Re-synchronization jump width segment
                                           AT91C_CAN_BRP             EQU (0x7F << 16) ; - (CAN) Baudrate Prescaler
                                           AT91C_CAN_SMP             EQU (0x1 << 24) ; - (CAN) Sampling mode
// - -------- CAN_TIM : (CAN Offset: 0x18) CAN Timer Register --------
                                           AT91C_CAN_TIMER           EQU (0xFFFF <<  0) ; - (CAN) Timer field
// - -------- CAN_TIMESTP : (CAN Offset: 0x1c) CAN Timestamp Register --------
// - -------- CAN_ECR : (CAN Offset: 0x20) CAN Error Counter Register --------
                                           AT91C_CAN_REC             EQU (0xFF <<  0) ; - (CAN) Receive Error Counter
                                           AT91C_CAN_TEC             EQU (0xFF << 16) ; - (CAN) Transmit Error Counter
// - -------- CAN_TCR : (CAN Offset: 0x24) CAN Transfer Command Register --------
                                           AT91C_CAN_TIMRST          EQU (0x1 << 31) ; - (CAN) Timer Reset Field
// - -------- CAN_ACR : (CAN Offset: 0x28) CAN Abort Command Register --------

// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR Ethernet MAC 10/100
// - *****************************************************************************
// - -------- EMAC_NCR : (EMAC Offset: 0x0)  --------
                                           AT91C_EMAC_LB             EQU (0x1 <<  0) ; - (EMAC) Loopback. Optional. When set, loopback signal is at high level.
                                           AT91C_EMAC_LLB            EQU (0x1 <<  1) ; - (EMAC) Loopback local.
                                           AT91C_EMAC_RE             EQU (0x1 <<  2) ; - (EMAC) Receive enable.
                                           AT91C_EMAC_TE             EQU (0x1 <<  3) ; - (EMAC) Transmit enable.
                                           AT91C_EMAC_MPE            EQU (0x1 <<  4) ; - (EMAC) Management port enable.
                                           AT91C_EMAC_CLRSTAT        EQU (0x1 <<  5) ; - (EMAC) Clear statistics registers.
                                           AT91C_EMAC_INCSTAT        EQU (0x1 <<  6) ; - (EMAC) Increment statistics registers.
                                           AT91C_EMAC_WESTAT         EQU (0x1 <<  7) ; - (EMAC) Write enable for statistics registers.
                                               AT91C_EMAC_BP             EQU (0x1 <<  8) ; - (EMAC) Back pressure.
                                               AT91C_EMAC_TSTART         EQU (0x1 <<  9) ; - (EMAC) Start Transmission.
                                               AT91C_EMAC_THALT          EQU (0x1 << 10) ; - (EMAC) Transmission Halt.
                                               AT91C_EMAC_TPFR           EQU (0x1 << 11) ; - (EMAC) Transmit pause frame
                                               AT91C_EMAC_TZQ            EQU (0x1 << 12) ; - (EMAC) Transmit zero quantum pause frame
// - -------- EMAC_NCFGR : (EMAC Offset: 0x4) Network Configuration Register --------
                                               AT91C_EMAC_SPD            EQU (0x1 <<  0) ; - (EMAC) Speed.
                                               AT91C_EMAC_FD             EQU (0x1 <<  1) ; - (EMAC) Full duplex.
                                               AT91C_EMAC_JFRAME         EQU (0x1 <<  3) ; - (EMAC) Jumbo Frames.
                                               AT91C_EMAC_CAF            EQU (0x1 <<  4) ; - (EMAC) Copy all frames.
                                               AT91C_EMAC_NBC            EQU (0x1 <<  5) ; - (EMAC) No broadcast.
                                               AT91C_EMAC_MTI            EQU (0x1 <<  6) ; - (EMAC) Multicast hash event enable
                                               AT91C_EMAC_UNI            EQU (0x1 <<  7) ; - (EMAC) Unicast hash enable.
                                               AT91C_EMAC_BIG            EQU (0x1 <<  8) ; - (EMAC) Receive 1522 bytes.
                                               AT91C_EMAC_EAE            EQU (0x1 <<  9) ; - (EMAC) External address match enable.
                                               AT91C_EMAC_CLK            EQU (0x3 << 10) ; - (EMAC)
                                               AT91C_EMAC_CLK_HCLK_8     EQU (0x0 << 10) ; - (EMAC) HCLK divided by 8
                                               AT91C_EMAC_CLK_HCLK_16    EQU (0x1 << 10) ; - (EMAC) HCLK divided by 16
                                               AT91C_EMAC_CLK_HCLK_32    EQU (0x2 << 10) ; - (EMAC) HCLK divided by 32
                                               AT91C_EMAC_CLK_HCLK_64    EQU (0x3 << 10) ; - (EMAC) HCLK divided by 64
                                               AT91C_EMAC_RTY            EQU (0x1 << 12) ; - (EMAC)
                                               AT91C_EMAC_PAE            EQU (0x1 << 13) ; - (EMAC)
                                               AT91C_EMAC_RBOF           EQU (0x3 << 14) ; - (EMAC)
                                               AT91C_EMAC_RBOF_OFFSET_0  EQU (0x0 << 14) ; - (EMAC) no offset from start of receive buffer
                                               AT91C_EMAC_RBOF_OFFSET_1  EQU (0x1 << 14) ; - (EMAC) one byte offset from start of receive buffer
                                               AT91C_EMAC_RBOF_OFFSET_2  EQU (0x2 << 14) ; - (EMAC) two bytes offset from start of receive buffer
                                               AT91C_EMAC_RBOF_OFFSET_3  EQU (0x3 << 14) ; - (EMAC) three bytes offset from start of receive buffer
                                               AT91C_EMAC_RLCE           EQU (0x1 << 16) ; - (EMAC) Receive Length field Checking Enable
                                               AT91C_EMAC_DRFCS          EQU (0x1 << 17) ; - (EMAC) Discard Receive FCS
                                               AT91C_EMAC_EFRHD          EQU (0x1 << 18) ; - (EMAC)
                                               AT91C_EMAC_IRXFCS         EQU (0x1 << 19) ; - (EMAC) Ignore RX FCS
// - -------- EMAC_NSR : (EMAC Offset: 0x8) Network Status Register --------
                                               AT91C_EMAC_LINKR          EQU (0x1 <<  0) ; - (EMAC)
                                               AT91C_EMAC_MDIO           EQU (0x1 <<  1) ; - (EMAC)
                                               AT91C_EMAC_IDLE           EQU (0x1 <<  2) ; - (EMAC)
// - -------- EMAC_TSR : (EMAC Offset: 0x14) Transmit Status Register --------
                                               AT91C_EMAC_UBR            EQU (0x1 <<  0) ; - (EMAC)
                                               AT91C_EMAC_COL            EQU (0x1 <<  1) ; - (EMAC)
                                               AT91C_EMAC_RLES           EQU (0x1 <<  2) ; - (EMAC)
                                               AT91C_EMAC_TGO            EQU (0x1 <<  3) ; - (EMAC) Transmit Go
                                               AT91C_EMAC_BEX            EQU (0x1 <<  4) ; - (EMAC) Buffers exhausted mid frame
                                               AT91C_EMAC_COMP           EQU (0x1 <<  5) ; - (EMAC)
                                               AT91C_EMAC_UND            EQU (0x1 <<  6) ; - (EMAC)
// - -------- EMAC_RSR : (EMAC Offset: 0x20) Receive Status Register --------
                                               AT91C_EMAC_BNA            EQU (0x1 <<  0) ; - (EMAC)
                                               AT91C_EMAC_REC            EQU (0x1 <<  1) ; - (EMAC)
                                               AT91C_EMAC_OVR            EQU (0x1 <<  2) ; - (EMAC)
// - -------- EMAC_ISR : (EMAC Offset: 0x24) Interrupt Status Register --------
                                               AT91C_EMAC_MFD            EQU (0x1 <<  0) ; - (EMAC)
                                               AT91C_EMAC_RCOMP          EQU (0x1 <<  1) ; - (EMAC)
                                               AT91C_EMAC_RXUBR          EQU (0x1 <<  2) ; - (EMAC)
                                               AT91C_EMAC_TXUBR          EQU (0x1 <<  3) ; - (EMAC)
                                               AT91C_EMAC_TUNDR          EQU (0x1 <<  4) ; - (EMAC)
                                               AT91C_EMAC_RLEX           EQU (0x1 <<  5) ; - (EMAC)
                                               AT91C_EMAC_TXERR          EQU (0x1 <<  6) ; - (EMAC)
                                               AT91C_EMAC_TCOMP          EQU (0x1 <<  7) ; - (EMAC)
                                               AT91C_EMAC_LINK           EQU (0x1 <<  9) ; - (EMAC)
                                               AT91C_EMAC_ROVR           EQU (0x1 << 10) ; - (EMAC)
                                               AT91C_EMAC_HRESP          EQU (0x1 << 11) ; - (EMAC)
                                               AT91C_EMAC_PFRE           EQU (0x1 << 12) ; - (EMAC)
                                               AT91C_EMAC_PTZ            EQU (0x1 << 13) ; - (EMAC)
// - -------- EMAC_IER : (EMAC Offset: 0x28) Interrupt Enable Register --------
// - -------- EMAC_IDR : (EMAC Offset: 0x2c) Interrupt Disable Register --------
// - -------- EMAC_IMR : (EMAC Offset: 0x30) Interrupt Mask Register --------
// - -------- EMAC_MAN : (EMAC Offset: 0x34) PHY Maintenance Register --------
                                               AT91C_EMAC_DATA           EQU (0xFFFF <<  0) ; - (EMAC)
                                               AT91C_EMAC_CODE           EQU (0x3 << 16) ; - (EMAC)
                                               AT91C_EMAC_REGA           EQU (0x1F << 18) ; - (EMAC)
                                               AT91C_EMAC_PHYA           EQU (0x1F << 23) ; - (EMAC)
                                               AT91C_EMAC_RW             EQU (0x3 << 28) ; - (EMAC)
                                               AT91C_EMAC_SOF            EQU (0x3 << 30) ; - (EMAC)
// - -------- EMAC_USRIO : (EMAC Offset: 0xc0) USER Input Output Register --------
                                               AT91C_EMAC_RMII           EQU (0x1 <<  0) ; - (EMAC) Reduce MII
// - -------- EMAC_WOL : (EMAC Offset: 0xc4) Wake On LAN Register --------
                                               AT91C_EMAC_IP             EQU (0xFFFF <<  0) ; - (EMAC) ARP request IP address
                                               AT91C_EMAC_MAG            EQU (0x1 << 16) ; - (EMAC) Magic packet event enable
                                               AT91C_EMAC_ARP            EQU (0x1 << 17) ; - (EMAC) ARP request event enable
                                               AT91C_EMAC_SA1            EQU (0x1 << 18) ; - (EMAC) Specific address register 1 event enable
// - -------- EMAC_REV : (EMAC Offset: 0xfc) Revision Register --------
                                               AT91C_EMAC_REVREF         EQU (0xFFFF <<  0) ; - (EMAC)
                                               AT91C_EMAC_PARTREF        EQU (0xFFFF << 16) ; - (EMAC)

