autosportlabs/RaceCapture-Pro_firmware/stm32_base/libs/FreeRTOSV7.6.0/FreeRTOS/Source/portable/GCC/ARM7_AT91SAM7S/ioat91sam7x256.h
// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR Analog to Digital Convertor
// - *****************************************************************************
// - -------- ADC_CR : (ADC Offset: 0x0) ADC Control Register --------
                                               AT91C_ADC_SWRST           EQU (0x1 <<  0) ; - (ADC) Software Reset
                                               AT91C_ADC_START           EQU (0x1 <<  1) ; - (ADC) Start Conversion
// - -------- ADC_MR : (ADC Offset: 0x4) ADC Mode Register --------
                                               AT91C_ADC_TRGEN           EQU (0x1 <<  0) ; - (ADC) Trigger Enable
                                               AT91C_ADC_TRGEN_DIS       EQU (0x0) ; - (ADC) Hradware triggers are disabled. Starting a conversion is only possible by software
                                               AT91C_ADC_TRGEN_EN        EQU (0x1) ; - (ADC) Hardware trigger selected by TRGSEL field is enabled.
                                               AT91C_ADC_TRGSEL          EQU (0x7 <<  1) ; - (ADC) Trigger Selection
                                               AT91C_ADC_TRGSEL_TIOA0    EQU (0x0 <<  1) ; - (ADC) Selected TRGSEL = TIAO0
                                                       AT91C_ADC_TRGSEL_TIOA1    EQU (0x1 <<  1) ; - (ADC) Selected TRGSEL = TIAO1
                                                               AT91C_ADC_TRGSEL_TIOA2    EQU (0x2 <<  1) ; - (ADC) Selected TRGSEL = TIAO2
                                                                       AT91C_ADC_TRGSEL_TIOA3    EQU (0x3 <<  1) ; - (ADC) Selected TRGSEL = TIAO3
                                                                               AT91C_ADC_TRGSEL_TIOA4    EQU (0x4 <<  1) ; - (ADC) Selected TRGSEL = TIAO4
                                                                                       AT91C_ADC_TRGSEL_TIOA5    EQU (0x5 <<  1) ; - (ADC) Selected TRGSEL = TIAO5
                                                                                               AT91C_ADC_TRGSEL_EXT      EQU (0x6 <<  1) ; - (ADC) Selected TRGSEL = External Trigger
                                                                                                       AT91C_ADC_LOWRES          EQU (0x1 <<  4) ; - (ADC) Resolution.
                                               AT91C_ADC_LOWRES_10_BIT   EQU (0x0 <<  4) ; - (ADC) 10-bit resolution
                                               AT91C_ADC_LOWRES_8_BIT    EQU (0x1 <<  4) ; - (ADC) 8-bit resolution
                                               AT91C_ADC_SLEEP           EQU (0x1 <<  5) ; - (ADC) Sleep Mode
                                               AT91C_ADC_SLEEP_NORMAL_MODE EQU (0x0 <<  5) ; - (ADC) Normal Mode
                                               AT91C_ADC_SLEEP_MODE      EQU (0x1 <<  5) ; - (ADC) Sleep Mode
                                               AT91C_ADC_PRESCAL         EQU (0x3F <<  8) ; - (ADC) Prescaler rate selection
                                               AT91C_ADC_STARTUP         EQU (0x1F << 16) ; - (ADC) Startup Time
                                               AT91C_ADC_SHTIM           EQU (0xF << 24) ; - (ADC) Sample & Hold Time
// - -------- 	ADC_CHER : (ADC Offset: 0x10) ADC Channel Enable Register --------
                                               AT91C_ADC_CH0             EQU (0x1 <<  0) ; - (ADC) Channel 0
                                               AT91C_ADC_CH1             EQU (0x1 <<  1) ; - (ADC) Channel 1
                                               AT91C_ADC_CH2             EQU (0x1 <<  2) ; - (ADC) Channel 2
                                               AT91C_ADC_CH3             EQU (0x1 <<  3) ; - (ADC) Channel 3
                                               AT91C_ADC_CH4             EQU (0x1 <<  4) ; - (ADC) Channel 4
                                               AT91C_ADC_CH5             EQU (0x1 <<  5) ; - (ADC) Channel 5
                                               AT91C_ADC_CH6             EQU (0x1 <<  6) ; - (ADC) Channel 6
                                               AT91C_ADC_CH7             EQU (0x1 <<  7) ; - (ADC) Channel 7
// - -------- 	ADC_CHDR : (ADC Offset: 0x14) ADC Channel Disable Register --------
// - -------- 	ADC_CHSR : (ADC Offset: 0x18) ADC Channel Status Register --------
// - -------- ADC_SR : (ADC Offset: 0x1c) ADC Status Register --------
                                               AT91C_ADC_EOC0            EQU (0x1 <<  0) ; - (ADC) End of Conversion
                                               AT91C_ADC_EOC1            EQU (0x1 <<  1) ; - (ADC) End of Conversion
                                               AT91C_ADC_EOC2            EQU (0x1 <<  2) ; - (ADC) End of Conversion
                                               AT91C_ADC_EOC3            EQU (0x1 <<  3) ; - (ADC) End of Conversion
                                               AT91C_ADC_EOC4            EQU (0x1 <<  4) ; - (ADC) End of Conversion
                                               AT91C_ADC_EOC5            EQU (0x1 <<  5) ; - (ADC) End of Conversion
                                               AT91C_ADC_EOC6            EQU (0x1 <<  6) ; - (ADC) End of Conversion
                                               AT91C_ADC_EOC7            EQU (0x1 <<  7) ; - (ADC) End of Conversion
                                               AT91C_ADC_OVRE0           EQU (0x1 <<  8) ; - (ADC) Overrun Error
                                               AT91C_ADC_OVRE1           EQU (0x1 <<  9) ; - (ADC) Overrun Error
                                               AT91C_ADC_OVRE2           EQU (0x1 << 10) ; - (ADC) Overrun Error
                                               AT91C_ADC_OVRE3           EQU (0x1 << 11) ; - (ADC) Overrun Error
                                               AT91C_ADC_OVRE4           EQU (0x1 << 12) ; - (ADC) Overrun Error
                                               AT91C_ADC_OVRE5           EQU (0x1 << 13) ; - (ADC) Overrun Error
                                               AT91C_ADC_OVRE6           EQU (0x1 << 14) ; - (ADC) Overrun Error
                                               AT91C_ADC_OVRE7           EQU (0x1 << 15) ; - (ADC) Overrun Error
                                               AT91C_ADC_DRDY            EQU (0x1 << 16) ; - (ADC) Data Ready
                                               AT91C_ADC_GOVRE           EQU (0x1 << 17) ; - (ADC) General Overrun
                                               AT91C_ADC_ENDRX           EQU (0x1 << 18) ; - (ADC) End of Receiver Transfer
                                               AT91C_ADC_RXBUFF          EQU (0x1 << 19) ; - (ADC) RXBUFF Interrupt
// - -------- ADC_LCDR : (ADC Offset: 0x20) ADC Last Converted Data Register --------
                                               AT91C_ADC_LDATA           EQU (0x3FF <<  0) ; - (ADC) Last Data Converted
// - -------- ADC_IER : (ADC Offset: 0x24) ADC Interrupt Enable Register --------
// - -------- ADC_IDR : (ADC Offset: 0x28) ADC Interrupt Disable Register --------
// - -------- ADC_IMR : (ADC Offset: 0x2c) ADC Interrupt Mask Register --------
// - -------- ADC_CDR0 : (ADC Offset: 0x30) ADC Channel Data Register 0 --------
                                               AT91C_ADC_DATA            EQU (0x3FF <<  0) ; - (ADC) Converted Data
// - -------- ADC_CDR1 : (ADC Offset: 0x34) ADC Channel Data Register 1 --------
// - -------- ADC_CDR2 : (ADC Offset: 0x38) ADC Channel Data Register 2 --------
// - -------- ADC_CDR3 : (ADC Offset: 0x3c) ADC Channel Data Register 3 --------
// - -------- ADC_CDR4 : (ADC Offset: 0x40) ADC Channel Data Register 4 --------
// - -------- ADC_CDR5 : (ADC Offset: 0x44) ADC Channel Data Register 5 --------
// - -------- ADC_CDR6 : (ADC Offset: 0x48) ADC Channel Data Register 6 --------
// - -------- ADC_CDR7 : (ADC Offset: 0x4c) ADC Channel Data Register 7 --------

// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR Advanced  Encryption Standard
// - *****************************************************************************
// - -------- AES_CR : (AES Offset: 0x0) Control Register --------
                                               AT91C_AES_START           EQU (0x1 <<  0) ; - (AES) Starts Processing
                                               AT91C_AES_SWRST           EQU (0x1 <<  8) ; - (AES) Software Reset
                                               AT91C_AES_LOADSEED        EQU (0x1 << 16) ; - (AES) Random Number Generator Seed Loading
// - -------- AES_MR : (AES Offset: 0x4) Mode Register --------
                                               AT91C_AES_CIPHER          EQU (0x1 <<  0) ; - (AES) Processing Mode
                                               AT91C_AES_PROCDLY         EQU (0xF <<  4) ; - (AES) Processing Delay
                                               AT91C_AES_SMOD            EQU (0x3 <<  8) ; - (AES) Start Mode
                                               AT91C_AES_SMOD_MANUAL     EQU (0x0 <<  8) ; - (AES) Manual Mode: The START bit in register AES_CR must be set to begin encryption or decryption.
                                               AT91C_AES_SMOD_AUTO       EQU (0x1 <<  8) ; - (AES) Auto Mode: no action in AES_CR is necessary (cf datasheet).
                                               AT91C_AES_SMOD_PDC        EQU (0x2 <<  8) ; - (AES) PDC Mode (cf datasheet).
                                               AT91C_AES_OPMOD           EQU (0x7 << 12) ; - (AES) Operation Mode
                                               AT91C_AES_OPMOD_ECB       EQU (0x0 << 12) ; - (AES) ECB Electronic CodeBook mode.
                                               AT91C_AES_OPMOD_CBC       EQU (0x1 << 12) ; - (AES) CBC Cipher Block Chaining mode.
                                               AT91C_AES_OPMOD_OFB       EQU (0x2 << 12) ; - (AES) OFB Output Feedback mode.
                                               AT91C_AES_OPMOD_CFB       EQU (0x3 << 12) ; - (AES) CFB Cipher Feedback mode.
                                               AT91C_AES_OPMOD_CTR       EQU (0x4 << 12) ; - (AES) CTR Counter mode.
                                               AT91C_AES_LOD             EQU (0x1 << 15) ; - (AES) Last Output Data Mode
                                               AT91C_AES_CFBS            EQU (0x7 << 16) ; - (AES) Cipher Feedback Data Size
                                               AT91C_AES_CFBS_128_BIT    EQU (0x0 << 16) ; - (AES) 128-bit.
                                               AT91C_AES_CFBS_64_BIT     EQU (0x1 << 16) ; - (AES) 64-bit.
                                               AT91C_AES_CFBS_32_BIT     EQU (0x2 << 16) ; - (AES) 32-bit.
                                               AT91C_AES_CFBS_16_BIT     EQU (0x3 << 16) ; - (AES) 16-bit.
                                               AT91C_AES_CFBS_8_BIT      EQU (0x4 << 16) ; - (AES) 8-bit.
                                               AT91C_AES_CKEY            EQU (0xF << 20) ; - (AES) Countermeasure Key
                                               AT91C_AES_CTYPE           EQU (0x1F << 24) ; - (AES) Countermeasure Type
                                               AT91C_AES_CTYPE_TYPE1_EN  EQU (0x1 << 24) ; - (AES) Countermeasure type 1 is enabled.
                                               AT91C_AES_CTYPE_TYPE2_EN  EQU (0x2 << 24) ; - (AES) Countermeasure type 2 is enabled.
                                               AT91C_AES_CTYPE_TYPE3_EN  EQU (0x4 << 24) ; - (AES) Countermeasure type 3 is enabled.
                                               AT91C_AES_CTYPE_TYPE4_EN  EQU (0x8 << 24) ; - (AES) Countermeasure type 4 is enabled.
                                               AT91C_AES_CTYPE_TYPE5_EN  EQU (0x10 << 24) ; - (AES) Countermeasure type 5 is enabled.
// - -------- AES_IER : (AES Offset: 0x10) Interrupt Enable Register --------
                                               AT91C_AES_DATRDY          EQU (0x1 <<  0) ; - (AES) DATRDY
                                               AT91C_AES_ENDRX           EQU (0x1 <<  1) ; - (AES) PDC Read Buffer End
                                               AT91C_AES_ENDTX           EQU (0x1 <<  2) ; - (AES) PDC Write Buffer End
                                               AT91C_AES_RXBUFF          EQU (0x1 <<  3) ; - (AES) PDC Read Buffer Full
                                               AT91C_AES_TXBUFE          EQU (0x1 <<  4) ; - (AES) PDC Write Buffer Empty
                                               AT91C_AES_URAD            EQU (0x1 <<  8) ; - (AES) Unspecified Register Access Detection
// - -------- AES_IDR : (AES Offset: 0x14) Interrupt Disable Register --------
// - -------- AES_IMR : (AES Offset: 0x18) Interrupt Mask Register --------
// - -------- AES_ISR : (AES Offset: 0x1c) Interrupt Status Register --------
                                               AT91C_AES_URAT            EQU (0x7 << 12) ; - (AES) Unspecified Register Access Type Status
                                               AT91C_AES_URAT_IN_DAT_WRITE_DATPROC EQU (0x0 << 12) ; - (AES) Input data register written during the data processing in PDC mode.
                                               AT91C_AES_URAT_OUT_DAT_READ_DATPROC EQU (0x1 << 12) ; - (AES) Output data register read during the data processing.
                                               AT91C_AES_URAT_MODEREG_WRITE_DATPROC EQU (0x2 << 12) ; - (AES) Mode register written during the data processing.
                                               AT91C_AES_URAT_OUT_DAT_READ_SUBKEY EQU (0x3 << 12) ; - (AES) Output data register read during the sub-keys generation.
                                               AT91C_AES_URAT_MODEREG_WRITE_SUBKEY EQU (0x4 << 12) ; - (AES) Mode register written during the sub-keys generation.
                                               AT91C_AES_URAT_WO_REG_READ EQU (0x5 << 12) ; - (AES) Write-only register read access.

// - *****************************************************************************
// -              SOFTWARE API DEFINITION  FOR Triple Data Encryption Standard
// - *****************************************************************************
// - -------- TDES_CR : (TDES Offset: 0x0) Control Register --------
                                               AT91C_TDES_START          EQU (0x1 <<  0) ; - (TDES) Starts Processing
                                               AT91C_TDES_SWRST          EQU (0x1 <<  8) ; - (TDES) Software Reset
// - -------- TDES_MR : (TDES Offset: 0x4) Mode Register --------
                                               AT91C_TDES_CIPHER         EQU (0x1 <<  0) ; - (TDES) Processing Mode
                                               AT91C_TDES_TDESMOD        EQU (0x1 <<  1) ; - (TDES) Single or Triple DES Mode
                                               AT91C_TDES_KEYMOD         EQU (0x1 <<  4) ; - (TDES) Key Mode
                                               AT91C_TDES_SMOD           EQU (0x3 <<  8) ; - (TDES) Start Mode
                                               AT91C_TDES_SMOD_MANUAL    EQU (0x0 <<  8) ; - (TDES) Manual Mode: The START bit in register TDES_CR must be set to begin encryption or decryption.
                                               AT91C_TDES_SMOD_AUTO      EQU (0x1 <<  8) ; - (TDES) Auto Mode: no action in TDES_CR is necessary (cf datasheet).
                                               AT91C_TDES_SMOD_PDC       EQU (0x2 <<  8) ; - (TDES) PDC Mode (cf datasheet).
                                               AT91C_TDES_OPMOD          EQU (0x3 << 12) ; - (TDES) Operation Mode
                                               AT91C_TDES_OPMOD_ECB      EQU (0x0 << 12) ; - (TDES) ECB Electronic CodeBook mode.
                                               AT91C_TDES_OPMOD_CBC      EQU (0x1 << 12) ; - (TDES) CBC Cipher Block Chaining mode.
                                               AT91C_TDES_OPMOD_OFB      EQU (0x2 << 12) ; - (TDES) OFB Output Feedback mode.
                                               AT91C_TDES_OPMOD_CFB      EQU (0x3 << 12) ; - (TDES) CFB Cipher Feedback mode.
                                               AT91C_TDES_LOD            EQU (0x1 << 15) ; - (TDES) Last Output Data Mode
                                               AT91C_TDES_CFBS           EQU (0x3 << 16) ; - (TDES) Cipher Feedback Data Size
                                               AT91C_TDES_CFBS_64_BIT    EQU (0x0 << 16) ; - (TDES) 64-bit.
                                               AT91C_TDES_CFBS_32_BIT    EQU (0x1 << 16) ; - (TDES) 32-bit.
                                               AT91C_TDES_CFBS_16_BIT    EQU (0x2 << 16) ; - (TDES) 16-bit.
                                               AT91C_TDES_CFBS_8_BIT     EQU (0x3 << 16) ; - (TDES) 8-bit.
// - -------- TDES_IER : (TDES Offset: 0x10) Interrupt Enable Register --------
                                               AT91C_TDES_DATRDY         EQU (0x1 <<  0) ; - (TDES) DATRDY
                                               AT91C_TDES_ENDRX          EQU (0x1 <<  1) ; - (TDES) PDC Read Buffer End
                                               AT91C_TDES_ENDTX          EQU (0x1 <<  2) ; - (TDES) PDC Write Buffer End
                                               AT91C_TDES_RXBUFF         EQU (0x1 <<  3) ; - (TDES) PDC Read Buffer Full
                                               AT91C_TDES_TXBUFE         EQU (0x1 <<  4) ; - (TDES) PDC Write Buffer Empty
                                               AT91C_TDES_URAD           EQU (0x1 <<  8) ; - (TDES) Unspecified Register Access Detection
// - -------- TDES_IDR : (TDES Offset: 0x14) Interrupt Disable Register --------
// - -------- TDES_IMR : (TDES Offset: 0x18) Interrupt Mask Register --------
// - -------- TDES_ISR : (TDES Offset: 0x1c) Interrupt Status Register --------
                                               AT91C_TDES_URAT           EQU (0x3 << 12) ; - (TDES) Unspecified Register Access Type Status
                                               AT91C_TDES_URAT_IN_DAT_WRITE_DATPROC EQU (0x0 << 12) ; - (TDES) Input data register written during the data processing in PDC mode.
                                               AT91C_TDES_URAT_OUT_DAT_READ_DATPROC EQU (0x1 << 12) ; - (TDES) Output data register read during the data processing.
                                               AT91C_TDES_URAT_MODEREG_WRITE_DATPROC EQU (0x2 << 12) ; - (TDES) Mode register written during the data processing.
                                               AT91C_TDES_URAT_WO_REG_READ EQU (0x3 << 12) ; - (TDES) Write-only register read access.

