autosportlabs/RaceCapture-Pro_firmware/stm32_base/libs/FreeRTOSV7.6.0/FreeRTOS/Source/portable/GCC/ARM7_AT91SAM7S/ioat91sam7x256.h
// - *****************************************************************************
// -               REGISTER ADDRESS DEFINITION FOR AT91SAM7X256
// - *****************************************************************************
// - ========== Register definition for SYS peripheral ==========
// - ========== Register definition for AIC peripheral ==========
                                               AT91C_AIC_IVR             EQU (0xFFFFF100) ; - (AIC) IRQ Vector Register
                                               AT91C_AIC_SMR             EQU (0xFFFFF000) ; - (AIC) Source Mode Register
                                               AT91C_AIC_FVR             EQU (0xFFFFF104) ; - (AIC) FIQ Vector Register
                                               AT91C_AIC_DCR             EQU (0xFFFFF138) ; - (AIC) Debug Control Register (Protect)
                                               AT91C_AIC_EOICR           EQU (0xFFFFF130) ; - (AIC) End of Interrupt Command Register
                                               AT91C_AIC_SVR             EQU (0xFFFFF080) ; - (AIC) Source Vector Register
                                               AT91C_AIC_FFSR            EQU (0xFFFFF148) ; - (AIC) Fast Forcing Status Register
                                               AT91C_AIC_ICCR            EQU (0xFFFFF128) ; - (AIC) Interrupt Clear Command Register
                                               AT91C_AIC_ISR             EQU (0xFFFFF108) ; - (AIC) Interrupt Status Register
                                               AT91C_AIC_IMR             EQU (0xFFFFF110) ; - (AIC) Interrupt Mask Register
                                               AT91C_AIC_IPR             EQU (0xFFFFF10C) ; - (AIC) Interrupt Pending Register
                                               AT91C_AIC_FFER            EQU (0xFFFFF140) ; - (AIC) Fast Forcing Enable Register
                                               AT91C_AIC_IECR            EQU (0xFFFFF120) ; - (AIC) Interrupt Enable Command Register
                                               AT91C_AIC_ISCR            EQU (0xFFFFF12C) ; - (AIC) Interrupt Set Command Register
                                               AT91C_AIC_FFDR            EQU (0xFFFFF144) ; - (AIC) Fast Forcing Disable Register
                                               AT91C_AIC_CISR            EQU (0xFFFFF114) ; - (AIC) Core Interrupt Status Register
                                               AT91C_AIC_IDCR            EQU (0xFFFFF124) ; - (AIC) Interrupt Disable Command Register
                                               AT91C_AIC_SPU             EQU (0xFFFFF134) ; - (AIC) Spurious Vector Register
// - ========== Register definition for PDC_DBGU peripheral ==========
                                               AT91C_DBGU_TCR            EQU (0xFFFFF30C) ; - (PDC_DBGU) Transmit Counter Register
                                               AT91C_DBGU_RNPR           EQU (0xFFFFF310) ; - (PDC_DBGU) Receive Next Pointer Register
                                               AT91C_DBGU_TNPR           EQU (0xFFFFF318) ; - (PDC_DBGU) Transmit Next Pointer Register
                                               AT91C_DBGU_TPR            EQU (0xFFFFF308) ; - (PDC_DBGU) Transmit Pointer Register
                                               AT91C_DBGU_RPR            EQU (0xFFFFF300) ; - (PDC_DBGU) Receive Pointer Register
                                               AT91C_DBGU_RCR            EQU (0xFFFFF304) ; - (PDC_DBGU) Receive Counter Register
                                               AT91C_DBGU_RNCR           EQU (0xFFFFF314) ; - (PDC_DBGU) Receive Next Counter Register
                                               AT91C_DBGU_PTCR           EQU (0xFFFFF320) ; - (PDC_DBGU) PDC Transfer Control Register
                                               AT91C_DBGU_PTSR           EQU (0xFFFFF324) ; - (PDC_DBGU) PDC Transfer Status Register
                                               AT91C_DBGU_TNCR           EQU (0xFFFFF31C) ; - (PDC_DBGU) Transmit Next Counter Register
// - ========== Register definition for DBGU peripheral ==========
                                               AT91C_DBGU_EXID           EQU (0xFFFFF244) ; - (DBGU) Chip ID Extension Register
                                               AT91C_DBGU_BRGR           EQU (0xFFFFF220) ; - (DBGU) Baud Rate Generator Register
                                               AT91C_DBGU_IDR            EQU (0xFFFFF20C) ; - (DBGU) Interrupt Disable Register
                                               AT91C_DBGU_CSR            EQU (0xFFFFF214) ; - (DBGU) Channel Status Register
                                               AT91C_DBGU_CIDR           EQU (0xFFFFF240) ; - (DBGU) Chip ID Register
                                               AT91C_DBGU_MR             EQU (0xFFFFF204) ; - (DBGU) Mode Register
                                               AT91C_DBGU_IMR            EQU (0xFFFFF210) ; - (DBGU) Interrupt Mask Register
                                               AT91C_DBGU_CR             EQU (0xFFFFF200) ; - (DBGU) Control Register
                                               AT91C_DBGU_FNTR           EQU (0xFFFFF248) ; - (DBGU) Force NTRST Register
                                               AT91C_DBGU_THR            EQU (0xFFFFF21C) ; - (DBGU) Transmitter Holding Register
                                               AT91C_DBGU_RHR            EQU (0xFFFFF218) ; - (DBGU) Receiver Holding Register
                                               AT91C_DBGU_IER            EQU (0xFFFFF208) ; - (DBGU) Interrupt Enable Register
// - ========== Register definition for PIOA peripheral ==========
                                               AT91C_PIOA_ODR            EQU (0xFFFFF414) ; - (PIOA) Output Disable Registerr
                                               AT91C_PIOA_SODR           EQU (0xFFFFF430) ; - (PIOA) Set Output Data Register
                                               AT91C_PIOA_ISR            EQU (0xFFFFF44C) ; - (PIOA) Interrupt Status Register
                                               AT91C_PIOA_ABSR           EQU (0xFFFFF478) ; - (PIOA) AB Select Status Register
                                               AT91C_PIOA_IER            EQU (0xFFFFF440) ; - (PIOA) Interrupt Enable Register
                                               AT91C_PIOA_PPUDR          EQU (0xFFFFF460) ; - (PIOA) Pull-up Disable Register
                                               AT91C_PIOA_IMR            EQU (0xFFFFF448) ; - (PIOA) Interrupt Mask Register
                                               AT91C_PIOA_PER            EQU (0xFFFFF400) ; - (PIOA) PIO Enable Register
                                               AT91C_PIOA_IFDR           EQU (0xFFFFF424) ; - (PIOA) Input Filter Disable Register
                                               AT91C_PIOA_OWDR           EQU (0xFFFFF4A4) ; - (PIOA) Output Write Disable Register
                                               AT91C_PIOA_MDSR           EQU (0xFFFFF458) ; - (PIOA) Multi-driver Status Register
                                               AT91C_PIOA_IDR            EQU (0xFFFFF444) ; - (PIOA) Interrupt Disable Register
                                               AT91C_PIOA_ODSR           EQU (0xFFFFF438) ; - (PIOA) Output Data Status Register
                                               AT91C_PIOA_PPUSR          EQU (0xFFFFF468) ; - (PIOA) Pull-up Status Register
                                               AT91C_PIOA_OWSR           EQU (0xFFFFF4A8) ; - (PIOA) Output Write Status Register
                                               AT91C_PIOA_BSR            EQU (0xFFFFF474) ; - (PIOA) Select B Register
                                               AT91C_PIOA_OWER           EQU (0xFFFFF4A0) ; - (PIOA) Output Write Enable Register
                                               AT91C_PIOA_IFER           EQU (0xFFFFF420) ; - (PIOA) Input Filter Enable Register
                                               AT91C_PIOA_PDSR           EQU (0xFFFFF43C) ; - (PIOA) Pin Data Status Register
                                               AT91C_PIOA_PPUER          EQU (0xFFFFF464) ; - (PIOA) Pull-up Enable Register
                                               AT91C_PIOA_OSR            EQU (0xFFFFF418) ; - (PIOA) Output Status Register
                                               AT91C_PIOA_ASR            EQU (0xFFFFF470) ; - (PIOA) Select A Register
                                               AT91C_PIOA_MDDR           EQU (0xFFFFF454) ; - (PIOA) Multi-driver Disable Register
                                               AT91C_PIOA_CODR           EQU (0xFFFFF434) ; - (PIOA) Clear Output Data Register
                                               AT91C_PIOA_MDER           EQU (0xFFFFF450) ; - (PIOA) Multi-driver Enable Register
                                               AT91C_PIOA_PDR            EQU (0xFFFFF404) ; - (PIOA) PIO Disable Register
                                               AT91C_PIOA_IFSR           EQU (0xFFFFF428) ; - (PIOA) Input Filter Status Register
                                               AT91C_PIOA_OER            EQU (0xFFFFF410) ; - (PIOA) Output Enable Register
                                               AT91C_PIOA_PSR            EQU (0xFFFFF408) ; - (PIOA) PIO Status Register
// - ========== Register definition for PIOB peripheral ==========
                                               AT91C_PIOB_OWDR           EQU (0xFFFFF6A4) ; - (PIOB) Output Write Disable Register
                                               AT91C_PIOB_MDER           EQU (0xFFFFF650) ; - (PIOB) Multi-driver Enable Register
                                               AT91C_PIOB_PPUSR          EQU (0xFFFFF668) ; - (PIOB) Pull-up Status Register
                                               AT91C_PIOB_IMR            EQU (0xFFFFF648) ; - (PIOB) Interrupt Mask Register
                                               AT91C_PIOB_ASR            EQU (0xFFFFF670) ; - (PIOB) Select A Register
                                               AT91C_PIOB_PPUDR          EQU (0xFFFFF660) ; - (PIOB) Pull-up Disable Register
                                               AT91C_PIOB_PSR            EQU (0xFFFFF608) ; - (PIOB) PIO Status Register
                                               AT91C_PIOB_IER            EQU (0xFFFFF640) ; - (PIOB) Interrupt Enable Register
                                               AT91C_PIOB_CODR           EQU (0xFFFFF634) ; - (PIOB) Clear Output Data Register
                                               AT91C_PIOB_OWER           EQU (0xFFFFF6A0) ; - (PIOB) Output Write Enable Register
                                               AT91C_PIOB_ABSR           EQU (0xFFFFF678) ; - (PIOB) AB Select Status Register
                                               AT91C_PIOB_IFDR           EQU (0xFFFFF624) ; - (PIOB) Input Filter Disable Register
                                               AT91C_PIOB_PDSR           EQU (0xFFFFF63C) ; - (PIOB) Pin Data Status Register
                                               AT91C_PIOB_IDR            EQU (0xFFFFF644) ; - (PIOB) Interrupt Disable Register
                                               AT91C_PIOB_OWSR           EQU (0xFFFFF6A8) ; - (PIOB) Output Write Status Register
                                               AT91C_PIOB_PDR            EQU (0xFFFFF604) ; - (PIOB) PIO Disable Register
                                               AT91C_PIOB_ODR            EQU (0xFFFFF614) ; - (PIOB) Output Disable Registerr
                                               AT91C_PIOB_IFSR           EQU (0xFFFFF628) ; - (PIOB) Input Filter Status Register
                                               AT91C_PIOB_PPUER          EQU (0xFFFFF664) ; - (PIOB) Pull-up Enable Register
                                               AT91C_PIOB_SODR           EQU (0xFFFFF630) ; - (PIOB) Set Output Data Register
                                               AT91C_PIOB_ISR            EQU (0xFFFFF64C) ; - (PIOB) Interrupt Status Register
                                               AT91C_PIOB_ODSR           EQU (0xFFFFF638) ; - (PIOB) Output Data Status Register
                                               AT91C_PIOB_OSR            EQU (0xFFFFF618) ; - (PIOB) Output Status Register
                                               AT91C_PIOB_MDSR           EQU (0xFFFFF658) ; - (PIOB) Multi-driver Status Register
                                               AT91C_PIOB_IFER           EQU (0xFFFFF620) ; - (PIOB) Input Filter Enable Register
                                               AT91C_PIOB_BSR            EQU (0xFFFFF674) ; - (PIOB) Select B Register
                                               AT91C_PIOB_MDDR           EQU (0xFFFFF654) ; - (PIOB) Multi-driver Disable Register
                                               AT91C_PIOB_OER            EQU (0xFFFFF610) ; - (PIOB) Output Enable Register
                                               AT91C_PIOB_PER            EQU (0xFFFFF600) ; - (PIOB) PIO Enable Register
// - ========== Register definition for CKGR peripheral ==========
                                               AT91C_CKGR_MOR            EQU (0xFFFFFC20) ; - (CKGR) Main Oscillator Register
                                               AT91C_CKGR_PLLR           EQU (0xFFFFFC2C) ; - (CKGR) PLL Register
                                               AT91C_CKGR_MCFR           EQU (0xFFFFFC24) ; - (CKGR) Main Clock  Frequency Register
// - ========== Register definition for PMC peripheral ==========
                                               AT91C_PMC_IDR             EQU (0xFFFFFC64) ; - (PMC) Interrupt Disable Register
                                               AT91C_PMC_MOR             EQU (0xFFFFFC20) ; - (PMC) Main Oscillator Register
                                               AT91C_PMC_PLLR            EQU (0xFFFFFC2C) ; - (PMC) PLL Register
                                               AT91C_PMC_PCER            EQU (0xFFFFFC10) ; - (PMC) Peripheral Clock Enable Register
                                               AT91C_PMC_PCKR            EQU (0xFFFFFC40) ; - (PMC) Programmable Clock Register
                                               AT91C_PMC_MCKR            EQU (0xFFFFFC30) ; - (PMC) Master Clock Register
                                               AT91C_PMC_SCDR            EQU (0xFFFFFC04) ; - (PMC) System Clock Disable Register
                                               AT91C_PMC_PCDR            EQU (0xFFFFFC14) ; - (PMC) Peripheral Clock Disable Register
                                               AT91C_PMC_SCSR            EQU (0xFFFFFC08) ; - (PMC) System Clock Status Register
                                               AT91C_PMC_PCSR            EQU (0xFFFFFC18) ; - (PMC) Peripheral Clock Status Register
                                               AT91C_PMC_MCFR            EQU (0xFFFFFC24) ; - (PMC) Main Clock  Frequency Register
                                               AT91C_PMC_SCER            EQU (0xFFFFFC00) ; - (PMC) System Clock Enable Register
                                               AT91C_PMC_IMR             EQU (0xFFFFFC6C) ; - (PMC) Interrupt Mask Register
                                               AT91C_PMC_IER             EQU (0xFFFFFC60) ; - (PMC) Interrupt Enable Register
                                               AT91C_PMC_SR              EQU (0xFFFFFC68) ; - (PMC) Status Register
// - ========== Register definition for RSTC peripheral ==========
                                               AT91C_RSTC_RCR            EQU (0xFFFFFD00) ; - (RSTC) Reset Control Register
                                               AT91C_RSTC_RMR            EQU (0xFFFFFD08) ; - (RSTC) Reset Mode Register
                                               AT91C_RSTC_RSR            EQU (0xFFFFFD04) ; - (RSTC) Reset Status Register
// - ========== Register definition for RTTC peripheral ==========
                                               AT91C_RTTC_RTSR           EQU (0xFFFFFD2C) ; - (RTTC) Real-time Status Register
                                               AT91C_RTTC_RTMR           EQU (0xFFFFFD20) ; - (RTTC) Real-time Mode Register
                                               AT91C_RTTC_RTVR           EQU (0xFFFFFD28) ; - (RTTC) Real-time Value Register
                                               AT91C_RTTC_RTAR           EQU (0xFFFFFD24) ; - (RTTC) Real-time Alarm Register
// - ========== Register definition for PITC peripheral ==========
                                               AT91C_PITC_PIVR           EQU (0xFFFFFD38) ; - (PITC) Period Interval Value Register
                                               AT91C_PITC_PISR           EQU (0xFFFFFD34) ; - (PITC) Period Interval Status Register
                                               AT91C_PITC_PIIR           EQU (0xFFFFFD3C) ; - (PITC) Period Interval Image Register
                                               AT91C_PITC_PIMR           EQU (0xFFFFFD30) ; - (PITC) Period Interval Mode Register
// - ========== Register definition for WDTC peripheral ==========
                                               AT91C_WDTC_WDCR           EQU (0xFFFFFD40) ; - (WDTC) Watchdog Control Register
                                               AT91C_WDTC_WDSR           EQU (0xFFFFFD48) ; - (WDTC) Watchdog Status Register
                                               AT91C_WDTC_WDMR           EQU (0xFFFFFD44) ; - (WDTC) Watchdog Mode Register
// - ========== Register definition for VREG peripheral ==========
                                               AT91C_VREG_MR             EQU (0xFFFFFD60) ; - (VREG) Voltage Regulator Mode Register
// - ========== Register definition for MC peripheral ==========
                                               AT91C_MC_ASR              EQU (0xFFFFFF04) ; - (MC) MC Abort Status Register
                                               AT91C_MC_RCR              EQU (0xFFFFFF00) ; - (MC) MC Remap Control Register
                                               AT91C_MC_FCR              EQU (0xFFFFFF64) ; - (MC) MC Flash Command Register
                                               AT91C_MC_AASR             EQU (0xFFFFFF08) ; - (MC) MC Abort Address Status Register
                                               AT91C_MC_FSR              EQU (0xFFFFFF68) ; - (MC) MC Flash Status Register
                                               AT91C_MC_FMR              EQU (0xFFFFFF60) ; - (MC) MC Flash Mode Register
// - ========== Register definition for PDC_SPI1 peripheral ==========
                                               AT91C_SPI1_PTCR           EQU (0xFFFE4120) ; - (PDC_SPI1) PDC Transfer Control Register
                                               AT91C_SPI1_RPR            EQU (0xFFFE4100) ; - (PDC_SPI1) Receive Pointer Register
                                               AT91C_SPI1_TNCR           EQU (0xFFFE411C) ; - (PDC_SPI1) Transmit Next Counter Register
                                               AT91C_SPI1_TPR            EQU (0xFFFE4108) ; - (PDC_SPI1) Transmit Pointer Register
                                               AT91C_SPI1_TNPR           EQU (0xFFFE4118) ; - (PDC_SPI1) Transmit Next Pointer Register
                                               AT91C_SPI1_TCR            EQU (0xFFFE410C) ; - (PDC_SPI1) Transmit Counter Register
                                               AT91C_SPI1_RCR            EQU (0xFFFE4104) ; - (PDC_SPI1) Receive Counter Register
                                               AT91C_SPI1_RNPR           EQU (0xFFFE4110) ; - (PDC_SPI1) Receive Next Pointer Register
                                               AT91C_SPI1_RNCR           EQU (0xFFFE4114) ; - (PDC_SPI1) Receive Next Counter Register
                                               AT91C_SPI1_PTSR           EQU (0xFFFE4124) ; - (PDC_SPI1) PDC Transfer Status Register
// - ========== Register definition for SPI1 peripheral ==========
                                               AT91C_SPI1_IMR            EQU (0xFFFE401C) ; - (SPI1) Interrupt Mask Register
                                               AT91C_SPI1_IER            EQU (0xFFFE4014) ; - (SPI1) Interrupt Enable Register
                                               AT91C_SPI1_MR             EQU (0xFFFE4004) ; - (SPI1) Mode Register
                                               AT91C_SPI1_RDR            EQU (0xFFFE4008) ; - (SPI1) Receive Data Register
                                               AT91C_SPI1_IDR            EQU (0xFFFE4018) ; - (SPI1) Interrupt Disable Register
                                               AT91C_SPI1_SR             EQU (0xFFFE4010) ; - (SPI1) Status Register
                                               AT91C_SPI1_TDR            EQU (0xFFFE400C) ; - (SPI1) Transmit Data Register
                                               AT91C_SPI1_CR             EQU (0xFFFE4000) ; - (SPI1) Control Register
                                               AT91C_SPI1_CSR            EQU (0xFFFE4030) ; - (SPI1) Chip Select Register
// - ========== Register definition for PDC_SPI0 peripheral ==========
                                               AT91C_SPI0_PTCR           EQU (0xFFFE0120) ; - (PDC_SPI0) PDC Transfer Control Register
                                               AT91C_SPI0_TPR            EQU (0xFFFE0108) ; - (PDC_SPI0) Transmit Pointer Register
                                               AT91C_SPI0_TCR            EQU (0xFFFE010C) ; - (PDC_SPI0) Transmit Counter Register
                                               AT91C_SPI0_RCR            EQU (0xFFFE0104) ; - (PDC_SPI0) Receive Counter Register
                                               AT91C_SPI0_PTSR           EQU (0xFFFE0124) ; - (PDC_SPI0) PDC Transfer Status Register
                                               AT91C_SPI0_RNPR           EQU (0xFFFE0110) ; - (PDC_SPI0) Receive Next Pointer Register
                                               AT91C_SPI0_RPR            EQU (0xFFFE0100) ; - (PDC_SPI0) Receive Pointer Register
                                               AT91C_SPI0_TNCR           EQU (0xFFFE011C) ; - (PDC_SPI0) Transmit Next Counter Register
                                               AT91C_SPI0_RNCR           EQU (0xFFFE0114) ; - (PDC_SPI0) Receive Next Counter Register
                                               AT91C_SPI0_TNPR           EQU (0xFFFE0118) ; - (PDC_SPI0) Transmit Next Pointer Register
// - ========== Register definition for SPI0 peripheral ==========
                                               AT91C_SPI0_IER            EQU (0xFFFE0014) ; - (SPI0) Interrupt Enable Register
                                               AT91C_SPI0_SR             EQU (0xFFFE0010) ; - (SPI0) Status Register
                                               AT91C_SPI0_IDR            EQU (0xFFFE0018) ; - (SPI0) Interrupt Disable Register
                                               AT91C_SPI0_CR             EQU (0xFFFE0000) ; - (SPI0) Control Register
                                               AT91C_SPI0_MR             EQU (0xFFFE0004) ; - (SPI0) Mode Register
                                               AT91C_SPI0_IMR            EQU (0xFFFE001C) ; - (SPI0) Interrupt Mask Register
                                               AT91C_SPI0_TDR            EQU (0xFFFE000C) ; - (SPI0) Transmit Data Register
                                               AT91C_SPI0_RDR            EQU (0xFFFE0008) ; - (SPI0) Receive Data Register
                                               AT91C_SPI0_CSR            EQU (0xFFFE0030) ; - (SPI0) Chip Select Register
// - ========== Register definition for PDC_US1 peripheral ==========
