autosportlabs/RaceCapture-Pro_firmware/stm32_base/libs/FreeRTOSV7.6.0/FreeRTOS/Source/portable/GCC/ARM7_AT91SAM7S/ioat91sam7x256.h
                                               AT91C_US1_RNCR            EQU (0xFFFC4114) ; - (PDC_US1) Receive Next Counter Register
                                               AT91C_US1_PTCR            EQU (0xFFFC4120) ; - (PDC_US1) PDC Transfer Control Register
                                               AT91C_US1_TCR             EQU (0xFFFC410C) ; - (PDC_US1) Transmit Counter Register
                                               AT91C_US1_PTSR            EQU (0xFFFC4124) ; - (PDC_US1) PDC Transfer Status Register
                                               AT91C_US1_TNPR            EQU (0xFFFC4118) ; - (PDC_US1) Transmit Next Pointer Register
                                               AT91C_US1_RCR             EQU (0xFFFC4104) ; - (PDC_US1) Receive Counter Register
                                               AT91C_US1_RNPR            EQU (0xFFFC4110) ; - (PDC_US1) Receive Next Pointer Register
                                               AT91C_US1_RPR             EQU (0xFFFC4100) ; - (PDC_US1) Receive Pointer Register
                                               AT91C_US1_TNCR            EQU (0xFFFC411C) ; - (PDC_US1) Transmit Next Counter Register
                                               AT91C_US1_TPR             EQU (0xFFFC4108) ; - (PDC_US1) Transmit Pointer Register
// - ========== Register definition for US1 peripheral ==========
                                               AT91C_US1_IF              EQU (0xFFFC404C) ; - (US1) IRDA_FILTER Register
                                               AT91C_US1_NER             EQU (0xFFFC4044) ; - (US1) Nb Errors Register
                                               AT91C_US1_RTOR            EQU (0xFFFC4024) ; - (US1) Receiver Time-out Register
                                               AT91C_US1_CSR             EQU (0xFFFC4014) ; - (US1) Channel Status Register
                                               AT91C_US1_IDR             EQU (0xFFFC400C) ; - (US1) Interrupt Disable Register
                                               AT91C_US1_IER             EQU (0xFFFC4008) ; - (US1) Interrupt Enable Register
                                               AT91C_US1_THR             EQU (0xFFFC401C) ; - (US1) Transmitter Holding Register
                                               AT91C_US1_TTGR            EQU (0xFFFC4028) ; - (US1) Transmitter Time-guard Register
                                               AT91C_US1_RHR             EQU (0xFFFC4018) ; - (US1) Receiver Holding Register
                                               AT91C_US1_BRGR            EQU (0xFFFC4020) ; - (US1) Baud Rate Generator Register
                                               AT91C_US1_IMR             EQU (0xFFFC4010) ; - (US1) Interrupt Mask Register
                                               AT91C_US1_FIDI            EQU (0xFFFC4040) ; - (US1) FI_DI_Ratio Register
                                               AT91C_US1_CR              EQU (0xFFFC4000) ; - (US1) Control Register
                                               AT91C_US1_MR              EQU (0xFFFC4004) ; - (US1) Mode Register
// - ========== Register definition for PDC_US0 peripheral ==========
                                               AT91C_US0_TNPR            EQU (0xFFFC0118) ; - (PDC_US0) Transmit Next Pointer Register
                                               AT91C_US0_RNPR            EQU (0xFFFC0110) ; - (PDC_US0) Receive Next Pointer Register
                                               AT91C_US0_TCR             EQU (0xFFFC010C) ; - (PDC_US0) Transmit Counter Register
                                               AT91C_US0_PTCR            EQU (0xFFFC0120) ; - (PDC_US0) PDC Transfer Control Register
                                               AT91C_US0_PTSR            EQU (0xFFFC0124) ; - (PDC_US0) PDC Transfer Status Register
                                               AT91C_US0_TNCR            EQU (0xFFFC011C) ; - (PDC_US0) Transmit Next Counter Register
                                               AT91C_US0_TPR             EQU (0xFFFC0108) ; - (PDC_US0) Transmit Pointer Register
                                               AT91C_US0_RCR             EQU (0xFFFC0104) ; - (PDC_US0) Receive Counter Register
                                               AT91C_US0_RPR             EQU (0xFFFC0100) ; - (PDC_US0) Receive Pointer Register
                                               AT91C_US0_RNCR            EQU (0xFFFC0114) ; - (PDC_US0) Receive Next Counter Register
// - ========== Register definition for US0 peripheral ==========
                                               AT91C_US0_BRGR            EQU (0xFFFC0020) ; - (US0) Baud Rate Generator Register
                                               AT91C_US0_NER             EQU (0xFFFC0044) ; - (US0) Nb Errors Register
                                               AT91C_US0_CR              EQU (0xFFFC0000) ; - (US0) Control Register
                                               AT91C_US0_IMR             EQU (0xFFFC0010) ; - (US0) Interrupt Mask Register
                                               AT91C_US0_FIDI            EQU (0xFFFC0040) ; - (US0) FI_DI_Ratio Register
                                               AT91C_US0_TTGR            EQU (0xFFFC0028) ; - (US0) Transmitter Time-guard Register
                                               AT91C_US0_MR              EQU (0xFFFC0004) ; - (US0) Mode Register
                                               AT91C_US0_RTOR            EQU (0xFFFC0024) ; - (US0) Receiver Time-out Register
                                               AT91C_US0_CSR             EQU (0xFFFC0014) ; - (US0) Channel Status Register
                                               AT91C_US0_RHR             EQU (0xFFFC0018) ; - (US0) Receiver Holding Register
                                               AT91C_US0_IDR             EQU (0xFFFC000C) ; - (US0) Interrupt Disable Register
                                               AT91C_US0_THR             EQU (0xFFFC001C) ; - (US0) Transmitter Holding Register
                                               AT91C_US0_IF              EQU (0xFFFC004C) ; - (US0) IRDA_FILTER Register
                                               AT91C_US0_IER             EQU (0xFFFC0008) ; - (US0) Interrupt Enable Register
// - ========== Register definition for PDC_SSC peripheral ==========
                                               AT91C_SSC_TNCR            EQU (0xFFFD411C) ; - (PDC_SSC) Transmit Next Counter Register
                                               AT91C_SSC_RPR             EQU (0xFFFD4100) ; - (PDC_SSC) Receive Pointer Register
                                               AT91C_SSC_RNCR            EQU (0xFFFD4114) ; - (PDC_SSC) Receive Next Counter Register
                                               AT91C_SSC_TPR             EQU (0xFFFD4108) ; - (PDC_SSC) Transmit Pointer Register
                                               AT91C_SSC_PTCR            EQU (0xFFFD4120) ; - (PDC_SSC) PDC Transfer Control Register
                                               AT91C_SSC_TCR             EQU (0xFFFD410C) ; - (PDC_SSC) Transmit Counter Register
                                               AT91C_SSC_RCR             EQU (0xFFFD4104) ; - (PDC_SSC) Receive Counter Register
                                               AT91C_SSC_RNPR            EQU (0xFFFD4110) ; - (PDC_SSC) Receive Next Pointer Register
                                               AT91C_SSC_TNPR            EQU (0xFFFD4118) ; - (PDC_SSC) Transmit Next Pointer Register
                                               AT91C_SSC_PTSR            EQU (0xFFFD4124) ; - (PDC_SSC) PDC Transfer Status Register
// - ========== Register definition for SSC peripheral ==========
                                               AT91C_SSC_RHR             EQU (0xFFFD4020) ; - (SSC) Receive Holding Register
                                               AT91C_SSC_RSHR            EQU (0xFFFD4030) ; - (SSC) Receive Sync Holding Register
                                               AT91C_SSC_TFMR            EQU (0xFFFD401C) ; - (SSC) Transmit Frame Mode Register
                                               AT91C_SSC_IDR             EQU (0xFFFD4048) ; - (SSC) Interrupt Disable Register
                                               AT91C_SSC_THR             EQU (0xFFFD4024) ; - (SSC) Transmit Holding Register
                                               AT91C_SSC_RCMR            EQU (0xFFFD4010) ; - (SSC) Receive Clock ModeRegister
                                               AT91C_SSC_IER             EQU (0xFFFD4044) ; - (SSC) Interrupt Enable Register
                                               AT91C_SSC_TSHR            EQU (0xFFFD4034) ; - (SSC) Transmit Sync Holding Register
                                               AT91C_SSC_SR              EQU (0xFFFD4040) ; - (SSC) Status Register
                                               AT91C_SSC_CMR             EQU (0xFFFD4004) ; - (SSC) Clock Mode Register
                                               AT91C_SSC_TCMR            EQU (0xFFFD4018) ; - (SSC) Transmit Clock Mode Register
                                               AT91C_SSC_CR              EQU (0xFFFD4000) ; - (SSC) Control Register
                                               AT91C_SSC_IMR             EQU (0xFFFD404C) ; - (SSC) Interrupt Mask Register
                                               AT91C_SSC_RFMR            EQU (0xFFFD4014) ; - (SSC) Receive Frame Mode Register
// - ========== Register definition for TWI peripheral ==========
                                               AT91C_TWI_IER             EQU (0xFFFB8024) ; - (TWI) Interrupt Enable Register
                                               AT91C_TWI_CR              EQU (0xFFFB8000) ; - (TWI) Control Register
                                               AT91C_TWI_SR              EQU (0xFFFB8020) ; - (TWI) Status Register
                                               AT91C_TWI_IMR             EQU (0xFFFB802C) ; - (TWI) Interrupt Mask Register
                                               AT91C_TWI_THR             EQU (0xFFFB8034) ; - (TWI) Transmit Holding Register
                                               AT91C_TWI_IDR             EQU (0xFFFB8028) ; - (TWI) Interrupt Disable Register
                                               AT91C_TWI_IADR            EQU (0xFFFB800C) ; - (TWI) Internal Address Register
                                               AT91C_TWI_MMR             EQU (0xFFFB8004) ; - (TWI) Master Mode Register
                                               AT91C_TWI_CWGR            EQU (0xFFFB8010) ; - (TWI) Clock Waveform Generator Register
                                               AT91C_TWI_RHR             EQU (0xFFFB8030) ; - (TWI) Receive Holding Register
// - ========== Register definition for PWMC_CH3 peripheral ==========
                                               AT91C_PWMC_CH3_CUPDR      EQU (0xFFFCC270) ; - (PWMC_CH3) Channel Update Register
                                               AT91C_PWMC_CH3_Reserved   EQU (0xFFFCC274) ; - (PWMC_CH3) Reserved
                                               AT91C_PWMC_CH3_CPRDR      EQU (0xFFFCC268) ; - (PWMC_CH3) Channel Period Register
                                               AT91C_PWMC_CH3_CDTYR      EQU (0xFFFCC264) ; - (PWMC_CH3) Channel Duty Cycle Register
                                               AT91C_PWMC_CH3_CCNTR      EQU (0xFFFCC26C) ; - (PWMC_CH3) Channel Counter Register
                                               AT91C_PWMC_CH3_CMR        EQU (0xFFFCC260) ; - (PWMC_CH3) Channel Mode Register
// - ========== Register definition for PWMC_CH2 peripheral ==========
                                               AT91C_PWMC_CH2_Reserved   EQU (0xFFFCC254) ; - (PWMC_CH2) Reserved
                                               AT91C_PWMC_CH2_CMR        EQU (0xFFFCC240) ; - (PWMC_CH2) Channel Mode Register
                                               AT91C_PWMC_CH2_CCNTR      EQU (0xFFFCC24C) ; - (PWMC_CH2) Channel Counter Register
                                               AT91C_PWMC_CH2_CPRDR      EQU (0xFFFCC248) ; - (PWMC_CH2) Channel Period Register
                                               AT91C_PWMC_CH2_CUPDR      EQU (0xFFFCC250) ; - (PWMC_CH2) Channel Update Register
                                               AT91C_PWMC_CH2_CDTYR      EQU (0xFFFCC244) ; - (PWMC_CH2) Channel Duty Cycle Register
// - ========== Register definition for PWMC_CH1 peripheral ==========
                                               AT91C_PWMC_CH1_Reserved   EQU (0xFFFCC234) ; - (PWMC_CH1) Reserved
                                               AT91C_PWMC_CH1_CUPDR      EQU (0xFFFCC230) ; - (PWMC_CH1) Channel Update Register
                                               AT91C_PWMC_CH1_CPRDR      EQU (0xFFFCC228) ; - (PWMC_CH1) Channel Period Register
                                               AT91C_PWMC_CH1_CCNTR      EQU (0xFFFCC22C) ; - (PWMC_CH1) Channel Counter Register
                                               AT91C_PWMC_CH1_CDTYR      EQU (0xFFFCC224) ; - (PWMC_CH1) Channel Duty Cycle Register
                                               AT91C_PWMC_CH1_CMR        EQU (0xFFFCC220) ; - (PWMC_CH1) Channel Mode Register
// - ========== Register definition for PWMC_CH0 peripheral ==========
                                               AT91C_PWMC_CH0_Reserved   EQU (0xFFFCC214) ; - (PWMC_CH0) Reserved
                                               AT91C_PWMC_CH0_CPRDR      EQU (0xFFFCC208) ; - (PWMC_CH0) Channel Period Register
                                               AT91C_PWMC_CH0_CDTYR      EQU (0xFFFCC204) ; - (PWMC_CH0) Channel Duty Cycle Register
                                               AT91C_PWMC_CH0_CMR        EQU (0xFFFCC200) ; - (PWMC_CH0) Channel Mode Register
                                               AT91C_PWMC_CH0_CUPDR      EQU (0xFFFCC210) ; - (PWMC_CH0) Channel Update Register
                                               AT91C_PWMC_CH0_CCNTR      EQU (0xFFFCC20C) ; - (PWMC_CH0) Channel Counter Register
// - ========== Register definition for PWMC peripheral ==========
                                               AT91C_PWMC_IDR            EQU (0xFFFCC014) ; - (PWMC) PWMC Interrupt Disable Register
                                               AT91C_PWMC_DIS            EQU (0xFFFCC008) ; - (PWMC) PWMC Disable Register
                                               AT91C_PWMC_IER            EQU (0xFFFCC010) ; - (PWMC) PWMC Interrupt Enable Register
                                               AT91C_PWMC_VR             EQU (0xFFFCC0FC) ; - (PWMC) PWMC Version Register
                                               AT91C_PWMC_ISR            EQU (0xFFFCC01C) ; - (PWMC) PWMC Interrupt Status Register
                                               AT91C_PWMC_SR             EQU (0xFFFCC00C) ; - (PWMC) PWMC Status Register
                                               AT91C_PWMC_IMR            EQU (0xFFFCC018) ; - (PWMC) PWMC Interrupt Mask Register
                                               AT91C_PWMC_MR             EQU (0xFFFCC000) ; - (PWMC) PWMC Mode Register
                                               AT91C_PWMC_ENA            EQU (0xFFFCC004) ; - (PWMC) PWMC Enable Register
// - ========== Register definition for UDP peripheral ==========
                                               AT91C_UDP_IMR             EQU (0xFFFB0018) ; - (UDP) Interrupt Mask Register
                                               AT91C_UDP_FADDR           EQU (0xFFFB0008) ; - (UDP) Function Address Register
                                               AT91C_UDP_NUM             EQU (0xFFFB0000) ; - (UDP) Frame Number Register
                                               AT91C_UDP_FDR             EQU (0xFFFB0050) ; - (UDP) Endpoint FIFO Data Register
                                               AT91C_UDP_ISR             EQU (0xFFFB001C) ; - (UDP) Interrupt Status Register
                                               AT91C_UDP_CSR             EQU (0xFFFB0030) ; - (UDP) Endpoint Control and Status Register
                                               AT91C_UDP_IDR             EQU (0xFFFB0014) ; - (UDP) Interrupt Disable Register
                                               AT91C_UDP_ICR             EQU (0xFFFB0020) ; - (UDP) Interrupt Clear Register
                                               AT91C_UDP_RSTEP           EQU (0xFFFB0028) ; - (UDP) Reset Endpoint Register
                                               AT91C_UDP_TXVC            EQU (0xFFFB0074) ; - (UDP) Transceiver Control Register
                                               AT91C_UDP_GLBSTATE        EQU (0xFFFB0004) ; - (UDP) Global State Register
                                               AT91C_UDP_IER             EQU (0xFFFB0010) ; - (UDP) Interrupt Enable Register
// - ========== Register definition for TC0 peripheral ==========
                                               AT91C_TC0_SR              EQU (0xFFFA0020) ; - (TC0) Status Register
                                               AT91C_TC0_RC              EQU (0xFFFA001C) ; - (TC0) Register C
                                               AT91C_TC0_RB              EQU (0xFFFA0018) ; - (TC0) Register B
                                               AT91C_TC0_CCR             EQU (0xFFFA0000) ; - (TC0) Channel Control Register
                                               AT91C_TC0_CMR             EQU (0xFFFA0004) ; - (TC0) Channel Mode Register (Capture Mode / Waveform Mode)
                                               AT91C_TC0_IER             EQU (0xFFFA0024) ; - (TC0) Interrupt Enable Register
                                               AT91C_TC0_RA              EQU (0xFFFA0014) ; - (TC0) Register A
                                               AT91C_TC0_IDR             EQU (0xFFFA0028) ; - (TC0) Interrupt Disable Register
                                               AT91C_TC0_CV              EQU (0xFFFA0010) ; - (TC0) Counter Value
                                               AT91C_TC0_IMR             EQU (0xFFFA002C) ; - (TC0) Interrupt Mask Register
// - ========== Register definition for TC1 peripheral ==========
                                               AT91C_TC1_RB              EQU (0xFFFA0058) ; - (TC1) Register B
                                               AT91C_TC1_CCR             EQU (0xFFFA0040) ; - (TC1) Channel Control Register
                                               AT91C_TC1_IER             EQU (0xFFFA0064) ; - (TC1) Interrupt Enable Register
                                               AT91C_TC1_IDR             EQU (0xFFFA0068) ; - (TC1) Interrupt Disable Register
                                               AT91C_TC1_SR              EQU (0xFFFA0060) ; - (TC1) Status Register
                                               AT91C_TC1_CMR             EQU (0xFFFA0044) ; - (TC1) Channel Mode Register (Capture Mode / Waveform Mode)
                                               AT91C_TC1_RA              EQU (0xFFFA0054) ; - (TC1) Register A
                                               AT91C_TC1_RC              EQU (0xFFFA005C) ; - (TC1) Register C
                                               AT91C_TC1_IMR             EQU (0xFFFA006C) ; - (TC1) Interrupt Mask Register
                                               AT91C_TC1_CV              EQU (0xFFFA0050) ; - (TC1) Counter Value
// - ========== Register definition for TC2 peripheral ==========
                                               AT91C_TC2_CMR             EQU (0xFFFA0084) ; - (TC2) Channel Mode Register (Capture Mode / Waveform Mode)
                                               AT91C_TC2_CCR             EQU (0xFFFA0080) ; - (TC2) Channel Control Register
                                               AT91C_TC2_CV              EQU (0xFFFA0090) ; - (TC2) Counter Value
                                               AT91C_TC2_RA              EQU (0xFFFA0094) ; - (TC2) Register A
                                               AT91C_TC2_RB              EQU (0xFFFA0098) ; - (TC2) Register B
                                               AT91C_TC2_IDR             EQU (0xFFFA00A8) ; - (TC2) Interrupt Disable Register
                                               AT91C_TC2_IMR             EQU (0xFFFA00AC) ; - (TC2) Interrupt Mask Register
                                               AT91C_TC2_RC              EQU (0xFFFA009C) ; - (TC2) Register C
                                               AT91C_TC2_IER             EQU (0xFFFA00A4) ; - (TC2) Interrupt Enable Register
                                               AT91C_TC2_SR              EQU (0xFFFA00A0) ; - (TC2) Status Register
// - ========== Register definition for TCB peripheral ==========
                                               AT91C_TCB_BMR             EQU (0xFFFA00C4) ; - (TCB) TC Block Mode Register
                                               AT91C_TCB_BCR             EQU (0xFFFA00C0) ; - (TCB) TC Block Control Register
// - ========== Register definition for CAN_MB0 peripheral ==========
                                               AT91C_CAN_MB0_MDL         EQU (0xFFFD0214) ; - (CAN_MB0) MailBox Data Low Register
                                               AT91C_CAN_MB0_MAM         EQU (0xFFFD0204) ; - (CAN_MB0) MailBox Acceptance Mask Register
                                               AT91C_CAN_MB0_MCR         EQU (0xFFFD021C) ; - (CAN_MB0) MailBox Control Register
                                               AT91C_CAN_MB0_MID         EQU (0xFFFD0208) ; - (CAN_MB0) MailBox ID Register
                                               AT91C_CAN_MB0_MSR         EQU (0xFFFD0210) ; - (CAN_MB0) MailBox Status Register
                                               AT91C_CAN_MB0_MFID        EQU (0xFFFD020C) ; - (CAN_MB0) MailBox Family ID Register
                                               AT91C_CAN_MB0_MDH         EQU (0xFFFD0218) ; - (CAN_MB0) MailBox Data High Register
                                               AT91C_CAN_MB0_MMR         EQU (0xFFFD0200) ; - (CAN_MB0) MailBox Mode Register
// - ========== Register definition for CAN_MB1 peripheral ==========
                                               AT91C_CAN_MB1_MDL         EQU (0xFFFD0234) ; - (CAN_MB1) MailBox Data Low Register
                                               AT91C_CAN_MB1_MID         EQU (0xFFFD0228) ; - (CAN_MB1) MailBox ID Register
                                               AT91C_CAN_MB1_MMR         EQU (0xFFFD0220) ; - (CAN_MB1) MailBox Mode Register
                                               AT91C_CAN_MB1_MSR         EQU (0xFFFD0230) ; - (CAN_MB1) MailBox Status Register
                                               AT91C_CAN_MB1_MAM         EQU (0xFFFD0224) ; - (CAN_MB1) MailBox Acceptance Mask Register
                                               AT91C_CAN_MB1_MDH         EQU (0xFFFD0238) ; - (CAN_MB1) MailBox Data High Register
                                               AT91C_CAN_MB1_MCR         EQU (0xFFFD023C) ; - (CAN_MB1) MailBox Control Register
                                               AT91C_CAN_MB1_MFID        EQU (0xFFFD022C) ; - (CAN_MB1) MailBox Family ID Register
// - ========== Register definition for CAN_MB2 peripheral ==========
                                               AT91C_CAN_MB2_MCR         EQU (0xFFFD025C) ; - (CAN_MB2) MailBox Control Register
                                               AT91C_CAN_MB2_MDH         EQU (0xFFFD0258) ; - (CAN_MB2) MailBox Data High Register
                                               AT91C_CAN_MB2_MID         EQU (0xFFFD0248) ; - (CAN_MB2) MailBox ID Register
