autosportlabs/RaceCapture-Pro_firmware/stm32_base/libs/FreeRTOSV7.6.0/FreeRTOS/Source/portable/GCC/ARM7_AT91SAM7S/ioat91sam7x256.h
                                               AT91C_CAN_MB2_MDL         EQU (0xFFFD0254) ; - (CAN_MB2) MailBox Data Low Register
                                               AT91C_CAN_MB2_MMR         EQU (0xFFFD0240) ; - (CAN_MB2) MailBox Mode Register
                                               AT91C_CAN_MB2_MAM         EQU (0xFFFD0244) ; - (CAN_MB2) MailBox Acceptance Mask Register
                                               AT91C_CAN_MB2_MFID        EQU (0xFFFD024C) ; - (CAN_MB2) MailBox Family ID Register
                                               AT91C_CAN_MB2_MSR         EQU (0xFFFD0250) ; - (CAN_MB2) MailBox Status Register
// - ========== Register definition for CAN_MB3 peripheral ==========
                                               AT91C_CAN_MB3_MFID        EQU (0xFFFD026C) ; - (CAN_MB3) MailBox Family ID Register
                                               AT91C_CAN_MB3_MAM         EQU (0xFFFD0264) ; - (CAN_MB3) MailBox Acceptance Mask Register
                                               AT91C_CAN_MB3_MID         EQU (0xFFFD0268) ; - (CAN_MB3) MailBox ID Register
                                               AT91C_CAN_MB3_MCR         EQU (0xFFFD027C) ; - (CAN_MB3) MailBox Control Register
                                               AT91C_CAN_MB3_MMR         EQU (0xFFFD0260) ; - (CAN_MB3) MailBox Mode Register
                                               AT91C_CAN_MB3_MSR         EQU (0xFFFD0270) ; - (CAN_MB3) MailBox Status Register
                                               AT91C_CAN_MB3_MDL         EQU (0xFFFD0274) ; - (CAN_MB3) MailBox Data Low Register
                                               AT91C_CAN_MB3_MDH         EQU (0xFFFD0278) ; - (CAN_MB3) MailBox Data High Register
// - ========== Register definition for CAN_MB4 peripheral ==========
                                               AT91C_CAN_MB4_MID         EQU (0xFFFD0288) ; - (CAN_MB4) MailBox ID Register
                                               AT91C_CAN_MB4_MMR         EQU (0xFFFD0280) ; - (CAN_MB4) MailBox Mode Register
                                               AT91C_CAN_MB4_MDH         EQU (0xFFFD0298) ; - (CAN_MB4) MailBox Data High Register
                                               AT91C_CAN_MB4_MFID        EQU (0xFFFD028C) ; - (CAN_MB4) MailBox Family ID Register
                                               AT91C_CAN_MB4_MSR         EQU (0xFFFD0290) ; - (CAN_MB4) MailBox Status Register
                                               AT91C_CAN_MB4_MCR         EQU (0xFFFD029C) ; - (CAN_MB4) MailBox Control Register
                                               AT91C_CAN_MB4_MDL         EQU (0xFFFD0294) ; - (CAN_MB4) MailBox Data Low Register
                                               AT91C_CAN_MB4_MAM         EQU (0xFFFD0284) ; - (CAN_MB4) MailBox Acceptance Mask Register
// - ========== Register definition for CAN_MB5 peripheral ==========
                                               AT91C_CAN_MB5_MSR         EQU (0xFFFD02B0) ; - (CAN_MB5) MailBox Status Register
                                               AT91C_CAN_MB5_MCR         EQU (0xFFFD02BC) ; - (CAN_MB5) MailBox Control Register
                                               AT91C_CAN_MB5_MFID        EQU (0xFFFD02AC) ; - (CAN_MB5) MailBox Family ID Register
                                               AT91C_CAN_MB5_MDH         EQU (0xFFFD02B8) ; - (CAN_MB5) MailBox Data High Register
                                               AT91C_CAN_MB5_MID         EQU (0xFFFD02A8) ; - (CAN_MB5) MailBox ID Register
                                               AT91C_CAN_MB5_MMR         EQU (0xFFFD02A0) ; - (CAN_MB5) MailBox Mode Register
                                               AT91C_CAN_MB5_MDL         EQU (0xFFFD02B4) ; - (CAN_MB5) MailBox Data Low Register
                                               AT91C_CAN_MB5_MAM         EQU (0xFFFD02A4) ; - (CAN_MB5) MailBox Acceptance Mask Register
// - ========== Register definition for CAN_MB6 peripheral ==========
                                               AT91C_CAN_MB6_MFID        EQU (0xFFFD02CC) ; - (CAN_MB6) MailBox Family ID Register
                                               AT91C_CAN_MB6_MID         EQU (0xFFFD02C8) ; - (CAN_MB6) MailBox ID Register
                                               AT91C_CAN_MB6_MAM         EQU (0xFFFD02C4) ; - (CAN_MB6) MailBox Acceptance Mask Register
                                               AT91C_CAN_MB6_MSR         EQU (0xFFFD02D0) ; - (CAN_MB6) MailBox Status Register
                                               AT91C_CAN_MB6_MDL         EQU (0xFFFD02D4) ; - (CAN_MB6) MailBox Data Low Register
                                               AT91C_CAN_MB6_MCR         EQU (0xFFFD02DC) ; - (CAN_MB6) MailBox Control Register
                                               AT91C_CAN_MB6_MDH         EQU (0xFFFD02D8) ; - (CAN_MB6) MailBox Data High Register
                                               AT91C_CAN_MB6_MMR         EQU (0xFFFD02C0) ; - (CAN_MB6) MailBox Mode Register
// - ========== Register definition for CAN_MB7 peripheral ==========
                                               AT91C_CAN_MB7_MCR         EQU (0xFFFD02FC) ; - (CAN_MB7) MailBox Control Register
                                               AT91C_CAN_MB7_MDH         EQU (0xFFFD02F8) ; - (CAN_MB7) MailBox Data High Register
                                               AT91C_CAN_MB7_MFID        EQU (0xFFFD02EC) ; - (CAN_MB7) MailBox Family ID Register
                                               AT91C_CAN_MB7_MDL         EQU (0xFFFD02F4) ; - (CAN_MB7) MailBox Data Low Register
                                               AT91C_CAN_MB7_MID         EQU (0xFFFD02E8) ; - (CAN_MB7) MailBox ID Register
                                               AT91C_CAN_MB7_MMR         EQU (0xFFFD02E0) ; - (CAN_MB7) MailBox Mode Register
                                               AT91C_CAN_MB7_MAM         EQU (0xFFFD02E4) ; - (CAN_MB7) MailBox Acceptance Mask Register
                                               AT91C_CAN_MB7_MSR         EQU (0xFFFD02F0) ; - (CAN_MB7) MailBox Status Register
// - ========== Register definition for CAN peripheral ==========
                                               AT91C_CAN_TCR             EQU (0xFFFD0024) ; - (CAN) Transfer Command Register
                                               AT91C_CAN_IMR             EQU (0xFFFD000C) ; - (CAN) Interrupt Mask Register
                                               AT91C_CAN_IER             EQU (0xFFFD0004) ; - (CAN) Interrupt Enable Register
                                               AT91C_CAN_ECR             EQU (0xFFFD0020) ; - (CAN) Error Counter Register
                                               AT91C_CAN_TIMESTP         EQU (0xFFFD001C) ; - (CAN) Time Stamp Register
                                               AT91C_CAN_MR              EQU (0xFFFD0000) ; - (CAN) Mode Register
                                               AT91C_CAN_IDR             EQU (0xFFFD0008) ; - (CAN) Interrupt Disable Register
                                               AT91C_CAN_ACR             EQU (0xFFFD0028) ; - (CAN) Abort Command Register
                                               AT91C_CAN_TIM             EQU (0xFFFD0018) ; - (CAN) Timer Register
                                               AT91C_CAN_SR              EQU (0xFFFD0010) ; - (CAN) Status Register
                                               AT91C_CAN_BR              EQU (0xFFFD0014) ; - (CAN) Baudrate Register
                                               AT91C_CAN_VR              EQU (0xFFFD00FC) ; - (CAN) Version Register
// - ========== Register definition for EMAC peripheral ==========
                                               AT91C_EMAC_ISR            EQU (0xFFFDC024) ; - (EMAC) Interrupt Status Register
                                               AT91C_EMAC_SA4H           EQU (0xFFFDC0B4) ; - (EMAC) Specific Address 4 Top, Last 2 bytes
                                               AT91C_EMAC_SA1L           EQU (0xFFFDC098) ; - (EMAC) Specific Address 1 Bottom, First 4 bytes
                                               AT91C_EMAC_ELE            EQU (0xFFFDC078) ; - (EMAC) Excessive Length Errors Register
                                               AT91C_EMAC_LCOL           EQU (0xFFFDC05C) ; - (EMAC) Late Collision Register
                                               AT91C_EMAC_RLE            EQU (0xFFFDC088) ; - (EMAC) Receive Length Field Mismatch Register
                                               AT91C_EMAC_WOL            EQU (0xFFFDC0C4) ; - (EMAC) Wake On LAN Register
                                               AT91C_EMAC_DTF            EQU (0xFFFDC058) ; - (EMAC) Deferred Transmission Frame Register
                                               AT91C_EMAC_TUND           EQU (0xFFFDC064) ; - (EMAC) Transmit Underrun Error Register
                                               AT91C_EMAC_NCR            EQU (0xFFFDC000) ; - (EMAC) Network Control Register
                                               AT91C_EMAC_SA4L           EQU (0xFFFDC0B0) ; - (EMAC) Specific Address 4 Bottom, First 4 bytes
                                               AT91C_EMAC_RSR            EQU (0xFFFDC020) ; - (EMAC) Receive Status Register
                                               AT91C_EMAC_SA3L           EQU (0xFFFDC0A8) ; - (EMAC) Specific Address 3 Bottom, First 4 bytes
                                               AT91C_EMAC_TSR            EQU (0xFFFDC014) ; - (EMAC) Transmit Status Register
                                               AT91C_EMAC_IDR            EQU (0xFFFDC02C) ; - (EMAC) Interrupt Disable Register
                                               AT91C_EMAC_RSE            EQU (0xFFFDC074) ; - (EMAC) Receive Symbol Errors Register
                                               AT91C_EMAC_ECOL           EQU (0xFFFDC060) ; - (EMAC) Excessive Collision Register
                                               AT91C_EMAC_TID            EQU (0xFFFDC0B8) ; - (EMAC) Type ID Checking Register
                                               AT91C_EMAC_HRB            EQU (0xFFFDC090) ; - (EMAC) Hash Address Bottom[31:0]
                                               AT91C_EMAC_TBQP           EQU (0xFFFDC01C) ; - (EMAC) Transmit Buffer Queue Pointer
                                               AT91C_EMAC_USRIO          EQU (0xFFFDC0C0) ; - (EMAC) USER Input/Output Register
                                               AT91C_EMAC_PTR            EQU (0xFFFDC038) ; - (EMAC) Pause Time Register
                                               AT91C_EMAC_SA2H           EQU (0xFFFDC0A4) ; - (EMAC) Specific Address 2 Top, Last 2 bytes
                                               AT91C_EMAC_ROV            EQU (0xFFFDC070) ; - (EMAC) Receive Overrun Errors Register
                                               AT91C_EMAC_ALE            EQU (0xFFFDC054) ; - (EMAC) Alignment Error Register
                                               AT91C_EMAC_RJA            EQU (0xFFFDC07C) ; - (EMAC) Receive Jabbers Register
                                               AT91C_EMAC_RBQP           EQU (0xFFFDC018) ; - (EMAC) Receive Buffer Queue Pointer
                                               AT91C_EMAC_TPF            EQU (0xFFFDC08C) ; - (EMAC) Transmitted Pause Frames Register
                                               AT91C_EMAC_NCFGR          EQU (0xFFFDC004) ; - (EMAC) Network Configuration Register
                                               AT91C_EMAC_HRT            EQU (0xFFFDC094) ; - (EMAC) Hash Address Top[63:32]
                                               AT91C_EMAC_USF            EQU (0xFFFDC080) ; - (EMAC) Undersize Frames Register
                                               AT91C_EMAC_FCSE           EQU (0xFFFDC050) ; - (EMAC) Frame Check Sequence Error Register
                                               AT91C_EMAC_TPQ            EQU (0xFFFDC0BC) ; - (EMAC) Transmit Pause Quantum Register
                                               AT91C_EMAC_MAN            EQU (0xFFFDC034) ; - (EMAC) PHY Maintenance Register
                                               AT91C_EMAC_FTO            EQU (0xFFFDC040) ; - (EMAC) Frames Transmitted OK Register
                                               AT91C_EMAC_REV            EQU (0xFFFDC0FC) ; - (EMAC) Revision Register
                                               AT91C_EMAC_IMR            EQU (0xFFFDC030) ; - (EMAC) Interrupt Mask Register
                                               AT91C_EMAC_SCF            EQU (0xFFFDC044) ; - (EMAC) Single Collision Frame Register
                                               AT91C_EMAC_PFR            EQU (0xFFFDC03C) ; - (EMAC) Pause Frames received Register
                                               AT91C_EMAC_MCF            EQU (0xFFFDC048) ; - (EMAC) Multiple Collision Frame Register
                                               AT91C_EMAC_NSR            EQU (0xFFFDC008) ; - (EMAC) Network Status Register
                                               AT91C_EMAC_SA2L           EQU (0xFFFDC0A0) ; - (EMAC) Specific Address 2 Bottom, First 4 bytes
                                               AT91C_EMAC_FRO            EQU (0xFFFDC04C) ; - (EMAC) Frames Received OK Register
                                               AT91C_EMAC_IER            EQU (0xFFFDC028) ; - (EMAC) Interrupt Enable Register
                                               AT91C_EMAC_SA1H           EQU (0xFFFDC09C) ; - (EMAC) Specific Address 1 Top, Last 2 bytes
                                               AT91C_EMAC_CSE            EQU (0xFFFDC068) ; - (EMAC) Carrier Sense Error Register
                                               AT91C_EMAC_SA3H           EQU (0xFFFDC0AC) ; - (EMAC) Specific Address 3 Top, Last 2 bytes
                                               AT91C_EMAC_RRE            EQU (0xFFFDC06C) ; - (EMAC) Receive Ressource Error Register
                                               AT91C_EMAC_STE            EQU (0xFFFDC084) ; - (EMAC) SQE Test Error Register
// - ========== Register definition for PDC_ADC peripheral ==========
                                               AT91C_ADC_PTSR            EQU (0xFFFD8124) ; - (PDC_ADC) PDC Transfer Status Register
                                               AT91C_ADC_PTCR            EQU (0xFFFD8120) ; - (PDC_ADC) PDC Transfer Control Register
                                               AT91C_ADC_TNPR            EQU (0xFFFD8118) ; - (PDC_ADC) Transmit Next Pointer Register
                                               AT91C_ADC_TNCR            EQU (0xFFFD811C) ; - (PDC_ADC) Transmit Next Counter Register
                                               AT91C_ADC_RNPR            EQU (0xFFFD8110) ; - (PDC_ADC) Receive Next Pointer Register
                                               AT91C_ADC_RNCR            EQU (0xFFFD8114) ; - (PDC_ADC) Receive Next Counter Register
                                               AT91C_ADC_RPR             EQU (0xFFFD8100) ; - (PDC_ADC) Receive Pointer Register
                                               AT91C_ADC_TCR             EQU (0xFFFD810C) ; - (PDC_ADC) Transmit Counter Register
                                               AT91C_ADC_TPR             EQU (0xFFFD8108) ; - (PDC_ADC) Transmit Pointer Register
                                               AT91C_ADC_RCR             EQU (0xFFFD8104) ; - (PDC_ADC) Receive Counter Register
// - ========== Register definition for ADC peripheral ==========
                                               AT91C_ADC_CDR2            EQU (0xFFFD8038) ; - (ADC) ADC Channel Data Register 2
                                               AT91C_ADC_CDR3            EQU (0xFFFD803C) ; - (ADC) ADC Channel Data Register 3
                                               AT91C_ADC_CDR0            EQU (0xFFFD8030) ; - (ADC) ADC Channel Data Register 0
                                               AT91C_ADC_CDR5            EQU (0xFFFD8044) ; - (ADC) ADC Channel Data Register 5
                                               AT91C_ADC_CHDR            EQU (0xFFFD8014) ; - (ADC) ADC Channel Disable Register
                                               AT91C_ADC_SR              EQU (0xFFFD801C) ; - (ADC) ADC Status Register
                                               AT91C_ADC_CDR4            EQU (0xFFFD8040) ; - (ADC) ADC Channel Data Register 4
                                               AT91C_ADC_CDR1            EQU (0xFFFD8034) ; - (ADC) ADC Channel Data Register 1
                                               AT91C_ADC_LCDR            EQU (0xFFFD8020) ; - (ADC) ADC Last Converted Data Register
                                               AT91C_ADC_IDR             EQU (0xFFFD8028) ; - (ADC) ADC Interrupt Disable Register
                                               AT91C_ADC_CR              EQU (0xFFFD8000) ; - (ADC) ADC Control Register
                                               AT91C_ADC_CDR7            EQU (0xFFFD804C) ; - (ADC) ADC Channel Data Register 7
                                               AT91C_ADC_CDR6            EQU (0xFFFD8048) ; - (ADC) ADC Channel Data Register 6
                                               AT91C_ADC_IER             EQU (0xFFFD8024) ; - (ADC) ADC Interrupt Enable Register
                                               AT91C_ADC_CHER            EQU (0xFFFD8010) ; - (ADC) ADC Channel Enable Register
                                               AT91C_ADC_CHSR            EQU (0xFFFD8018) ; - (ADC) ADC Channel Status Register
                                               AT91C_ADC_MR              EQU (0xFFFD8004) ; - (ADC) ADC Mode Register
                                               AT91C_ADC_IMR             EQU (0xFFFD802C) ; - (ADC) ADC Interrupt Mask Register
// - ========== Register definition for PDC_AES peripheral ==========
                                               AT91C_AES_TPR             EQU (0xFFFA4108) ; - (PDC_AES) Transmit Pointer Register
                                               AT91C_AES_PTCR            EQU (0xFFFA4120) ; - (PDC_AES) PDC Transfer Control Register
                                               AT91C_AES_RNPR            EQU (0xFFFA4110) ; - (PDC_AES) Receive Next Pointer Register
                                               AT91C_AES_TNCR            EQU (0xFFFA411C) ; - (PDC_AES) Transmit Next Counter Register
                                               AT91C_AES_TCR             EQU (0xFFFA410C) ; - (PDC_AES) Transmit Counter Register
                                               AT91C_AES_RCR             EQU (0xFFFA4104) ; - (PDC_AES) Receive Counter Register
                                               AT91C_AES_RNCR            EQU (0xFFFA4114) ; - (PDC_AES) Receive Next Counter Register
                                               AT91C_AES_TNPR            EQU (0xFFFA4118) ; - (PDC_AES) Transmit Next Pointer Register
                                               AT91C_AES_RPR             EQU (0xFFFA4100) ; - (PDC_AES) Receive Pointer Register
                                               AT91C_AES_PTSR            EQU (0xFFFA4124) ; - (PDC_AES) PDC Transfer Status Register
// - ========== Register definition for AES peripheral ==========
                                               AT91C_AES_IVxR            EQU (0xFFFA4060) ; - (AES) Initialization Vector x Register
                                               AT91C_AES_MR              EQU (0xFFFA4004) ; - (AES) Mode Register
                                               AT91C_AES_VR              EQU (0xFFFA40FC) ; - (AES) AES Version Register
                                               AT91C_AES_ODATAxR         EQU (0xFFFA4050) ; - (AES) Output Data x Register
                                               AT91C_AES_IDATAxR         EQU (0xFFFA4040) ; - (AES) Input Data x Register
                                               AT91C_AES_CR              EQU (0xFFFA4000) ; - (AES) Control Register
                                               AT91C_AES_IDR             EQU (0xFFFA4014) ; - (AES) Interrupt Disable Register
                                               AT91C_AES_IMR             EQU (0xFFFA4018) ; - (AES) Interrupt Mask Register
                                               AT91C_AES_IER             EQU (0xFFFA4010) ; - (AES) Interrupt Enable Register
                                               AT91C_AES_KEYWxR          EQU (0xFFFA4020) ; - (AES) Key Word x Register
                                               AT91C_AES_ISR             EQU (0xFFFA401C) ; - (AES) Interrupt Status Register
// - ========== Register definition for PDC_TDES peripheral ==========
                                               AT91C_TDES_RNCR           EQU (0xFFFA8114) ; - (PDC_TDES) Receive Next Counter Register
                                               AT91C_TDES_TCR            EQU (0xFFFA810C) ; - (PDC_TDES) Transmit Counter Register
                                               AT91C_TDES_RCR            EQU (0xFFFA8104) ; - (PDC_TDES) Receive Counter Register
                                               AT91C_TDES_TNPR           EQU (0xFFFA8118) ; - (PDC_TDES) Transmit Next Pointer Register
                                               AT91C_TDES_RNPR           EQU (0xFFFA8110) ; - (PDC_TDES) Receive Next Pointer Register
                                               AT91C_TDES_RPR            EQU (0xFFFA8100) ; - (PDC_TDES) Receive Pointer Register
                                               AT91C_TDES_TNCR           EQU (0xFFFA811C) ; - (PDC_TDES) Transmit Next Counter Register
                                               AT91C_TDES_TPR            EQU (0xFFFA8108) ; - (PDC_TDES) Transmit Pointer Register
                                               AT91C_TDES_PTSR           EQU (0xFFFA8124) ; - (PDC_TDES) PDC Transfer Status Register
                                               AT91C_TDES_PTCR           EQU (0xFFFA8120) ; - (PDC_TDES) PDC Transfer Control Register
// - ========== Register definition for TDES peripheral ==========
                                               AT91C_TDES_KEY2WxR        EQU (0xFFFA8028) ; - (TDES) Key 2 Word x Register
                                               AT91C_TDES_KEY3WxR        EQU (0xFFFA8030) ; - (TDES) Key 3 Word x Register
                                               AT91C_TDES_IDR            EQU (0xFFFA8014) ; - (TDES) Interrupt Disable Register
                                               AT91C_TDES_VR             EQU (0xFFFA80FC) ; - (TDES) TDES Version Register
                                               AT91C_TDES_IVxR           EQU (0xFFFA8060) ; - (TDES) Initialization Vector x Register
                                               AT91C_TDES_ODATAxR        EQU (0xFFFA8050) ; - (TDES) Output Data x Register
                                               AT91C_TDES_IMR            EQU (0xFFFA8018) ; - (TDES) Interrupt Mask Register
                                               AT91C_TDES_MR             EQU (0xFFFA8004) ; - (TDES) Mode Register
                                               AT91C_TDES_CR             EQU (0xFFFA8000) ; - (TDES) Control Register
                                               AT91C_TDES_IER            EQU (0xFFFA8010) ; - (TDES) Interrupt Enable Register
                                               AT91C_TDES_ISR            EQU (0xFFFA801C) ; - (TDES) Interrupt Status Register
                                               AT91C_TDES_IDATAxR        EQU (0xFFFA8040) ; - (TDES) Input Data x Register
