autosportlabs/RaceCapture-Pro_firmware/stm32_base/libs/FreeRTOSV7.6.0/FreeRTOS/Source/portable/GCC/ARM7_AT91SAM7S/ioat91sam7x256.h
                                               AT91C_TDES_KEY1WxR        EQU (0xFFFA8020) ; - (TDES) Key 1 Word x Register

// - *****************************************************************************
// -               PIO DEFINITIONS FOR AT91SAM7X256
// - *****************************************************************************
                                               AT91C_PIO_PA0             EQU (1 <<  0) ; - Pin Controlled by PA0
                                               AT91C_PA0_RXD0            EQU (AT91C_PIO_PA0) ; -  USART 0 Receive Data
                                               AT91C_PIO_PA1             EQU (1 <<  1) ; - Pin Controlled by PA1
                                               AT91C_PA1_TXD0            EQU (AT91C_PIO_PA1) ; -  USART 0 Transmit Data
                                               AT91C_PIO_PA10            EQU (1 << 10) ; - Pin Controlled by PA10
                                               AT91C_PA10_TWD            EQU (AT91C_PIO_PA10) ; -  TWI Two-wire Serial Data
                                               AT91C_PIO_PA11            EQU (1 << 11) ; - Pin Controlled by PA11
                                               AT91C_PA11_TWCK           EQU (AT91C_PIO_PA11) ; -  TWI Two-wire Serial Clock
                                               AT91C_PIO_PA12            EQU (1 << 12) ; - Pin Controlled by PA12
                                               AT91C_PA12_NPCS00         EQU (AT91C_PIO_PA12) ; -  SPI 0 Peripheral Chip Select 0
                                               AT91C_PIO_PA13            EQU (1 << 13) ; - Pin Controlled by PA13
                                               AT91C_PA13_NPCS01         EQU (AT91C_PIO_PA13) ; -  SPI 0 Peripheral Chip Select 1
                                               AT91C_PA13_PCK1           EQU (AT91C_PIO_PA13) ; -  PMC Programmable Clock Output 1
                                               AT91C_PIO_PA14            EQU (1 << 14) ; - Pin Controlled by PA14
                                               AT91C_PA14_NPCS02         EQU (AT91C_PIO_PA14) ; -  SPI 0 Peripheral Chip Select 2
                                               AT91C_PA14_IRQ1           EQU (AT91C_PIO_PA14) ; -  External Interrupt 1
                                               AT91C_PIO_PA15            EQU (1 << 15) ; - Pin Controlled by PA15
                                               AT91C_PA15_NPCS03         EQU (AT91C_PIO_PA15) ; -  SPI 0 Peripheral Chip Select 3
                                               AT91C_PA15_TCLK2          EQU (AT91C_PIO_PA15) ; -  Timer Counter 2 external clock input
                                               AT91C_PIO_PA16            EQU (1 << 16) ; - Pin Controlled by PA16
                                               AT91C_PA16_MISO0          EQU (AT91C_PIO_PA16) ; -  SPI 0 Master In Slave
                                               AT91C_PIO_PA17            EQU (1 << 17) ; - Pin Controlled by PA17
                                               AT91C_PA17_MOSI0          EQU (AT91C_PIO_PA17) ; -  SPI 0 Master Out Slave
                                               AT91C_PIO_PA18            EQU (1 << 18) ; - Pin Controlled by PA18
                                               AT91C_PA18_SPCK0          EQU (AT91C_PIO_PA18) ; -  SPI 0 Serial Clock
                                               AT91C_PIO_PA19            EQU (1 << 19) ; - Pin Controlled by PA19
                                               AT91C_PA19_CANRX          EQU (AT91C_PIO_PA19) ; -  CAN Receive
                                               AT91C_PIO_PA2             EQU (1 <<  2) ; - Pin Controlled by PA2
                                               AT91C_PA2_SCK0            EQU (AT91C_PIO_PA2) ; -  USART 0 Serial Clock
                                               AT91C_PA2_NPCS11          EQU (AT91C_PIO_PA2) ; -  SPI 1 Peripheral Chip Select 1
                                               AT91C_PIO_PA20            EQU (1 << 20) ; - Pin Controlled by PA20
                                               AT91C_PA20_CANTX          EQU (AT91C_PIO_PA20) ; -  CAN Transmit
                                               AT91C_PIO_PA21            EQU (1 << 21) ; - Pin Controlled by PA21
                                               AT91C_PA21_TF             EQU (AT91C_PIO_PA21) ; -  SSC Transmit Frame Sync
                                               AT91C_PA21_NPCS10         EQU (AT91C_PIO_PA21) ; -  SPI 1 Peripheral Chip Select 0
                                               AT91C_PIO_PA22            EQU (1 << 22) ; - Pin Controlled by PA22
                                               AT91C_PA22_TK             EQU (AT91C_PIO_PA22) ; -  SSC Transmit Clock
                                               AT91C_PA22_SPCK1          EQU (AT91C_PIO_PA22) ; -  SPI 1 Serial Clock
                                               AT91C_PIO_PA23            EQU (1 << 23) ; - Pin Controlled by PA23
                                               AT91C_PA23_TD             EQU (AT91C_PIO_PA23) ; -  SSC Transmit data
                                               AT91C_PA23_MOSI1          EQU (AT91C_PIO_PA23) ; -  SPI 1 Master Out Slave
                                               AT91C_PIO_PA24            EQU (1 << 24) ; - Pin Controlled by PA24
                                               AT91C_PA24_RD             EQU (AT91C_PIO_PA24) ; -  SSC Receive Data
                                               AT91C_PA24_MISO1          EQU (AT91C_PIO_PA24) ; -  SPI 1 Master In Slave
                                               AT91C_PIO_PA25            EQU (1 << 25) ; - Pin Controlled by PA25
                                               AT91C_PA25_RK             EQU (AT91C_PIO_PA25) ; -  SSC Receive Clock
                                               AT91C_PA25_NPCS11         EQU (AT91C_PIO_PA25) ; -  SPI 1 Peripheral Chip Select 1
                                               AT91C_PIO_PA26            EQU (1 << 26) ; - Pin Controlled by PA26
                                               AT91C_PA26_RF             EQU (AT91C_PIO_PA26) ; -  SSC Receive Frame Sync
                                               AT91C_PA26_NPCS12         EQU (AT91C_PIO_PA26) ; -  SPI 1 Peripheral Chip Select 2
                                               AT91C_PIO_PA27            EQU (1 << 27) ; - Pin Controlled by PA27
                                               AT91C_PA27_DRXD           EQU (AT91C_PIO_PA27) ; -  DBGU Debug Receive Data
                                               AT91C_PA27_PCK3           EQU (AT91C_PIO_PA27) ; -  PMC Programmable Clock Output 3
                                               AT91C_PIO_PA28            EQU (1 << 28) ; - Pin Controlled by PA28
                                               AT91C_PA28_DTXD           EQU (AT91C_PIO_PA28) ; -  DBGU Debug Transmit Data
                                               AT91C_PIO_PA29            EQU (1 << 29) ; - Pin Controlled by PA29
                                               AT91C_PA29_FIQ            EQU (AT91C_PIO_PA29) ; -  AIC Fast Interrupt Input
                                               AT91C_PA29_NPCS13         EQU (AT91C_PIO_PA29) ; -  SPI 1 Peripheral Chip Select 3
                                               AT91C_PIO_PA3             EQU (1 <<  3) ; - Pin Controlled by PA3
                                               AT91C_PA3_RTS0            EQU (AT91C_PIO_PA3) ; -  USART 0 Ready To Send
                                               AT91C_PA3_NPCS12          EQU (AT91C_PIO_PA3) ; -  SPI 1 Peripheral Chip Select 2
                                               AT91C_PIO_PA30            EQU (1 << 30) ; - Pin Controlled by PA30
                                               AT91C_PA30_IRQ0           EQU (AT91C_PIO_PA30) ; -  External Interrupt 0
                                               AT91C_PA30_PCK2           EQU (AT91C_PIO_PA30) ; -  PMC Programmable Clock Output 2
                                               AT91C_PIO_PA4             EQU (1 <<  4) ; - Pin Controlled by PA4
                                               AT91C_PA4_CTS0            EQU (AT91C_PIO_PA4) ; -  USART 0 Clear To Send
                                               AT91C_PA4_NPCS13          EQU (AT91C_PIO_PA4) ; -  SPI 1 Peripheral Chip Select 3
                                               AT91C_PIO_PA5             EQU (1 <<  5) ; - Pin Controlled by PA5
                                               AT91C_PA5_RXD1            EQU (AT91C_PIO_PA5) ; -  USART 1 Receive Data
                                               AT91C_PIO_PA6             EQU (1 <<  6) ; - Pin Controlled by PA6
                                               AT91C_PA6_TXD1            EQU (AT91C_PIO_PA6) ; -  USART 1 Transmit Data
                                               AT91C_PIO_PA7             EQU (1 <<  7) ; - Pin Controlled by PA7
                                               AT91C_PA7_SCK1            EQU (AT91C_PIO_PA7) ; -  USART 1 Serial Clock
                                               AT91C_PA7_NPCS01          EQU (AT91C_PIO_PA7) ; -  SPI 0 Peripheral Chip Select 1
                                               AT91C_PIO_PA8             EQU (1 <<  8) ; - Pin Controlled by PA8
                                               AT91C_PA8_RTS1            EQU (AT91C_PIO_PA8) ; -  USART 1 Ready To Send
                                               AT91C_PA8_NPCS02          EQU (AT91C_PIO_PA8) ; -  SPI 0 Peripheral Chip Select 2
                                               AT91C_PIO_PA9             EQU (1 <<  9) ; - Pin Controlled by PA9
                                               AT91C_PA9_CTS1            EQU (AT91C_PIO_PA9) ; -  USART 1 Clear To Send
                                               AT91C_PA9_NPCS03          EQU (AT91C_PIO_PA9) ; -  SPI 0 Peripheral Chip Select 3
                                               AT91C_PIO_PB0             EQU (1 <<  0) ; - Pin Controlled by PB0
                                               AT91C_PB0_ETXCK_EREFCK    EQU (AT91C_PIO_PB0) ; -  Ethernet MAC Transmit Clock/Reference Clock
                                               AT91C_PB0_PCK0            EQU (AT91C_PIO_PB0) ; -  PMC Programmable Clock Output 0
                                               AT91C_PIO_PB1             EQU (1 <<  1) ; - Pin Controlled by PB1
                                               AT91C_PB1_ETXEN           EQU (AT91C_PIO_PB1) ; -  Ethernet MAC Transmit Enable
                                               AT91C_PIO_PB10            EQU (1 << 10) ; - Pin Controlled by PB10
                                               AT91C_PB10_ETX2           EQU (AT91C_PIO_PB10) ; -  Ethernet MAC Transmit Data 2
                                               AT91C_PB10_NPCS11         EQU (AT91C_PIO_PB10) ; -  SPI 1 Peripheral Chip Select 1
                                               AT91C_PIO_PB11            EQU (1 << 11) ; - Pin Controlled by PB11
                                               AT91C_PB11_ETX3           EQU (AT91C_PIO_PB11) ; -  Ethernet MAC Transmit Data 3
                                               AT91C_PB11_NPCS12         EQU (AT91C_PIO_PB11) ; -  SPI 1 Peripheral Chip Select 2
                                               AT91C_PIO_PB12            EQU (1 << 12) ; - Pin Controlled by PB12
                                               AT91C_PB12_ETXER          EQU (AT91C_PIO_PB12) ; -  Ethernet MAC Transmikt Coding Error
                                               AT91C_PB12_TCLK0          EQU (AT91C_PIO_PB12) ; -  Timer Counter 0 external clock input
                                               AT91C_PIO_PB13            EQU (1 << 13) ; - Pin Controlled by PB13
                                               AT91C_PB13_ERX2           EQU (AT91C_PIO_PB13) ; -  Ethernet MAC Receive Data 2
                                               AT91C_PB13_NPCS01         EQU (AT91C_PIO_PB13) ; -  SPI 0 Peripheral Chip Select 1
                                               AT91C_PIO_PB14            EQU (1 << 14) ; - Pin Controlled by PB14
                                               AT91C_PB14_ERX3           EQU (AT91C_PIO_PB14) ; -  Ethernet MAC Receive Data 3
                                               AT91C_PB14_NPCS02         EQU (AT91C_PIO_PB14) ; -  SPI 0 Peripheral Chip Select 2
                                               AT91C_PIO_PB15            EQU (1 << 15) ; - Pin Controlled by PB15
                                               AT91C_PB15_ERXDV          EQU (AT91C_PIO_PB15) ; -  Ethernet MAC Receive Data Valid
                                               AT91C_PIO_PB16            EQU (1 << 16) ; - Pin Controlled by PB16
                                               AT91C_PB16_ECOL           EQU (AT91C_PIO_PB16) ; -  Ethernet MAC Collision Detected
                                               AT91C_PB16_NPCS13         EQU (AT91C_PIO_PB16) ; -  SPI 1 Peripheral Chip Select 3
                                               AT91C_PIO_PB17            EQU (1 << 17) ; - Pin Controlled by PB17
                                               AT91C_PB17_ERXCK          EQU (AT91C_PIO_PB17) ; -  Ethernet MAC Receive Clock
                                               AT91C_PB17_NPCS03         EQU (AT91C_PIO_PB17) ; -  SPI 0 Peripheral Chip Select 3
                                               AT91C_PIO_PB18            EQU (1 << 18) ; - Pin Controlled by PB18
                                               AT91C_PB18_EF100          EQU (AT91C_PIO_PB18) ; -  Ethernet MAC Force 100 Mbits/sec
                                               AT91C_PB18_ADTRG          EQU (AT91C_PIO_PB18) ; -  ADC External Trigger
                                               AT91C_PIO_PB19            EQU (1 << 19) ; - Pin Controlled by PB19
                                               AT91C_PB19_PWM0           EQU (AT91C_PIO_PB19) ; -  PWM Channel 0
                                               AT91C_PB19_TCLK1          EQU (AT91C_PIO_PB19) ; -  Timer Counter 1 external clock input
                                               AT91C_PIO_PB2             EQU (1 <<  2) ; - Pin Controlled by PB2
                                               AT91C_PB2_ETX0            EQU (AT91C_PIO_PB2) ; -  Ethernet MAC Transmit Data 0
                                               AT91C_PIO_PB20            EQU (1 << 20) ; - Pin Controlled by PB20
                                               AT91C_PB20_PWM1           EQU (AT91C_PIO_PB20) ; -  PWM Channel 1
                                               AT91C_PB20_PCK0           EQU (AT91C_PIO_PB20) ; -  PMC Programmable Clock Output 0
                                               AT91C_PIO_PB21            EQU (1 << 21) ; - Pin Controlled by PB21
                                               AT91C_PB21_PWM2           EQU (AT91C_PIO_PB21) ; -  PWM Channel 2
                                               AT91C_PB21_PCK1           EQU (AT91C_PIO_PB21) ; -  PMC Programmable Clock Output 1
                                               AT91C_PIO_PB22            EQU (1 << 22) ; - Pin Controlled by PB22
                                               AT91C_PB22_PWM3           EQU (AT91C_PIO_PB22) ; -  PWM Channel 3
                                               AT91C_PB22_PCK2           EQU (AT91C_PIO_PB22) ; -  PMC Programmable Clock Output 2
                                               AT91C_PIO_PB23            EQU (1 << 23) ; - Pin Controlled by PB23
                                               AT91C_PB23_TIOA0          EQU (AT91C_PIO_PB23) ; -  Timer Counter 0 Multipurpose Timer I/O Pin A
                                               AT91C_PB23_DCD1           EQU (AT91C_PIO_PB23) ; -  USART 1 Data Carrier Detect
                                               AT91C_PIO_PB24            EQU (1 << 24) ; - Pin Controlled by PB24
                                               AT91C_PB24_TIOB0          EQU (AT91C_PIO_PB24) ; -  Timer Counter 0 Multipurpose Timer I/O Pin B
                                               AT91C_PB24_DSR1           EQU (AT91C_PIO_PB24) ; -  USART 1 Data Set ready
                                               AT91C_PIO_PB25            EQU (1 << 25) ; - Pin Controlled by PB25
                                               AT91C_PB25_TIOA1          EQU (AT91C_PIO_PB25) ; -  Timer Counter 1 Multipurpose Timer I/O Pin A
                                               AT91C_PB25_DTR1           EQU (AT91C_PIO_PB25) ; -  USART 1 Data Terminal ready
                                               AT91C_PIO_PB26            EQU (1 << 26) ; - Pin Controlled by PB26
                                               AT91C_PB26_TIOB1          EQU (AT91C_PIO_PB26) ; -  Timer Counter 1 Multipurpose Timer I/O Pin B
                                               AT91C_PB26_RI1            EQU (AT91C_PIO_PB26) ; -  USART 1 Ring Indicator
                                               AT91C_PIO_PB27            EQU (1 << 27) ; - Pin Controlled by PB27
                                               AT91C_PB27_TIOA2          EQU (AT91C_PIO_PB27) ; -  Timer Counter 2 Multipurpose Timer I/O Pin A
                                               AT91C_PB27_PWM0           EQU (AT91C_PIO_PB27) ; -  PWM Channel 0
                                               AT91C_PIO_PB28            EQU (1 << 28) ; - Pin Controlled by PB28
                                               AT91C_PB28_TIOB2          EQU (AT91C_PIO_PB28) ; -  Timer Counter 2 Multipurpose Timer I/O Pin B
                                               AT91C_PB28_PWM1           EQU (AT91C_PIO_PB28) ; -  PWM Channel 1
                                               AT91C_PIO_PB29            EQU (1 << 29) ; - Pin Controlled by PB29
                                               AT91C_PB29_PCK1           EQU (AT91C_PIO_PB29) ; -  PMC Programmable Clock Output 1
                                               AT91C_PB29_PWM2           EQU (AT91C_PIO_PB29) ; -  PWM Channel 2
                                               AT91C_PIO_PB3             EQU (1 <<  3) ; - Pin Controlled by PB3
                                               AT91C_PB3_ETX1            EQU (AT91C_PIO_PB3) ; -  Ethernet MAC Transmit Data 1
                                               AT91C_PIO_PB30            EQU (1 << 30) ; - Pin Controlled by PB30
                                               AT91C_PB30_PCK2           EQU (AT91C_PIO_PB30) ; -  PMC Programmable Clock Output 2
                                               AT91C_PB30_PWM3           EQU (AT91C_PIO_PB30) ; -  PWM Channel 3
                                               AT91C_PIO_PB4             EQU (1 <<  4) ; - Pin Controlled by PB4
                                               AT91C_PB4_ECRS_ECRSDV     EQU (AT91C_PIO_PB4) ; -  Ethernet MAC Carrier Sense/Carrier Sense and Data Valid
                                               AT91C_PIO_PB5             EQU (1 <<  5) ; - Pin Controlled by PB5
                                               AT91C_PB5_ERX0            EQU (AT91C_PIO_PB5) ; -  Ethernet MAC Receive Data 0
                                               AT91C_PIO_PB6             EQU (1 <<  6) ; - Pin Controlled by PB6
                                               AT91C_PB6_ERX1            EQU (AT91C_PIO_PB6) ; -  Ethernet MAC Receive Data 1
                                               AT91C_PIO_PB7             EQU (1 <<  7) ; - Pin Controlled by PB7
                                               AT91C_PB7_ERXER           EQU (AT91C_PIO_PB7) ; -  Ethernet MAC Receive Error
                                               AT91C_PIO_PB8             EQU (1 <<  8) ; - Pin Controlled by PB8
                                               AT91C_PB8_EMDC            EQU (AT91C_PIO_PB8) ; -  Ethernet MAC Management Data Clock
                                               AT91C_PIO_PB9             EQU (1 <<  9) ; - Pin Controlled by PB9
                                               AT91C_PB9_EMDIO           EQU (AT91C_PIO_PB9) ; -  Ethernet MAC Management Data Input/Output

// - *****************************************************************************
// -               PERIPHERAL ID DEFINITIONS FOR AT91SAM7X256
// - *****************************************************************************
                                               AT91C_ID_FIQ              EQU ( 0) ; - Advanced Interrupt Controller (FIQ)
                                               AT91C_ID_SYS              EQU ( 1) ; - System Peripheral
                                               AT91C_ID_PIOA             EQU ( 2) ; - Parallel IO Controller A
                                               AT91C_ID_PIOB             EQU ( 3) ; - Parallel IO Controller B
                                               AT91C_ID_SPI0             EQU ( 4) ; - Serial Peripheral Interface 0
                                               AT91C_ID_SPI1             EQU ( 5) ; - Serial Peripheral Interface 1
                                               AT91C_ID_US0              EQU ( 6) ; - USART 0
                                               AT91C_ID_US1              EQU ( 7) ; - USART 1
                                               AT91C_ID_SSC              EQU ( 8) ; - Serial Synchronous Controller
                                               AT91C_ID_TWI              EQU ( 9) ; - Two-Wire Interface
                                               AT91C_ID_PWMC             EQU (10) ; - PWM Controller
                                               AT91C_ID_UDP              EQU (11) ; - USB Device Port
                                               AT91C_ID_TC0              EQU (12) ; - Timer Counter 0
                                               AT91C_ID_TC1              EQU (13) ; - Timer Counter 1
                                               AT91C_ID_TC2              EQU (14) ; - Timer Counter 2
                                               AT91C_ID_CAN              EQU (15) ; - Control Area Network Controller
                                               AT91C_ID_EMAC             EQU (16) ; - Ethernet MAC
                                               AT91C_ID_ADC              EQU (17) ; - Analog-to-Digital Converter
                                               AT91C_ID_AES              EQU (18) ; - Advanced Encryption Standard 128-bit
                                               AT91C_ID_TDES             EQU (19) ; - Triple Data Encryption Standard
                                               AT91C_ID_20_Reserved      EQU (20) ; - Reserved
                                               AT91C_ID_21_Reserved      EQU (21) ; - Reserved
                                               AT91C_ID_22_Reserved      EQU (22) ; - Reserved
                                               AT91C_ID_23_Reserved      EQU (23) ; - Reserved
                                               AT91C_ID_24_Reserved      EQU (24) ; - Reserved
                                               AT91C_ID_25_Reserved      EQU (25) ; - Reserved
                                               AT91C_ID_26_Reserved      EQU (26) ; - Reserved
                                               AT91C_ID_27_Reserved      EQU (27) ; - Reserved
                                               AT91C_ID_28_Reserved      EQU (28) ; - Reserved
                                               AT91C_ID_29_Reserved      EQU (29) ; - Reserved
                                               AT91C_ID_IRQ0             EQU (30) ; - Advanced Interrupt Controller (IRQ0)
                                               AT91C_ID_IRQ1             EQU (31) ; - Advanced Interrupt Controller (IRQ1)

