autosportlabs/RaceCapture-Pro_firmware/stm32_base/libs/FreeRTOSV7.6.0/FreeRTOS/Source/portable/GCC/ARM7_AT91SAM7S/ioat91sam7x256.h
// - *****************************************************************************
// -               BASE ADDRESS DEFINITIONS FOR AT91SAM7X256
// - *****************************************************************************
                                               AT91C_BASE_SYS            EQU (0xFFFFF000) ; - (SYS) Base Address
                                               AT91C_BASE_AIC            EQU (0xFFFFF000) ; - (AIC) Base Address
                                               AT91C_BASE_PDC_DBGU       EQU (0xFFFFF300) ; - (PDC_DBGU) Base Address
                                               AT91C_BASE_DBGU           EQU (0xFFFFF200) ; - (DBGU) Base Address
                                               AT91C_BASE_PIOA           EQU (0xFFFFF400) ; - (PIOA) Base Address
                                               AT91C_BASE_PIOB           EQU (0xFFFFF600) ; - (PIOB) Base Address
                                               AT91C_BASE_CKGR           EQU (0xFFFFFC20) ; - (CKGR) Base Address
                                               AT91C_BASE_PMC            EQU (0xFFFFFC00) ; - (PMC) Base Address
                                               AT91C_BASE_RSTC           EQU (0xFFFFFD00) ; - (RSTC) Base Address
                                               AT91C_BASE_RTTC           EQU (0xFFFFFD20) ; - (RTTC) Base Address
                                               AT91C_BASE_PITC           EQU (0xFFFFFD30) ; - (PITC) Base Address
                                               AT91C_BASE_WDTC           EQU (0xFFFFFD40) ; - (WDTC) Base Address
                                               AT91C_BASE_VREG           EQU (0xFFFFFD60) ; - (VREG) Base Address
                                               AT91C_BASE_MC             EQU (0xFFFFFF00) ; - (MC) Base Address
                                               AT91C_BASE_PDC_SPI1       EQU (0xFFFE4100) ; - (PDC_SPI1) Base Address
                                               AT91C_BASE_SPI1           EQU (0xFFFE4000) ; - (SPI1) Base Address
                                               AT91C_BASE_PDC_SPI0       EQU (0xFFFE0100) ; - (PDC_SPI0) Base Address
                                               AT91C_BASE_SPI0           EQU (0xFFFE0000) ; - (SPI0) Base Address
                                               AT91C_BASE_PDC_US1        EQU (0xFFFC4100) ; - (PDC_US1) Base Address
                                               AT91C_BASE_US1            EQU (0xFFFC4000) ; - (US1) Base Address
                                               AT91C_BASE_PDC_US0        EQU (0xFFFC0100) ; - (PDC_US0) Base Address
                                               AT91C_BASE_US0            EQU (0xFFFC0000) ; - (US0) Base Address
                                               AT91C_BASE_PDC_SSC        EQU (0xFFFD4100) ; - (PDC_SSC) Base Address
                                               AT91C_BASE_SSC            EQU (0xFFFD4000) ; - (SSC) Base Address
                                               AT91C_BASE_TWI            EQU (0xFFFB8000) ; - (TWI) Base Address
                                               AT91C_BASE_PWMC_CH3       EQU (0xFFFCC260) ; - (PWMC_CH3) Base Address
                                               AT91C_BASE_PWMC_CH2       EQU (0xFFFCC240) ; - (PWMC_CH2) Base Address
                                               AT91C_BASE_PWMC_CH1       EQU (0xFFFCC220) ; - (PWMC_CH1) Base Address
                                               AT91C_BASE_PWMC_CH0       EQU (0xFFFCC200) ; - (PWMC_CH0) Base Address
                                               AT91C_BASE_PWMC           EQU (0xFFFCC000) ; - (PWMC) Base Address
                                               AT91C_BASE_UDP            EQU (0xFFFB0000) ; - (UDP) Base Address
                                               AT91C_BASE_TC0            EQU (0xFFFA0000) ; - (TC0) Base Address
                                               AT91C_BASE_TC1            EQU (0xFFFA0040) ; - (TC1) Base Address
                                               AT91C_BASE_TC2            EQU (0xFFFA0080) ; - (TC2) Base Address
                                               AT91C_BASE_TCB            EQU (0xFFFA0000) ; - (TCB) Base Address
                                               AT91C_BASE_CAN_MB0        EQU (0xFFFD0200) ; - (CAN_MB0) Base Address
                                               AT91C_BASE_CAN_MB1        EQU (0xFFFD0220) ; - (CAN_MB1) Base Address
                                               AT91C_BASE_CAN_MB2        EQU (0xFFFD0240) ; - (CAN_MB2) Base Address
                                               AT91C_BASE_CAN_MB3        EQU (0xFFFD0260) ; - (CAN_MB3) Base Address
                                               AT91C_BASE_CAN_MB4        EQU (0xFFFD0280) ; - (CAN_MB4) Base Address
                                               AT91C_BASE_CAN_MB5        EQU (0xFFFD02A0) ; - (CAN_MB5) Base Address
                                               AT91C_BASE_CAN_MB6        EQU (0xFFFD02C0) ; - (CAN_MB6) Base Address
                                               AT91C_BASE_CAN_MB7        EQU (0xFFFD02E0) ; - (CAN_MB7) Base Address
                                               AT91C_BASE_CAN            EQU (0xFFFD0000) ; - (CAN) Base Address
                                               AT91C_BASE_EMAC           EQU (0xFFFDC000) ; - (EMAC) Base Address
                                               AT91C_BASE_PDC_ADC        EQU (0xFFFD8100) ; - (PDC_ADC) Base Address
                                               AT91C_BASE_ADC            EQU (0xFFFD8000) ; - (ADC) Base Address
                                               AT91C_BASE_PDC_AES        EQU (0xFFFA4100) ; - (PDC_AES) Base Address
                                               AT91C_BASE_AES            EQU (0xFFFA4000) ; - (AES) Base Address
                                               AT91C_BASE_PDC_TDES       EQU (0xFFFA8100) ; - (PDC_TDES) Base Address
                                               AT91C_BASE_TDES           EQU (0xFFFA8000) ; - (TDES) Base Address

// - *****************************************************************************
// -               MEMORY MAPPING DEFINITIONS FOR AT91SAM7X256
// - *****************************************************************************
                                               AT91C_ISRAM               EQU (0x00200000) ; - Internal SRAM base address
                                               AT91C_ISRAM_SIZE          EQU (0x00010000) ; - Internal SRAM size in byte (64 Kbyte)
                                               AT91C_IFLASH              EQU (0x00100000) ; - Internal ROM base address
                                               AT91C_IFLASH_SIZE         EQU (0x00040000) ; - Internal ROM size in byte (256 Kbyte)



#endif /* AT91SAM7X256_H */
